{
    "Official Poster for Christopher Nolan's 'Oppenheimer'": [
        "\"I know Scarecrow is a smaller role, Cillian, but stick with me and I'll put you in a lead role in maybe two or three or seventeen years.\"",
        "I can already not hear the dialogue over the amazing visual effects",
        "So many people \"joined\" this movie that I didn't know that Matt Damon or RDJ were in it.",
        "This is an actual pic of Cillian Murphy watching Christopher Nolan detonate an actual bomb on set",
        "The second entry in the series of movies where Cillian Murphy ends up staring at blindingly bright things.",
        "I’m just happy for a poster that isn’t floating heads.",
        "ZE GOGGLES DO NOTHING!",
        ">\"Now I have become Deaf, destroyer of words.\" - \n\nC. Nolan.",
        "[deleted]",
        "This film feels like a special event In the HOLLYWOOD. Like something really special, IDK why but It does.",
        "In theaters July 21, 2023\n\nA new IMAX trailer is playing before Avatar starting tomorrow.",
        "The new Maxell Cassette Tape ad.",
        "I hope this is another great movie featuring Cillian Murphy staring at bright lights",
        "The Trinity test was 25 kilotons. I wouldn't put it past Nolan to truck in that much conventional explosives to get an authentic experience.",
        "I am really excited for this movie.",
        "***This is Fine***",
        "I demand to see the movie poster with all the floating heads. how can I be sure this is a real movie without it??",
        "I hope Nolan doesn't mess up the audio again. My wife was not pleased that I dragged her to watch a movie with bad audio in the middle of COVID.",
        "That poster makes me feel excited and curious about the movie. It's really convincing!",
        "Sick.",
        "Man why it releasing on July 21st? It's about the first atomic bomb, which detonated on July 16th. Sounds like a missed opportunity to me",
        "Based on the Pulitzer Prize winning Kai Bird & Martin Sherwin book. \n\nhttps://kaibird.com/\n\nOpinion: I would urge you to support your local book store or library, not Amazon, if you should choose to turn some tactile or digital pages.",
        "At first glance I thought that was the Jim Carey’s Grinch scene where he rigs a sleigh like a rocket",
        "I can already hear this movie.",
        "I really hope they have some scenes from the demon core. This scene in particular was amazing in a previous movie:\n\n[https://www.youtube.com/watch?v=AQ0P7R9CfCY](https://www.youtube.com/watch?v=AQ0P7R9CfCY)\n\nSome of the scientists doing testing on the new plutonium core got a little reckless in how they handled it. In the scene above, the demon core goes prompt critical (I think that's what it is called) and everyone in the room received a lot of radiation exposure. Unfortunately for Slotin (Think this is him -- there were two scientists killed by the demon core), the amount of radiation he received was fatal.\n\nAs a scientist well educated in radioactivity and the math behind exposure amounts, he knew as soon as he separated the two cores that he was a walking dead man. It must have been really depressing to realize your life was now over and you were living on borrowed time just from a few seconds of exposure from something that was extremely radioactive (and I don't use that word lightly, that thing was putting out some serious levels of radiation).\n\nIn fact, I heard stories that some of the scientists saw a lot of blue in their vision and that it was related to a type of radiation that is created when it travels through water (I forget the name for this type of radiation -- I think it starts with a K?).\n\nAnyway, looking forward to the movie!",
        "Well this poster certainly takes your attention.",
        "Cillian's gonna smash it",
        "I like how IMAX is bigger font than stars and director.",
        "This fucks.",
        "Is Cillian Murphy one of the most underrated/understated actors? I've always liked him in all his roles.",
        "I really like it but I kinda wished the poster would be in black and white",
        "This looks like Alfred Molina from Spiderman 2 doing his experiment",
        "All looks good unless Nolan complicates the plot with confusing screenplay, in audible dialogues and throws in some time paradoxes.",
        "What an amazing cast.",
        "You fucks really ride Nolan's dick.",
        "Sunshine 2",
        "Subtitles will be your friend for this one. Along with all Nolan movies post Dark Knight",
        "Awh man I was really looking forward to a floating mountain of stacked heads of the all the leads superimposed in front of a mushroom cloud smh",
        "Looks like a weezer album cover",
        "Nice image, but if this is portraying Oppenheimer at Trinity, probably not historically accurate. (edit: I don't mind the ahistoric portrayal. Just comparing history to fiction for fun. I am psyched for this movie and hope Nolan takes a bunch of liberties to make it more cinematic!)\n\nDuring the Trinity Test, Oppenheimer was in S-10,000, the control bunker, which was an earthern bunker with no windows. Scientists in that bunker did report seeing a bright light, but through the open back door, which was facing away from the explosion.\n\nN-10,000 was a different bunker, for cameras, which did have round windows, but Oppenheimer was not there.\n\n>Three observation points were established at 10,000 yards from ground zero. These were wooden shelters protected by concrete and earth. The south bunker served as the control center for the test. The automatic firing device was triggered from there as key men such as Dr. Robert Oppenheimer, head of Los Alamos, watched. None of the manned bunkers are left.\n\nhttps://www.atomicarchive.com/history/trinity/test.html\n\n>Groves and Oppenheimer, standing at the S-10,000 control bunker, discussed what to do if the weather did not break in time for the scheduled 4:00 a.m. test. At 3:30 they pushed the time back to 5:30; at 4:00 the rain stopped. Kistiakowsky and his team armed the device shortly after 5:00 a.m. and retreated to S-10,000. In accordance with his policy that each observe from different locations in case of an accident, Groves left Oppenheimer and joined Bush and Conant at base camp\n\nhttps://www.atomicarchive.com/history/manhattan-project/p5s5.html\n\nInterview with some present at Trinity talking about the bunkers:\nhttps://youtu.be/4rGUBKpAYuE\n\n>Joe McKibben, another scientist, said, \"We had a lot of flood lights on for taking movies of the control panel. When the bomb went off, the lights were drowned out by the big light coming in through the open door in the back.\"\n\nhttps://www.atomicarchive.com/history/trinity/test.html",
        "Overated director",
        "Can't wait to see how Nolan overcomplicates and ruins this",
        "real cinema is back",
        "Flashbang, The Poster.",
        "Where Sagman, Bennett, Robbins, and Taft",
        "Can’t wait to not understand what anyone is saying.",
        "You know the bar is low when a movie poster not containing the floating disembodied heads of the entire cast makes a movie seem interesting.",
        "I am become excited",
        "Well fuck - we all know Nolan's opinion on using real-world effects...\n\nAnybody lost any nukes lately?...",
        "Question is, will Cillian Murphy have a bag over his head in this one?",
        "I'm glad Cillian Murphy is getting the big screen spotlight. That dude is a great actor.",
        "Cillian Murphy as the lead role in anything makes my knees weak!",
        "Has it been 17 years since Batman begins?",
        "Seek out test footage of him as Bruce Wayne/Bats. They were impressed and he looked and sounded *great*, the problem is he's just too damn small.\n\nNolan had his back ever since then.",
        "To be fair, Cillian screen tested for Batman, so getting Scarecrow was a big coup. Murphy gives such a gleeful performance - \"Well, he's not faking. Not that one!\"",
        "Inception was closer to a lead role at least",
        "Smaller role? He was the main villain of Batman Begins.",
        "He put him in five of his movies, not including this one.  I mean... what do you want?  Sure, he hasn't gotten a Brock Lesnar-like push, but he's getting paychecks, and he fucking slays every role he plays.  I'm in love with the lineup of Oppenheimer.",
        "I actually loved how Scarecrow was used throughout the Nolan trilogy. dude went from being the villain of the first movie to just cameo appearances in the next two, but it made that Gotham feel alive. when Gotham goes to mob rule and he’s the head of the weird ice court thing I thought it was the neatest idea.",
        "Isn't he the only Batman villain that appears in all 3 Nolan Batman movies?",
        "Well he spent like 7 years doing PEAKY FOKKKN BLINDUHS so its ok",
        "What about Dunkirk! More like… 12 years",
        "Hey man, he was absolutely great in Inception",
        "Nolan be like it’s cheaper to buy a surplus atomic bomb and pay for the fines for violating SALT II than to use CGI",
        "Every Nolan thread...reddit likes the comfort of a familiar comment.",
        "[deleted]",
        "That feeling when you read about him blaming the theaters. Like goddamn, his head really is up his own ass.",
        "You couldn't hear anything? Now you won't be able to see anything! Nolan is a genius!",
        "The ability to clearly hear the audio could make this one of my all time favorite movies, but if I can’t, I’m not even going to watch it. I’m done with this.",
        "Just shows Nolan's pull, I think. There are some directors that actors will jump at any chance to work with. Like back in the day with Scorsese, when James Woods told him he'd work (and I'm paraphrasing) anywhere, in any part, for any salary. \n\nCool that Nolan has that reputation and pull. I have high hopes for the movie. Only scared because Nolan's weakness has always been the personal/people element, which I imagine is the focus of a movie like this unless he goes in a very different direction.",
        "There was a picture on here the other days from the set, it looks like RDJ is harry Truman and looks spot on.\n\nEdit: I appear to have mistaken, Gary Oldman is set to be Truman. I’m having trouble linking it but it looks like character posters are out on Twitter. 🤦🏼‍♂️",
        "I feel like I’m gonna find out that I joined the cast once I finally watch it. I wonder who I’m gonna play.",
        "Fortune favors the bold",
        "I have no doubt Nolan could convince a film bro in DoD to lend him a little atomic bomb. Just a little one, it's no problem!",
        "[deleted]",
        "Turns out George was filming the whole time!",
        "Thank you for reminding me that I’ve been meaning to watch that film\n\nEdit: film is called _Sunshine_.",
        "I was just thinking, \"This looks like a Sunshine poster.\"",
        "Sunshine is a fantastic film. The 3rd act is wack, but it makes up for it in the finale.\n\n\nEdit: blundered",
        "Blindingly bright nuclear reactions, even.",
        "...I'd have two nickels. But it's weird that it happened twice",
        "Actually a pretty sick poster tbh. Invokes a feeling of awe/wonderment, creates questions, visually striking etc. Solid.",
        "[deleted]",
        "Give it time",
        "Just wait, once we get closer to the release date, the dreaded floating heads will return.",
        "What is this referencing to? Help!",
        "It's time to dust off [this marvel of a poster](https://i.imgur.com/QKZuLs1.jpg).",
        "Up and at them!",
        "I know this is the kind of thing reddit loves to be pedantic about, but I've always seen it written \"Ze\"\n\nZe goggles, ze Germans...",
        "My son returns from a fancy east coast college and I'm horrified to find he's a nerd.\n\n*I'm laughing already!*\n\nIt's not a comedy.",
        "ShaGuar takes out ShaGuar!",
        "#WHAT?",
        "This poster has me scared that half of the movie will be impossible to see what is happening and with the last one I don’t expect to hear anything either.",
        "I hope this comment receives the upvotes it deserves.",
        "Listening to you took everything I have left\n\nAfter your raps, I am become deaf",
        "I had to read this too many times to realize the changes were intentional and not in error.",
        "bro you made me burst out laughing and my girlfriend had to apologize in her meeting",
        "Of course a paragraph later he recounts ducking under the dash of the truck because it was so blindingly bright and complained of seeing an after image.",
        "Shirley you're joking",
        "Decently budgeted movie by an auteur that's not comic books? I think that's why. Hollywood doesn't do that much anymore.",
        "I don’t think it’s a mystery. Most other filmmakers doing this would have used VFX for the bomb. There have been recordings of nukes, but seeing it through the artistic eye of a film with a great cinematographer is going to be something else.",
        "I love special events in the HOLLYWOOD",
        "Bringing earplugs just for this trailer after Nolan tried to melt my fillings with IMAX Dunkirk. Thanks for the headsup",
        "Is it going to be exclusively shown only in IMAX theatres? Why cant be on YouTube as well :(",
        "Ohhhh fuckkkkkk someone better put it on the internet",
        "Great reference, didn't want you to think nobody noticed.",
        "I pressed down on both Record and Play to capture The Cult on FM radio back in the day, on metal grade Cassettes. two of my listening friends never implied I was peer to peer sharing back then.",
        "I want Cillian Myrphy to stare into my eyes as I fall in love with his.",
        "He just has the most perfect eyes for staring at bright lights. RIP his vision",
        "Turns out surplus russian nukes are cheaper than RDX.",
        "[deleted]",
        "Me too! I just hope it’s not as confusing as Tenet.",
        "Definitely. I'm hoping this is another high concept film tho. I went into Dunkirk with awfully high expectations.",
        "Bring back the days of the main character looking back over their shoulder at us real menacingly. Maybe an explosion in the background, along with \"from the studio behind xyz\".",
        "The audio was great in theaters, i thought it was just home viewers that complained about audio?\n\nI haven't seen anyone complain about the in theater experience personally. Also, Tenet was the first movie to come out in quite some time, surprised you had to drag her! Felt like everyone was excited to finally see a movie in theaters",
        "Why do so many of this comments feel like bought ads.",
        "As fuck.",
        "Mission Impossible releases one week earlier, and there's a Marvel movie dropping one week later. To catch MI and Oppenheimer as many times as I want, I'm going to have to go to the movies multiple times each week lol",
        "Releasing on a Sunday isn't the best for sales, and as we all know if a movie's opening weekend is bad it failed as an ~~investment~~ movie.",
        "He put it that day because it's My Bday lets gooo",
        "BOWWWWWMMMMM!!!!!!!",
        "> I heard stories that some of the scientists saw a lot of blue in their vision and that it was related to a type of radiation that is created when it travels through water (I forget the name for this type of radiation -- I think it starts with a K?).\n\nhttps://en.wikipedia.org/wiki/Cherenkov_radiation\n\n> A classic example of Cherenkov radiation is the characteristic blue glow of an underwater nuclear reactor.",
        "He could smash me too know what i'm saying?",
        "Got you fam: https://ibb.co/RvrVJmv",
        "Yep.  I just read the Making of the Atomic Bomb.  I hope I’m wrong but I expect to be frustrated with this movie.",
        "Good info. If that’s the case I think this is a good example of something that might not be historically accurate but is altered to be more cinematic. Opp and his team changed the world forever, this image is him on metaphorical level getting a glimpse of the new world they were creating.",
        "There has been more time between Batman Begins and now than between Batman Begins and Tim Burton’s Batman.",
        "Holy shit, Batman Begins was released on 2005.... can't believe it has  been 17 years",
        "that creeping sensation you're feeling is mortality winning.",
        "when 2014 is only 3 weeks away😩😩😩",
        "It has. Crazy.",
        "Unlike that hulk of a man Michael Keaton",
        "I was about to say Patterson is only 6’1 then I looked up Murphy and he’s short damn.  Thomas Shelby is 5’7 3/4",
        "Just have him stand on a box like Tom Cruise",
        "God dammit I fucking LOVED his Batman voice though... blew Bale's outta the water.",
        "Nolan prefer to work with the same actors whom he built great relationships before. Not only it makes for easier and better workplace atmosphere, but also they already know how they work with each other.",
        "He definitely didn't have the right look for Bruce Wayne",
        "Is this [the test footage](https://youtu.be/_knjRA4df3E) you were referring too? His voice was perfect for Batman! Edit: Jump to 5:12",
        "Despite not having the same star power as Bale, he would have been an excellent Batman",
        "“Would you like to see my audition tape?”",
        "I loved him playing the judge, doling out death.",
        "The only Scarecrow who was more unnerving when he wasn't wearing the mask.\n\nCillian's eyes just burn at you.",
        "He was great in [Red Lights](https://www.imdb.com/title/tt1748179/) up against De Niro and Weaver. It might not look like it from the imdb casting, but he's the lead in it.",
        "His character arc is amazing in Inception.",
        "Ra's al Ghul was the main villan. But Cillian was in all three movies.",
        "Secondary. Ras al ghul was the main baddie",
        "Actually, Mister Camera, Crazy Quilt, Egghead, and Condiment King are all standing just out of shot in several scenes in all three movies.",
        "*Neil DeGrasse Tyson comes out in favor of practical effects for the most realistic look*",
        "Actually, fun fact, [Nolan crashed an *actual* Boeing 747](https://www.gamesradar.com/tenet-christopher-nolan-747-plane-crash-interview/) in Tenet, because it was cheaper than a model or CGI.",
        "If Nolan had any balls, he'd take the *Conquerer* route: make the nukes real and sweep everybody's cancer under the rug in twenty years.",
        "Nah he's doing anti-cgi marketing. Which is weird because he clearly knows how and when to use it. Instead of selling himself as anti-cgi director he should sell himself as a director that uses well and in good moments. Choosing to do practical when possible.",
        "Hey man, if you aren't fishing for upvotes, what's even the point of posting on Reddit? \n\nJust churn out the same jokes and rake in the karma. Why try to have an actual discussion when you can see that number by your name get bigger",
        "I particularly like this one since I watched Tenet with the full knowledge of the controversy surrounding the mixing...\n\n...and it was fine. I could hear every word. And I'm usually a guy who default turns on subtitles because I'm always missing dialogue.",
        "Plus every movie poster thread: a comment about floating heads. Already saw one here.",
        "I wonder if there’s a RES add-on yet that detects certain key phrases and hides the comment from view",
        "The whole point of the movie in my opinion was to showcase the *concept*.. the temporal pincer. IMO Nolan did something really original..and I appreciate it. \nHe deliberately stripped away the characters and the concepts and the emotional components of the movie to showcase the *temporal pincer* as a movie. \n\nLike a r/WoahDude post, but the whole movie. It was a deliberate artistic choice and I can respect that. \n\nIn interviews he mentioned that the dialogue was merely nothing more than a sound effect, and this has been done before.\n\nWhen we go watch a “dumb” comedy movie just for laughs.. we don’t go in expecting to get emotional satiation for it we just want the chuckles and there’s nothing wrong with it, similarly when we watch a deep character study, we look at some works of Daniel Day Lewis, why should a science fiction movie be any different? if it is simply looking for to stimulate a  different kind of response.\nIt’s basically an indie movie with a high budget scale! \nNolan deliberately chose to reduce characters to basic cookie cutter archetypes.. the nameless action spy, the mysterious sidekick, the damsel, the typical Bond villain… simply because they function as nothing more than set dressing.\n\nYou’ll have a lot of fun if you stop looking for meaningful character development, because he didn’t put it there by purpose.. next time when you watch it, try to put the puzzle pieces of the timeline together and you’ll have a lot of fun if that your kind of thing! \n\nNolan made Insomnia, Inception, TDK and he definitely had help, but he’s not a stupid filmmaker who cannot tell if the mixing is wrong. Give him some credit :)",
        "While I’m not overall happy that I sat through Tenet, I am grateful I watched it at home with subs so I could at least understand what they were saying.",
        "I'm not planning on seeing Oppenheimer in theaters until I get some reports that the sound isn't screwed up.\n\nI'm not paying money to watch a screen of murffle mumble durmal frungle.",
        "Interstellar had great characters. You didn't tear up in the scene with McCaunnahdiriejfh sad about the time dilation and missing his daughter's life? I thought that was tragic.",
        "Didn't Jonah Hill do Wolf of Wall Street for basically nothing?",
        "I think Nolan can write the whole people element really well its just a lot of the time he doesn't. All of the characters in Memento, The Prestige and Interstellar were great in my opinion, the characters in Dunkirk and Tenet were pretty much completely sidelined as far as the actual story goes because they were more focused on building tension or batshit crazy time shenanigans.\n\nIf the story is very character driven he can write them well, when it's not he tends to not prioritise them, which in my opinion works pretty well.",
        "Another of his weaknesses is the audio mixing in his movies, which has been shit lately - it was already bad in Interstellar, and Tenet was almost unintelligible without subtitles",
        "> Nolan's weakness has always been the personal/people element\n\nWould you mind expanding your thoughts? I thought Interstellar, Inception, and Dunkirk all had great people moments. The Batman series wasn't bad either, particularly the last two films.",
        "Really? Here I thought Nolan’s main weakness was his sound design…",
        "Nolan's weakness has always been inaudiable dialogues",
        "Wes Anderson is another one that gets his pick of the litter whenever he announces a new project. I think these actors want at least a few prestige films on their resume.",
        ">Robert Downey Jr. appears as Lewis Strauss, chairman of the US Atomic Energy Commission, who would later clash bitterly with Oppenheimer.\n\nhttps://www.gamesradar.com/robert-downey-jr-oppenheimer-christopher-nolan-interview/",
        "No RDJ is Lewis Strauss, basically the main antagonist when it comes to his security hearing.\n\nI'm pretty sure Gary Oldman is Truman. Most likely the voice in the trailer saying 'the force from which the sun draws its power has been loosed\"",
        "The bomb!",
        "Nolan is willing to spend money for authenticity. Like when he grew fields of corn for Interstellar, for Oppenheimer part of the budget went to developing his own nuclear weapons.",
        "No problem at all, barely an inconvenience",
        "They banned above ground testing, nothing on filming for movies",
        "Fun fact: everything nuclear related is handled by DoE including weapons",
        "Just a little  bomb, as a treat",
        "he still has the uranium from Tenet",
        "Yes haha lol but any explosion of that size produces a mushroom cloud.",
        "It's really good!",
        "Sunshine is my all time favorite sci-fi movie.",
        "Which film?",
        "Thanks for reminding me I need to rewatch that for the first time in a decade+.\n\nFree: https://www.youtube.com/watch?v=9irMPMZ4BZI&ab_channel=YouTubeMovies",
        "\"Kaneda, what do you see?\"",
        "I hope this is another great movie featuring Cillian Murphy staring at bright lights",
        "i really like how the incredibly high contrast makes his skin look like the sun, and the embers of particles around him. Really uneasy feeling, very cool poster.",
        "I agree. I actually love this poster.",
        "Didn't Nolan already make a movie called MURPHY, it was the one with the black hole",
        "The only time a Nolan movie's main poster was just floating heads was The Prestige",
        "Especially for this movie.\n\nUniversal is absolutely going to want to show the faces of Cillian Murphy, Emily Blunt, Matt Damon, Robert Downey Jr., and Florence Pugh.",
        "lol Just photoshop the Spider-Man Homecoming poster and replace every face except for RDJ’s.",
        "Movies generally get a handful of posters before their release. Floating head posters are the ones where the whole cast is in costume, posing for the camera over a generic background. \n\nRedditors like to lose their shit over these for some reason, even though more artsy posters usually come out as well.",
        "r/marvelstudios",
        "*....better.*",
        "Up and Atom!",
        "Jiminy jillikers!",
        "How do you sleep at night?",
        "I'm pretty sure this is Rainier Wolfcastle but I can just as easily read it in my head as Tracey Jordan.",
        "Now you *muffled* Mr. Wayne, when you *muffled as fuuuuck* stock market is mine *unintelligible hissing sounds* we'll do this backwards *muffled* in Tenet. I have *inaudible* the sound crew in a freezer *crackle, pop* north of Dunkirk.",
        "BWAAAAAAAUHHHHHHHH",
        "It’s going to premiere alongside the debut of the new Dolby Vision spec with dynamic range bright enough to sear the audience’s retinas and give them radiation burns.",
        "It surprises me that he did this. Sounded very risky for his eyes. I believe I once heard that the official instructions for the people involved were to face away from the small window slit, sit down on the floor, and close your eyes and cover them with your hands. I believe it was said that even then the blast was so bright that they could see the bones in their hands with their eyes closed. Sounds totally believable.",
        "I would love to see this scene in the movie lol",
        "I never joke about nuclear detonations. And don't call me Shirley.",
        "I am really really really tired of capeshit. This movie looks really nice so far",
        "Even with Nolan, it feels like he's getting while the getting good. He's talked about playing on the largest possible canvas for as long as he can, but even for him thst window can close.  Leaving WB, he set up this project almost like a dare. He put put a list of demands that are kind of nuts, not just a budget and a theatrical window, but demanding that the studio go so far as to not release any other movies for a period of time, basically staking their whole late summer on this one film. Universal went for it.\n\nElsewhere you have Scorsese spending  200m to have Jack Fisk redress and entire town as the 1920s, a streamer looking for clout willing to throw down for it. It's such a specific window that won't happen again,  might not have if Apple had already had a best picture winner. \nSame deal with Chazwlle with Baylon which is probably goi g to lose a ton of money. There are some chips getting cashed in right now.",
        "> Most other filmmakers doing this would have used VFX for the bomb.\n\nWait, hold up. What did Nolan do this time? Use an actual nuke?",
        "[deleted]",
        "Meh, it's probably in the BURBANK but non-Angelinos won't know the difference.",
        "Tenet has entered the chat.",
        "You should always bring earplugs for imax",
        "It probably will be leaked",
        "There are dozens of us!",
        "Are you the Sun?",
        "I'm sure he had someone check with the DOD just in case they could spare one.",
        "[deleted]",
        "I'd like to think there is no way this movie could be as confusing as Tenet lmfao. I've watched that 3 times and I'm still not sure I get it.",
        "I don't think it could be, since it's probably more of a biopic.",
        "I just hope we'll actually be able to hear the dialogue.",
        "I didn't see it in theatres, but assuming they saw it in imax, they probably had some ringing in their ears for a couple days after. He needs to get over this obsession with making sound effects 100 times louder than dialogue.",
        "I saw Tenet in theaters and the audio was alright, didn't really have trouble listening to dialogue EXCEPT for one or two scenes where holy shit I understood 0%",
        "I am looking forward to Christopher Nolan's new movie, Oppenheimer, starring Cillian Murphy, featuring Matt Damon, Robert Downey Jr. and Emily Blunt on July 21, 2023, only in IMAX",
        "lol I'm a real human being, I just wrote what I felt after looking at the poster. It might be really good at eliciting a certain response.",
        "Let people enjoy stuff",
        "Least reddity redditor.",
        "I just wish he would step on me- uhh I mean… I’m also very excited to see what he brings to this role",
        "I mean, the fact that the movie is literally called \"Oppenheimer\" when the actual Manhattan project was one of the greatest collaborative efforts of all time should clue you in. Nolan is obsessed with loner heroes who forsake the trappings of human bonds. He made three Batman films without any of the family except Alfred and has another lead character literally called Protagonist.",
        "N-no...",
        "There is only 65 million years between humans and T-Rexes, and 85 million years between the T-Rex and the Stegosaurus.",
        "[removed]",
        "Fuck me",
        "Why you gotta be like that",
        "Nope. You're wrong. Not accepting that.",
        "Awwww man, fuck off.\n\nDaily reminder that I'm rapidly aging.",
        "Huh, you just made me realize my birthday is perfectly in the middle of Batman 89' and Batman Begins.",
        "Shut up, we're not getting old.",
        "So you're saying we're closer to 2038 than 2005?",
        "I think it’s just cause I work from home now and I can get drunk whenever I want and now I’m hungover",
        "Fair point but they were going for a different approach. Keaton was hidden by Burton shadows. They wanted to show off a physical Batman. Go back and look at Bale in Begins and he's a beast.",
        "I almost busted out laughing in public. Thank u",
        "Keaton wanted someone who could play an aloof playboy type while being able to push his performance to the point of seeming psychotic. He wanted people to believe that this person could realistically end up dressing up in a bat costume and dedicating their life to being that kind of over-the-top vigilante. Keaton was and is very good at pushing his performance from normal guy to crazy in a believable way. A lot of his early films are about characters who have some kind of mental issue and/or addiction.\n\nBale was less about the crazy side of things and more about becoming obsessed with making himself as physically conditioned and mentally strong as possible in order to help fulfill his fathers wish of seeing Gotham made a better place. His is honestly the more believable but you gotta give Keaton his due. He made the suit look good despite not really fitting into it as much as they tried to lead people to believe.",
        "That's the average height of an American male, basically",
        "Jaw wise he's right there. His face is fine, it's the frame.",
        "He looked good in suit and he nailed the voice imo.",
        "Imo he looks more like Batman than Bale when he was younger\n\nhttps://www.google.com/search?client=firefox-b-1-m&biw=414&bih=770&tbm=isch&sa=1&q=cillian+Murphy+young&oq=cillian+Murphy+young&aqs=mobile-gws-lite..0l5#imgrc=MVnQT8q5IkEI7M\n\nEdit: he's also more intense than Bale. He's very menacing in Peaky Blinders especially in his violent and silent moments. He also wouldn't need to do that raspy voice Bale did cause of his deep voice",
        "tommy shelby is basically bruce wayne if bruce wayne was a terrible person",
        "Excellent batman not Bruce Wayne, beside the voice, bale really nailed that as a playboy Bruce Wayne and being able to transform between Batman and Bruce is pretty incredible.\n\nI do see a darker version of Batman, then he would be better than bale.\n\nEdit: American Psycho was a big factor for bale to win the Batman role as well if I remember correctly.",
        "*frantic elevator button-pressing ensues.*",
        "\"Wanna know how I got these roles\"",
        "Death! ... By exile.",
        "I always found it amazing how much we're brought to care about his catharsis in Inception despite him being only in half of the movie",
        "When was he in the dark knight again?",
        "Should've been him. He was the best part of the movie but they wanted to come full circle with the story.",
        "[deleted]",
        "thats only good if its.. like your first take, imagine you doing 20 takes lol",
        "For titanic, the studio wanted to rebuild the ship instead of models because it would be cheaper until James Cameron was like “well how many times can I sink it?”\n\n“uhh… once”",
        "Not to be “that guy,” but I believe that’s why they made that joke\n\nAlso I remember watching that scene and thinking it looks awesome, SO real - turns out it was!",
        "Imagine if this was the movie that had audible dialogue.",
        "Guess I'll be that guy and state that's a myth. The cancer rates for that cast and crew were barely above average and a great deal of them smoked.\n\nhttps://www.gasdetection.com/interscan-in-the-news/magazine-articles/movie-conqueror-really-cursed-look-radiation-paranoia/",
        "I find it crazy that Harvey Dent’s face looks so good during the entire last hour of The Dark Knight, but Nolan chose to blow up an entire school in real life and have Heath Ledger stand in front of it.",
        "Chris Nolan has discussed numerous times that his films are augmented with CGI and green screen. He's never denied that. He's simply put an emphasis on the practicality of using real elements wherever possible because they photograph better and because 'it's fun.' Even the plane crash in Tenet was made with a real 747 because it was cheaper than spending months modelling the inside of the plane. The story hasn't wavered and all of the behind the scenes features are explicit in showing where CGI effects have been beneficial to the film and story - like having actors react to rendered space vistas through the shuttle port in Interstellar.",
        "My favorite game to play is guessing which comments are voted to the top before I open each thread. This place is really generic sometimes lol",
        "There comes a point, when someone has ventured beyond the posts and into the comment section and stayed around long enough to grow familiar, they just become aware of what the hive mind requires for sustenance.",
        "I actually think Interstellar is worse than Tenet for dialogue. That hospital scene is maddening. Hugely important plot point being dropped, and I refuse to believe anyone can understand what he’s saying without already knowing or having subtitles on.",
        "Did you see it in the cinema? I'm basically the same, I normally have subtitles on but Tenet I could hear everything I was supposed to hear. Found Interstellar much harder tbh. Anyway I only got to see it at home and wondered if there was a difference between those who watched it in cinema and just on their TV.",
        "Idk man Tenet fucked me up in theaters. I literally had my fingers in my ears for a few moments.\n\nI thought my theater had royally fucked it up but then I read online that pretty much everyone's theater experience was shit.",
        "People also seem to miss that the dialogue gets muffled as the protagonist gets more out of sync with time. You're not supposed to be able to understand what is being said because *he* can't. \n\nIts brilliant storytelling, but it sails right over the head of much of the audience, it seems. People don't mind shadows hiding what the protagonist can't see, but auditory shadows hiding what they can't hear? Get out the pitchforks!",
        "I dunno.  I've watched Tenet a dozen times, and I enjoy it - but I'm on the fence about the audio mix.  I feel like if the muffled noise was intentional, it'd *feel* more intentional, instead of coming off as a mistake.  It's like there's something there I'm *supposed* to be hearing, but I just can't.  If there was a very clear audio cue that meant I'm not SUPPOSED to understand it (like the talking in reverse scenes), I'd be able to grasp it a little better I think.  \n  \nAgain, I enjoyed it despite any of that - but I'm not sure that defense holds water for me.  But like you said, Nolan's a pro - so he wouldn't fuck it up like that, and while I imagine the muffled audio might have been his intention, it's falling flat for me.",
        "You cannot truly enjoy Tenet without at least a 200 IQ.",
        "That's a long apology for a movie with shitty sound design lol",
        "The average /r/movies post:\n\n-\tAvatar is ass cause blue space plot boring \n-\tHere is why this flop of a movie by Nolan is great! You actually *aren’t meant* to hear or understand anything! It’s *genius*!",
        "that is such a sad movie; i think his magnum opus but with a butt infection.",
        "I love Interstellar, so believe me when I say that this is out of love, but that was a cheap cry. Like of course I teared up at that scene, but given the subject matter I think you'd have to be the worst director of all time to not elicit a tear there. \n\nOne of the major themes of the movie was the timelessness of love, and I don't think that was ever really felt. Bear in mind I'm comparing him to the upper echelon of directors here when I say this (Nolan is maybe my favorite modern director), but he deserves this level of comparison because this is the pantheon he sits in. His movies have emotional moments, but his characters are always action/purpose-driven, which is where you lose the human element. \n\nBest example is the scene where McCaunahoosee finds a way to communicate with Murph through his love for her. In the hands of a different director, that is absolutely, unequivocally, the single most emotional and beautiful scene in that movie bar none. A man traverses through a place with no time, sense, or direction, guided by nothing but the bond he has with his daughter? I don't know what the peak of that scene looks like, but I should be sobbing there. In Nolan's hands it's instead a visual spectacle, which I appreciate and enjoy, but it's just a difference in priority for him. \n\nIt's a difference in taste. I don't think there's anything wrong with what Nolan did. But, like, if you gave Spielberg just that one scene and told him to just do his thing, you'd get a much different interpretation that I think I personally would have preferred.",
        "Your spelling is funny",
        "I ~~balled~~ bawled my fucking eyes out at Interstellar. When we left the cinema every time I went to speak I started crying, never had an experience like it. \n\nLasted for about 45mins after credits rolled.",
        "It’s a great movie, one of my favorites but the ending with Murph fell flat on its face as character interactions go. Cooper might as well not have a son, also. \n\n In my opinion of course.",
        "I tear up about the robots.\n\nTars was a real trooper.",
        "Film actors guild's minimum salary of 60k",
        "He did it for the ludes.",
        "Consider it an investment",
        "> the characters in Dunkirk\n\nTo be fair, I don't think individual characters were really meant to be the focus. The focus was the effort involved by the RAF, the soldiers, and the civilian boats. The film was more about collective heroism vs individual heroism.",
        "Prestige and Interstellar were written with his brother. The latter films were all Christopher. I think his brother holds a lot of credit for giving Nolan's films some humanity.",
        "This is why Inception is my favorite movie of his, it feels like the best of both worlds. Most characters were written well imo, Cobb especially. I at least cared about them. Plus he added some of his best crazy time shenanigans with a great dose of tension.",
        "Dude just likes to purposely fuck up the sound mixing and declaring it as artistic style. That's about his only flaw as a filmmaker. It took me completely out of Tenet.",
        "It'S NoT MiXeD WrOnG, YoUr CeNTer ChanNel is NoT SeTuP RiGHt",
        "I've heard people defending Tenet like \"that's the way it's supposed to sound, like they're in a busy area with white noise all around.\"\n\nExcept they have nothing to say about the Amalfi boat racing scene where all the characters have headsets on and you still can't hear shit.",
        "Just give me more Cillian Murphy",
        "I'm stuff",
        "Oldman is cast as Truman",
        "Interesting thing, Strauss essentially broke Oppenheimer, but also broke himself in doing so.  When the proceedings from the security clearance hearings became publicly known, along with his butting heads with the Senate, he was shot down for Secretary of Commerce - virtually unheard of at that time - and was embittered at essentially the end of his career.",
        "I thought it was a really excellent decision to actually kill Christian Bale's real parents during the production of Batman Begins. You just can accept no substitute when it comes to portraying real grief.",
        "Interestingly, they managed to turn a profit on the corn \n\nhttps://www.hollywood.com/general/christopher-nolan-made-a-profit-with-interstellar-corn-crop-58105482-59863676",
        "References are *tight*",
        "Oh really?!",
        "Right? It's not a test, it's a nuclear historical reenactment for a film. Totally different.",
        "That is a fun fact! I didn't know that, how interesting!",
        "But that’s the point, he’s legit detonating a massive amount of explosives for this movie. Absolutely bananas and I wish I lived near an IMAX theater to see it.",
        "The thing I'm curious of is to what extent they'll layer some CGI over it to give the explosion atomic properties like that purple neutron glow testimonied by many from the testing era",
        "Seriously, afterwards it had me thinking about life and humanity for the next week in a really emotional way. \n\nSomething about this movie and themes really resonated with me; how the different astronauts dealt/coped with death and their mission",
        "Except for the third act, its almost a 10/10 sci-fi film.",
        "Five crew members.",
        "Sunshine",
        "*Adagio in D Minor intensifies*",
        "Reminds me of Sunshine, another awesome Cillian Murphy flick.",
        "They (whoever \"they\" are in this context) desperately need to bring back good movie posters that evoke emotion and purpose. Relate it back to the fucking movie at the least. Not just showcase a bunch of floaty heads",
        "Nolan probably glares at the poster editing guy like \"if you even attempt to make a floating head poster I'm gonna rip your own head off and glue it right on top the poster\"",
        "It is rarely the whole cast posing, and usually badly photoshopped heads pasted onto their bodies from other photos. \n\nIt's the bad photoshop reddit complains about, and for good reason.",
        "UP AND AT THEM!",
        "I sleep in a big bed next to my wife",
        "Yes",
        "TFW you don't have that issue as a German. The voices will be dubbed over anyway lol",
        "I've heard that nuclear explosions are 5 times brighter that the sun many kilometers away from the explosion (at a distance where you'd have actual people in a test).\n\nIt's terrifying.",
        "Unless automotive glass 80 years ago was quite different than automotive glass today a truck windshield would still let a lot of UV-A through.  Surely more than enough for a nuclear explosion to completely obliterated your vision.  Feynman was a supergenius so either automotive glass _was_ different then or even supergeniuses can be dummies.",
        "It should be in there! Feynman not having a place of some prominence in the story would be a loss in my opinion he has such a big personality. Probably deserves his own film...",
        "https://variety.com/2022/film/news/christopher-nolan-oppenheimer-atomic-bomb-explosion-no-vfx-1235457979/\n\nThat’s be fair it sounds like it may not have been an actual nuke but it’s a real explosion.",
        "No, they didn't use an actual nuke, but they did detonate a massive bomb to simulate the Trinity test.",
        "[deleted]",
        "https://www.theguardian.com/film/2022/dec/13/christopher-nolan-recreated-nuclear-explosion-without-cgi-for-new-film-oppenheimer This says they replicated it without CGI, but it is likely touched up with VFX, like most shots in blockbuster movies.",
        "Seeing that in IMAX the first gunshot in the opera made it feel like I got shot.",
        "Inverted",
        "Piracy 👍 (wouldn’t suggest it for this movie though, as it will most likely be very visually impressive).",
        "Now a baker’s dozen",
        "he just got the shell from them for “filming purposes” and bought the uranium from a supply officer in siberia.",
        "Tenet felt like Nolan was parodying himself.",
        "Yea, I probably should have made it clear I was being sarcastic.",
        "sshhhh!... Nolan might read you and take it as a challenge",
        "There is a few scenes where its intentional but for a lot of it the complaints are from Nolan mixing for 50,000 dollar audio set ups and not what people actually use.",
        "> I'm a real human being\n\nExactly what a bot would say hmmmmm",
        "I remember going to see Batman. Going to a movie cost a nickel and in those days nickels had pictures of bumble bees on them!\n\n\n\"Gimme 5 bees for a quarter\" you'd say.\n\nThe important thing was I had an onion on my belt, which was the style at the time.",
        "Hi grandpa. :-\"D good to see you here.",
        "Modern birds are more closely related to a T-Rex than a T-Rex was to a Stegosaurus.",
        "Tell that to my back.",
        "Batman Begins applying to college",
        "I hate time.",
        "😳",
        "Then look at Bale in the Machinist or Thor and ask why Cillian couldn't have bulked up?\n\nHe may have been offered and said no, I don't know. Would have meant that fighting Bane neither of them would have to be in platform heels",
        "Shortest man on Tinder apparently",
        "Looks like a stuck-up billionaire trust fund heir that does nothing but sleep all day long. A+ Bruce right there.",
        "B..But I don’t want to be able to understand my Batman!",
        "I remember everyone just assuming he was going to be Batman after American Psycho came out. It was a no brainer.",
        "The beginning in the parking garage primarily, and then he is trickled into the rest of the film when needed",
        "***ties Tyson to a real nuke:*** Ok, let's begin the test.",
        "“Actually the atomic bomb tests occurred in the 1940s, not the 2020s.”",
        "Whines that the sand isn't shifting the right way during the explosion.",
        "It’s crazy how Nolan can consistently come in under budget on his projects by using practical effects. The cost of CGI is just mind-boggling to me.",
        "James Cameron said the exact same thing when he considered building the Titanic for $10m, which was within budget but decided not to because he can only do one take.",
        "I guess it helps when the stunt is pretty straightforward. Plane goes forwards, crashes into building, cue explosion. Set up enough cameras at enough angles to give room for editing.\n\nI imagine the time and financial cost would massively increase if it was any more complicated than that. He'll, if the plane even had to *turn* that would probably make it a lot more complicated.",
        "sounds like he just loves a good explosion",
        "It keeps the old stunt fx guys getting paid.\n\nWithout nolan, these guys would be sucking dick for bus fare, then walking home",
        "It was a planned demolition anyway",
        "[deleted]",
        "It's okay Michael Caine was just reciting the poem for the 10th time.",
        "Very true.. \nlike I mentioned, it’s very much an indie movie with a blockbuster budget. \n\nIf it was made by a relatively unknown director, with a smaller budget, the critics would have reacted very differently. \n\nI’m not saying the movie is super high-brow intellectual stuff.. it’s just a *different* kind of fun. And it’s okay if you don’t enjoy it.",
        "[deleted]",
        "I genuinely don’t understand this opinion. \n\nThe movie is fairly complex, there’s a lot of information to gather just to understand what the hell is even happening.\nMost of the critical information you need is delivered in dialogue, dialogue that is *really* hard to understand when sounds are all blending together. \n\nIf the dialogue is supposed to be difficult to hear, are you just supposed to go into the movie already knowing all the entropy mechanics of this world ahead of time?",
        "It’s like reading the Rick and Morty copy pasta lol.",
        "You people are so absurd it's hard to believe you're real.",
        "That's bullshit. Sure there are sometimes when the protag is out of sync with time but even when sator finally tells why he is doing what he is doing, it is entirely inaudible. When I watched it in theaters I never got to know Sators motivations by the time the movie ended.",
        "On the boat is one of the times he clearly understands what's being said while the audience doesn't. That disconnect during the \"why?\" dialogue is what's infuriating. You don't get to find out why they're doing this. Other scenes, it makes sense because the characters focus on stuff other than the dialogue on their own, like when they're casing the airport.",
        "A what?",
        "There was a butt infection? I think I watched a different film...",
        "His Magnum Anus",
        "You really shouldn't trust Siri to not change Inception to butt infection when using voice to text.",
        "With a what now",
        "Agree to disagree I guess. I'm one of the few who found the end scene to be both awe inspiring and sad. He was so panicked and regretful before figuring out what to do. It was like he thought the universe was showing him his mistakes. Then when he figured it out, he went into logic mode, which made sense to me. I did tear up when he was believing he could do nothing but watch his daughter be disappointed in him for eternity in this weird time box.\n\nI disagree about Spielberg, too. I think you're overestimating his characters. They're good, but they're at most the same as Nolan's. For every Schindler's list, there's like 3 weird movies that don't quite land. The only movie comparable to Interstellar is really Saving Private Ryan (action drama) and tbh, I think they're equally as good. I'd even give some more weight to Interstellar on characterization. SPR had more intense war loss moments though and handled PTSD superbly. Comparing masterpieces is hard, but I don't think the difference is significant enough to make a strong case either way.\n\nSpielberg has like 100 movies, most of which aren't good. Nolan has like 15 and they're all bangers.",
        "Deep time experienced at a personal level has that effect. Interstellar just scrapes the surface",
        "Dubious abbreviation for that guild, shouldve been called a collective or something",
        "F.A.G\n\nI think it should be the screen actors guild lol",
        "The *Screen* Actors Guild has minimum daily and weekly rates. I have no idea where you're getting this number from, unless it's a joke from *Team America* I don't remember.",
        "That's the point I was trying to make (although I admittedly worded it really shit). I don't think Nolan tries to write interesting characters and fails, I think sometimes, especially his last two movies, he doesn't make the characters themselves the focus. \n\nI don't mean that as a bad thing at all, I think in both examples it works really well and was definitely the right move, all I was trying to say was that Nolans done it intentionally, not out of being incompetent when it comes to writing characters.",
        "His brother (Jonathan Nolan) also wrote Westworld and is the lead behind the upcoming Fallout series on Amazon Prime.",
        "True, I really hope they work together again in the future",
        "I didn't know that and it makes so much sense now.",
        "Memento was also adapted from Jonathan Nolan's novella. And they have a bigger brother who was a contract killer.",
        "Have you seen Breakfast on Pluto?",
        "Newman....",
        "There's something g funny about playing Truman just a few years after winning every award known to man for playing Churchill",
        "Awfully bold decision when he gave Guy Pearce brain damage for Memento.",
        "When it comes to Nolan, _all_ actors do method acting whether they like it or not",
        "And he had Heath Ledger legitimately go insane, truly brilliant filmmaking.",
        "Wow wow wowowow wow.  Wow.",
        "I get that reference",
        "Hey I’m gonna need you to get off my back on this one.",
        "There's nothing in the rules that says a dog can't perform nuclear testing.",
        "didn't he drop an actual plane as well",
        "[deleted]",
        "It's one of my favorite examples of filmmakers disagreeing about what a movie is about, and for the better.\n\nDirector Danny Boyle was raised Catholic, and sees the movie as a metaphor for an encounter with God. Writer Alex Garland, who is atheist, sees the movie as being about religious mania, and *thinking* you're encountering God, when you're not. \n\nI think their contradictory viewpoints enrich the movie, making it more complex and thought provoking.\n\nAnother example is *The Exorcist*. Director William Friedkin is an atheist, and directed the movie as a documentary. William Peter Blatty wrote the novel and the screenplay, was educated by priests and did very serious research on how real exorcisms are performed. \n\nSame goes for the cast. Except for the two lead priests, most of the priest characters are played by actual priests, some friends of Blatty. But Max Von Sydow, a staunch atheist, said playing the old priest was no different than playing a fairy in a Shakespeare play.",
        "Thanks!",
        "It’s still insane that humanity built such a weapon of destruction after starting with only rocks and sticks. It’s both miraculous and horrible.",
        "> it may not have been an actual nuke\n\nBut with Nolan we can never be 100% sure it wasnt",
        "obviously he didn't detonate an actual nuclear weapon",
        "Yeah a mushroom cloud can be created by other things. Curious how they will accomplish it!",
        "He wanted to recreate the feeling the audience had during The Dark Knight Rises.",
        "Hahaha! It would be funny to think there is a heist movie as the behind the scenes of filming this movie.",
        "Beep boop bip bip",
        "Goin’ on down to the nickelodeon to watch the moving pictures; a few swigs of paint thinner and you can practically feel like Norma Desmond is speaking directly at you.",
        "Now it was a red onion,  we didn't have yellow onions on account of the war.",
        "In nineteen dickety two! Since the kaiser had stolen our word for twenty.",
        "We can't bust heads like we used to... but one trick is to tell them stories that don't go anywhere",
        "Lmfaooo I was like “where is he going with this?” Then I thought this sounds like something an old man would rant about. Then Grampa Simpson’s voice entered my head haha",
        "The T-Rex is closer to stuffed toys of stegosaurus than real stegosaurus",
        "The new \"talk to the hand\"",
        "Ha! You can't! Because I am laying on it right now trying to get these muscle spams to subside.",
        "Bend at the knees, keep the load close and don't twist. If possible, be short. That's what I do and my back is fine. The short part. The rest I just do fucked up.",
        "What?? I didn't hear you.",
        "The Dark Night Classes",
        "Make it stop.",
        "Bale is a famous outlier in how far he stretches his body for roles. Almost no one else would agree to that stuff.",
        "What Bale did is not typical, or healthy, or even physically possible for most people.",
        "Bale is also 6’0, whereas Murphy is 5’9",
        "And then in tdkr : “so death then ? By way of exile !”",
        "He’s not in TDK after the parking garage scene.",
        "In my head that was Tyson calmly saying that like this was one of his TV science specials and that made me laugh",
        "Tyson: Do you expect me to rate your effects positively?\n\nNolan: No, Mr Tyson, I expect you to die.",
        "The cost of *good* CGI.",
        "The cost is insane, the VFX studio pockets all the money, and the VFX artist are paid in peanuts.",
        "It doesn't always pay off though. Dunkirk having like 50 soldiers on an otherwise empty beach in front of a perfectly intact contemporary looking city, and only 3 spitfires in the sky, was a very strange take on WWII.\n\nThe sequence with the sinking ship was amazing though.",
        "They had a big pool-stage to dunk it in though, they could have raised it for each take, and then made residuals off using it as a cruise liner for tourists…",
        "Micheal Bay to Christopher Nolan: \"we're not so different, you and I.\"",
        "Lol…\n\n….\n\nI don’t like you",
        ">looks like a cartoon\n\nit looks like a cutscene in a video game I don't get to play, and will definitely age poorly",
        "Well they're movies of comic books, so... apples and oranges.",
        "I really like Interstellar but *damn*, that poem got old real fast. It seemed like half of Michael Caine's dialogue in the whole movie.",
        "Definitely a fair criticism for the movie. I think he wanted to challenge the audience by changing the mode of how people interact with a movie.. through their characters. He wanted people to set the people and the human components aside to show something different, but the execution could have been better. Nevertheless, I think it’s necessary to reinvent yourself as a director or it gets stale.",
        "Seriously can we elaborate on the butt infection please?",
        "Magnus opus",
        "Only in the extended edition.",
        "Your opinion is certainly the more popular one. I loved the movie, start to finish, and watched it again recently - probably second or third time since release. Memorable, moving and beautiful scenes. I've only seen these weird Chris Nolan opinions and Interstellar opinions on reddit. People I deal with on a daily basis, peers and sometimes even professors, love Nolan and his body of work. To me, personally, James Cameron and Christopher Nolan are easily the greatest directors ever - plus Kurosawa. 100% agree with your last statement as well - can't remember the last time I was excited about a Spielberg film. That being said... I think a ton of credit goes to Nolan's brother too.",
        "That is why they're called the Screen Actors Guild. Film Actors Guild is from Team America World Police.",
        "Movie Actors Guild of America?",
        "Film actor's guild of talents",
        "That is what it’s called. SAG is the actual union.",
        "Fallout series on prime? That sounds amazing.",
        "Is that at the restaurant at the edge of the solar system?",
        "And made Bale cut off his own fingers. And made Jackman drown himself over and over.",
        "Whoopsie!",
        "I’m gonna need you to get off my back with these references!",
        "Because it would have been cheaper than cgi lol.",
        "Yeah, for Tenet they found out that it was cheaper to ram an engineless 747 into a quonset than to pay VFX people for the whole sequence lmao",
        "*Crashing this plane*",
        "Alex Garland and the \"hollow human\" antagonist motif is a fucking vibe",
        "Yeah it's actually not as bad as I remember, quite jarring on the first watch and I do believe was ultimately the wrong narrative decision but certainly doesn't ruin it. I wonder if there is a fan edit in there which takes that out but still allows the film to make sense",
        "100% that movie is brilliant and profound but yea I get the criticism of the final act",
        "There's a way you can read it where the structure of the film becomes more unhinged as they get closer to the sun, exactly like Kappa's description early on of the relativistic effects the bomb will experience as it accelerates. That the smeary light effects on Pinbacker, his inexplicable strength/endurance, etc, are all manifestations of that breaking-down of sanity, reality, and everything else as the journey reaches its most harrowing point.\n\nIt's probably not the intent, sure, but I think it's a fun lens to watch it through. It makes the tonal shift less strange, and more something that was secretly inevitable all along.\n\nI'm also totally just defending it because I goddamn love Sunshine so much, haha. It's an all-time favorite. I totally see why people find the end to be out of place, but I don't think it's quite as much of a veer as others do.",
        "One of the better sci-fis, do yourself a favor and watch it.",
        "He actually convinced the United States Government to reneg on the 1963 Test Ban Treaty for a single 40 kiloton nuclear explosion.",
        "I imagine they just detonated enough tnt to mirror a nuclear explosion.",
        "He slipped up! We got him!",
        "I’ll be deep in the cold, cold ground before I recognize Missourah!!!",
        "Dickety! Highly dubious",
        "This is one that always fucks me up",
        "Oh no he didn’t…",
        "When did ~~Mötley Crüe~~ SOAD become classic rock?",
        "Not only that, but what Bale has done to his body for roles is extremely dangerous and could very well cause him complications later in life.",
        "He's also a fair bit taller than Cillian",
        "3 inches is a lot when it comes to muscle mass, its crazy.",
        "Was he meant to be scarecrow in that movie or did they give him another role, any time I watched it I was never sure",
        "And he wasn’t wearing hockey pads!",
        "in my version he walks out of the explosion, and says \"it's close.\"",
        "pfft.  excuse me, don't you know anything about accounting?\n\nmovies don't make any money at all and animation studios are free 💸",
        "I don't know if that was intended or even considered during the film's production, but to me it made the film feel almost symbolic. Something like a play on a (very realistic looking) stage. A much greater story told through a very small cast",
        "Except The Titanic didn't just sink. It broke in half. So they would have to design it in a way to break in half, and to also come back together in such a way that isn't obvious in following takes. I don't think that would be within that 10 million budget.",
        "To them, you’re just a freak. Like me",
        "\"In 100 years people will still be talking about Harper Lee, meanwhile Captain Underpants only dreams of winning the Pulitzer\"",
        "I'm assuming it's similar to Richard Gere and the guinea pig he kept around",
        "Oops, I dropped my magnum opus, that I use for my monster black hole.",
        "Magnus anus",
        "Prolapsed edition.",
        "*MYATT DAMON*",
        ">\tOne day you’ll all look at the world us actors created and say, “wow, good going FAG. You really made the world a better place, didn’t ya, FAG?”",
        "I'll always call it the film actors Guild.",
        "Admittedly SAG is a pretty bad acronym too, not slur bad of course, but who wants to associate themselves with the word \"sag?\"",
        "Or that time when he declared WW2 all over again, and specifically filmed the battle of Dunkirk",
        "It's just standard Danny Boyle though.\n\nHis movies tend to get weird in act 3.\n\nThe Beach, 127 hours.\n\nSlumdog Millionaire was absent of a super weird third act, and lo and behold, Academy Awards abound!\n\nSunshine was my favorite movie for a long time. I love that the characters don't make dumb decisions. The dialogue and logical progression of the plot is very intelligently motivated.",
        "Di'int*",
        "And when did Rocky, become an Actor?!",
        "The day the classic rock station here in Salt Lake City played fucking \"Kryptonite\" by 3 Doors Down was the day I realized I was old.",
        "I cant imagine the level of weight loss he underwent for Dallas Buyers Club did anything but damage his body. I respect his commitment and his skill as an actor, but woof.",
        "He went from the machinist to batman begins in under a year. From one extreme to the other. Kinda looked bloated in batman. Those organs are working overtime. Given, mine are too, but it's just cause I like to party while I watch movies.",
        "Yep, still Dr. Crane",
        "Gordon addresses him as Crane, IIRC.",
        "Not my diagnosis!",
        ">MYATT DAMON\n\nI *love* Matt Damon but that  line... 😅😅😅😅",
        "It was crazy when he invented a machine that could reverse time. And he only ever used it for his movie",
        "Kryptonite was classic rock the day it was released!",
        "Wrong movie. The Machinist.\n\nOr wrong actor. McConaughey. Pick one :)",
        "His suit is also very lightly scarecrow themed.",
        "“Crane! If you think we’re going out onto that ice willingly, you’ve got another think coming!”",
        "They didn't even plan to make his character like that, but apparently when they got his puppet the reaction was, \"This thing *looks* retarded,\" followed by, \"Let's actually make it retarded.\"",
        "It looks smart enough that I'd buy crypto if it told me to."
    ],
    "Oppenheimer (2023) and Barbie (2023) open the same day. One is about the invention of the atomic bomb. The other is about a plastic doll. Guess which one stoked the most political outrage. Go on, take a wild fuckin' guess": [
        "Margot Robbie vs mass destruction weapons.",
        "Atomic bomb and blonde bombshell. I am become Doll, destroyer of young girls self image.",
        "People have waaaaaay too much time on their hands",
        "“I am become Barbie, destroyer of Ben Shapiro”",
        "Osama Bin Laden and Bratz movies next year please.",
        "Oppenheimer will stoke even more outrage once the muppets realize it doesn't actually glorify American militarism and nuclear weapons.",
        "Guess which one has full frontal nudity.",
        "Conservatives when a filmmaker that frequently discusses feminism in her films discusses feminism in her films: 🤯🤯",
        "Ah yes, one of the most politcal controversy: plastic",
        "Weirdly both of them.",
        "Shouldn't have touched east Vietnam/ west Philippines sea.",
        "Can we stop pretending that this is \"political outrage\"? The right wing grifters probably made their review videos after the first trailer dropped.",
        "I think Greta Gerwig, Noah Baumbach and Margot Robbie would all disagree that it's really about a plastic doll. Haven't seen the film but from what I've heard it does make some social statements about feminism and the patriarchy. Not defending the outrage merchants but it's disingenuous to pretend it's really a film about a doll.",
        "what outrage? I only ever see posts on this subreddit complaining about anti-barbie people but I never see anti-barbie posts",
        "Saying Barbie is about a plastic doll is like saying Schindler's list is about a factory.\n\nTotally disingenuous.",
        "To be fair Barbie is way more political than what you'd expect from a movie \"about a plastic doll\"",
        "Honestly great symbol of the culture war. Many would rather rath and seeth over miniscule bullshit about some cultural norms them debate the ethnical values of creating a fucking nuclear bomb",
        "Isn’t Oppenheimer banned in japan",
        "Option 3: Stay at home and watch \"They cloned Tyrone\" on Netflix. 10/10 movie",
        "We need to ignore Twitter as a whole",
        "To be fair, plastic is going to have the higher death toll.",
        "“I have become death, destroyer of girls”",
        "The fact Ben Shapiro went to see Barbie and then made a **40+ minute** video about it is iconic.",
        "barbie is a film about a homeless man named Ken who lives in a female-dominated parallel world where men have no rights. When he follows his toxic girlfriend into the real world, he learns that men can become anything if they have a degree. So he goes back to the parallel world to free all men and change the constitution. But the women incite the men against each other and the revolution is crushed.",
        "Virtually no outrage about either one.",
        "Just wait until the woke mob finds out about Pikmin 4",
        "Conservatives have no right to **ever** use the word snowflake ever again outside of literal context.",
        "By “political rage“ do you mean a silly post on Twitter? The definition of “rage” is stupid nowadays.",
        "As much as I love the Science and History in Oppenheimer. The movie was just STUNNING to watch in IMAX. Brilliant direction, acting, and sound design is just great.   \nI think this movie deserves every single praise it gets and way more.\n\nI hope Hollywood will take at least something out of that movie. Once in a decade movie IMO. Absolute must-watch, on IMAX, if at all possible.",
        "I can't wait until this forced meme is over.",
        "Oh watching so called alpha men whine and cry about a Barbie movie is VERY telling and entertaining.",
        "I am become reddit, destroyer of strawmen",
        "Barbie is not, in fact, about a plastic doll. That dishonesty is precisely why it has garnered so much backlash and pretending otherwise is in service of said dishonesty.",
        "Barbie is more than being about a plastic doll, that is a gross misrepresentation of a movie that has social critique in it",
        "No, see, bombing Japan good and national pride. Women bad.",
        "This thread is a great snapshot of Reddit brain.",
        "I love how the \"alpha males\" are the ones who are like super concerned about the integrity of the original Barbie story lmao you can't make this shit up",
        "Isn't that because the toy movie had more of a current modern political commentary than the biopic of the inventor of the atom bomb? One is history, the other is for current times, which people are kinda tired of. Not hard to see why.",
        "Yes b-but women!!",
        "Haven't seen any outrage about either. Hang on let me go to reddit so people who love being outraged can tell me how to feel outraged.",
        "I love how Ben Shapiro paid to go and see this film and ended up crying about it for 43 minutes on his channel because of how \"woke\" it is.",
        "And Barbie made more money opening weekend. All the rightwingers went to see Barbie so they could complain about it lol.",
        "To be fair, Plastic HAS caused more damage than weapons of mass destruction",
        "[removed]",
        "It's a little late to be outraged at the invention of the atomic bomb",
        "i knew barbie was gonna be political but man they *went* there, and im glad they did",
        "The Barbie movie is so feminist it doesn't even pass the Bechdel test",
        "Is this an ad?",
        "For me the Gen Z spiel about Barbie being a fascist was soo stupid",
        "VIETNAM INDIRECTLY MENTIONED 🇻🇳🇻🇳🇻🇳🇻🇳🇻🇳🇻🇳🇻🇳🇻🇳💪💪💪💪💪💪💪",
        "0",
        "To be fair Barbie is about much more than a plastic doll.\n\nIt's got a lot of important social messaging.",
        "Where's the shitty detail?\n\nOh right, there isn't one because everything has to be a fucking /pol/ baitpost. Go back to shitting up 4chan OP.",
        "Tbf one is historically accurate and the other has easy talking points to make snowflakes cry because they are really the snowflakes who can’t handle anything that isn’t 1950s America",
        "I don't really care and my life is much better for it.",
        "republicans are the most pathetic party on the face of this earth",
        "One is morbid and the other is life affirming . Cheerful. It’s a no brainer …",
        "C. Sound of Freedom",
        "[removed]",
        "[removed]",
        "It was the one where the thing did the things",
        "Will either movie reduce or increase support for Ukraine is my only question. If increases - good, if deceases - bad. I especially hope Barbie had smth to say on this.",
        "The wildest shit? It doesn't release here in Korea until the 15th, like I understand the history of South Korea but damn son.",
        "I've seen equal amounts of whining in Reddit and Twitter.",
        "I’m guessing it’s the fun Barbie movie?",
        "Why can't we just watch movies & enjoy them? 🙄",
        "“Klaus” Barbie..",
        "I wonder if Ken and Barbie grow genitals in the real world...",
        "from a dude who kinda hates the world here and had traditional biases\nOppenheimer was a great exploration about the man himself. to me, he loved what he did, reminded me of Albert Camus, because his behavior was foreign to all of us, yet his genius made him stand out. he was also a womanizer, to top it all off. not a nihilist, but a person who is just misunderstood in all his actions. i loved it for that reason. it also shows that the people around him had conflicting ideas about his character once it was revealed that he wasn’t just sympathetic to communists, but to everyone, something the usa didn’t take lightly lol. \nbarbie, uhhh, was kinda too political for me. like? yes, oppenheimer is political. im a staunch supporter of the moral compass. but its left vs right here. whatever happened to the moral compass? imo the patriarchy doesn’t exist (sorry if i offended some of you), so that whole patriarchy argument went out the window for me lol. i think its the government who is really controlling us. so far, not just men are in the government ladies ! that whole politically correct thing, about separating ken from barbie, when in reality, we should learn to harmonize and merge as a society, regardless of race, orientation, body and identity. having discussions about our biases whilst addressing major issues that we are grappling with as a society deals more than separation and dare i say segregation. i might sound a bit insane atp, so ill leave it there lol.",
        "Oppenheimer is being boycotted in India because of the bhagwat gita scene during a sex scene",
        "Fuck off with your astroturfing marketing campaign.",
        "Why would oppenheimer cause political outrage in the west?",
        "Guess which movie made the most money this week..",
        "Barbie of course, and I haven't even seen either movie and have read no stories about them.  \n\nFirst of all, what could a movie about history do to stoke political outrage?  Here's stuff that happened, ok.\n\nAs far as barbie, she has been a culture war lightning rod for decades and I'm sure SOMEONE would have necessarily been outraged by this movie however they did it.",
        "What are they crying about now",
        "Neither?",
        "Of course one of the most comical (read stupid) things in this whole \"conservative freak-out of the week\" is that gay groups have watched the movie and criticized it (not heavily, they still liked it) for how it pushes the hetero normative narrative.  Conservatives have literally made up a strawman version of this movie to get angry at.",
        "Atomic blonde",
        "Neither?",
        "[removed]",
        "Who would want to see either one? I for one will miss out on both",
        "True story:\n\nJulius Robert Oppenheimer and Barbie (Doll) happened to meet at a party. Both of them were already famous at this point.\n\nBarbie says, \"What if we married? Imagine our children, Professor, with my looks and your brains!\"\n\nTo which Opie replies, \"But Miss, what if the child were to have my looks and your brains?\"",
        "you don't even know what is barbie about do you?\nDo you even what barbie really is?",
        "One is about the invention of a device that saved human civilization. The other is just rubbish.",
        "Barbie, for the 9 lignes",
        "Welcome to brain bleached westerners.",
        "Started falling asleep half way through Oppenheimer.  Guess I mire into dolls than bombs sorry",
        "I'm still waiting to see what happens to Oppenheimer in Japan. I'm sure it'll be a blast... or two.",
        "My guess is neither, since I've seen 0 political outrage about either one.",
        "guess who's product launched first in Japan.",
        "I’ve literally only heard about this “outrage” on Reddit and I probably get out more than most of you guys 🤷‍♂️",
        "I have no interest in Barbie. I only went to see Margot Robbie's feet.",
        "No surprise.  We have a dumbed down population that has strong opinions about pronouns but know nothing about history or foreign policy.  \n\nEasier to manage the masses if we keep them divided on simple to understand shallowness.",
        "CLOPenheimer is chad so theyre doing a stolen valor",
        "existentialism vs materialism",
        "Both to be honest?",
        "Crying baby vs hydrogen bomb",
        "Everyone was upset about the idea of a pretentious crybaby being made the hero of that story, while everywhere I saw people just thought the Barbie movie was a funny idea.",
        "Barbie is basically the Pretty in Pink version of The Lego Movie, this could’ve simply been a cheaply thrown together cash grab adaptation of an iconic toy brand but the director, writers and producers went the extra mile and gave us a solid story, compelling main characters all while keeping to the notion of the film being made just to sell more toys.",
        "U knpw if u just ignore the \"political outrage\" it goes away. Its just sensationalism designed for interaction bc interaction=money on social media",
        "Conservatives aren't upset about Oppenheimer because the lead character and his wife (lie) and say they hate communism.",
        "The one about plastic doll. Conservatives focus on pretty irrelevant things during times of war.",
        "All the right has is their precious culture war.",
        "Conservatives love playing victim",
        "It's almost doublethink. Here's what humans achieved - potential to completely annihilate ourselves. Here's what humans achieved - pink plastic body image issues.",
        "Whoa, you are telling me that right wing fuckheads got upset over something stupid? It must be a day that ends in 'y'",
        "All the nuclear dick missiles aimed at her feet",
        "Well, Hiroshima and Nagasaki compared to all the microplastic in the sea. \n\nOh wait... \n\n\nOppenheimer was potentially a commie, and wanted to open source technology with the allies? Wait till the GOP hear about this, they'll say that Nolan's movie is communist propaganda.",
        "Belts at elbow height vs.... well, also belts at elbow height apparently.",
        "Margot Robbie has two weapons of mass destruction",
        "She’s Bombshell",
        "Mass Destruction Weapons vs Oppenheimer",
        "Atomic Blonde lol",
        "Barbie was originally considered a very progressive toy that empowered girls, Barbie had a career and was an independent woman.",
        "They actually point this out in the movie. They did a good job of acknowledging Barbie's flaws and her original purpose.\n\nThey also mentioned how Ruth Handler evaded taxes and said, \"But that's for a different movie.\" lmao\n\nIt was really good. Ken stole the show though.",
        ">I am become Doll, destroyer of young girls self image\n\nThat probably doesn't sound as good as the original while you're >!banging your secret communist mistress!<",
        "I like that. Cue Murdoch press outrage.",
        "true if were where in a global war with aliens everyone would be distracted by the alienussy",
        "Conservatives are politically outraged by things like children’s toys, the Green M&M, saying slavery was bad…",
        "Yep. I actually haven’t heard anyone in real life complain about either of these movies. I’ve only heard people being excited to see both.",
        "Please be specific. It's right wingers. They are the ones perpetually upset at anything that doesn't fit into their little box of acceptability.",
        "This is just social media in general, including reddit. Today I saw a sub called “enough Elon spam” and guess what - its post after post after post about him lol",
        "Right? Use it for jerk off or something.",
        "I mean...",
        "There's a video where he apparently burns barbie dolls...to show how manly he is.\n\nI'm gonna assume, he went out and actively purchased barbie dolls, just to make that video.\n\nWhat a fuckin loser.",
        "Ben's a fan of Oppenheimer. The desert reminds him of his wife.",
        "I'm glad they didn't pull punches about how shitty Truman was. I mean, they didn't go into detail about how he WANTED to use the bomb, but enough was implied.",
        "They don’t have that level of media literacy",
        "Now I want to see Oppenheimer: Muppet Mayhem.",
        "I think this is exactly why Barbie is stoking so much. Have people talk about Barbie and ignore the actual criticism going on in Oppenheimer",
        "Theyre still playing born in the USA, theyre not gonna figure it out",
        "They don't have the mental capacity to understand that, even if God themselves tells them from the sky.",
        "good thing that's not the intended audience",
        "keep kermit out of this!",
        "Mate i already saw twitter comments like \"i wish oppenheimer was a bit cooler so it would get more kids into physics\"\n\nBrainrot",
        "God I would give real life folding money for a Muppets version of Oppenhiemer without jokes set in the same tone, or a muppets Saving private ryan, or a Muppets Shindlers list.",
        "Yeah, no, they never will. I guarantee it.",
        "Unrelated but now I want a *Muppets Oppenheimer* movie.",
        "And also considering the communist aspects of his life and shitty accusations made about/towards him, but wouldn't be surprised if modern conservatives celebrate McCarthyism and label McCarthy himself as being \"cancelled\" for being anti-woke",
        "Dropping the atomic bomb is the largest terrorist action in all of human kind",
        "The wrong one",
        "Oh god i wish i could have seen null gosling",
        "When the film that is about a feminist toy brand talks about feminism: 😡😡😡😡",
        "Feminism doesn't equal, hate all men and all women that don't despise men.",
        "It's fantastic",
        "And fictitious maps. We all know that when Tolkien didn't draw China or Vietnam into his maps it was a slight on their culture.",
        "I saw one of the alt right  rage-baiting news channel said Opperheimer is communist propaganda 💀",
        "Consider the atomic bomb and the Barbie Doll—\n\nTwo products of American ingenuity that massively changed their respective fields had had a huge cultural impact. \n\nThey both have a fascinating backstory and a single personality that drove invention development.",
        "Yeah, the 20 minute monologue from Barbie about the oppression of China was a bit out of place in the movie",
        "They didn’t! This is the map that got them banned https://media.cnn.com/api/v1/images/stellar/prod/230705074656-hollywood-minute-barbie-map-vietnam-china-tron-ares-gladiator-00001327.png?c=original\n\nThis is the actual 9 dash line \nhttps://s.yimg.com/ny/api/res/1.2/MGlQN0YU6T.JF1y9VYekpw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTY0MA--/https://s.yimg.com/os/creatr-uploaded-images/2023-07/27f67280-1c2e-11ee-b9ad-3421ae2b11ee\n\nHow anyone could think they’re the same map is crazy. Vietnam is ranked only one place higher than China on the Freedom index but somehow when they ban a movie Reddit thinks it must me completely justified",
        "They literally haven't, Vietnamese communist government is a bunch of dumbass and coward, they find a tiniest bit of similarity to ban the movie yet kiss Chinese's ass on everything else\n\nSource: i'm there",
        "Is it because of the Weird Barbie's map?",
        "...without actually bothering to watch the trailer.",
        "I'm a trucker, I work in a very right wing leaning world. I'm on construction sites almost daily all over the place.\n\nYou know how many conservatives I hear talk about all the culture war stuff on a daily basis? Fucken 0.\n\nAll this shit is manufactured internet outrage, nobody in the real world actually gives a shit about Barbie movies and whatever other thing Ben Shapiro is outraged about.",
        "It’s anti-political outrage. It’s faux anger weaponized to distract the masses from the fact that conservatives are garbage politicians who don’t know the first thing about actually helping people.",
        "Can we stop pretending that this is \"political outrage\"? This is a fucking advertising campaign.",
        "It's not really on reddit, it's moreso in conservative media like Fox News and such.",
        "Ben Shapiro launched a 43 minute rant about it on his channel, so there's definitely stuff out there.  Pretty sure a few Fox hosts took shots at it too. It just depends which parts of the internet you're on.",
        "I mostly see it on Twitter. If you avoid that site, you’ll almost never see it.",
        "This is like the 3rd time i see someone make fun of the outraged people but also, i have yet to see any.\n\nIf something is popular enough, you can probably find someone that hates it but i wouldn't call that outrage.",
        "It's not made it to reddit yet. It's still on the fox news/Kick/YouTube level. Ben Shapiro did a 45 minute hate screed on it yesterday.",
        "Um, I am seeing it everywhere. Just look at the Imbd ratings. Within 24 hours of the release, there were a ton of low ratings and reviews saying it's too woke or that it's feminist garbage. And all high ratings were getting votes of being 'unhelpful' everywhere. Not sure if the tide has changed now. Under Instagram posts hyping up the fun of watching both movies one after the other, there are tons of comments about how \"men\" and \"boys\" should only watch Oppenheimer, and all these dudes saying they/no one is gonna watch Barbie.",
        "There is a world outside the reddit",
        "Exactly. There are more people defending the movie than attaching it.",
        "True. But we all did quit Twitter and I ain’t checking that cesspool.",
        "Marketing campaign is trying to stir up controversy to get people to watch it lol.",
        "I'm sure some random tweeted something so reddit got outraged",
        "I guess we just have some decent algorythym",
        "You need to make strawmen to feel superior to everyone else.",
        "I’m ngl im part of the outrage. The ending of the movie was literally about how easy men are to manipulate. 💀",
        "Weird. Whenever I see a post about Barbie on other social media platforms people call that movie woke bullshit and start hate talking on feminism and lgbt. Even tho the movie have nothing to do with lgbt they think movie have gay scenes 🤔",
        "not a single right wing person on my facebook has said anything negative about Barbie. And it isn't like they aren't tuned in, I saw a post on here about that sundown town song and hit refresh on my facebook to find them all supporting the song and it's message.",
        "That cat is out of the bag.",
        "No, but universal never bothered to try and sell the distribution rights to any Japanese companies. So it won't be releasing there anyways.",
        "I watched it yesterday, and it's fucking awesome! \n\nBloody amazing acting and storyline. \n\nPS. Watch the movie without watching the trailer or reading anything about it.",
        "Isn’t that just Undercover Brother?",
        "As someone who was looking forward to this movie and Netflix said it was a “99% match” for (lol) I defiantly preferred Barbie but Barbie was defiantly a 10/10 for me. Tyrone was like a 7, feels like the new way to do Blackspliotation, pretend it’s not with a ham-fisted message but profit off the same energy and imagery. Wasn’t boring though at least. Sorry to Bother You had a more surprising twist haha.",
        "I try to ignore Reddit as well. \n\nBut of course only when it doesn't agree with my exact beliefs.",
        "Cute that you think he actually watched the movie. For the work he does it’s best to be as uninformed as possible.",
        "That's all okay because men are bad.",
        "Yes but then the women understand that the matriarchy is also fucked and create a new constitution where they have equal rights or, the rights women have in the real world",
        "It's on its way. Ben Shapiro did a 45 minute hate video where he literally burned Barbie Dolls. It takes a while to trickle down to reddit because the community curates most of that shit out.",
        "You havnt seen YouTube lately",
        "if you close your eyes and plug your ears, then yea",
        "\"OH you're mad that I called you a ****** ***** well grt over it SNOWFLAKE the world doesn't care about your feelings\"\n\nThose same conservatives\n\n\"Noooooo you can't have a black little mermaid in a movie I'm never going to see it hurts my feelings as a white man\"",
        "*bought meme",
        "What's forced about it",
        "That’s because he’s a vapid incel, along with his beta cuck fascist followers.  \n\nThe movie studio thanks him for his ticket money and 45 minutes of free advertising.",
        "Everyone fell for the \"Barbie vs Oppenheimer\" viral ad campaign.",
        "I recommend you look up the definition of hyperbole.",
        "Yes, barbie is catching a LOT of flack from right wingers for \"promoting sexism towards men and pushing the trans agenda\" and I'm dead fckn serious",
        "No",
        "Here you go. GOP lawmakers spending their time on the important things as ever.  \nhttps://www.usatoday.com/story/news/politics/2023/07/10/barbie-movie-gop-lawmakers-south-china-sea-map/70397413007/",
        "funniest comment here",
        "It would have cost you nothing to not write this",
        "Damn Tarantino directed Barbie?",
        "\n\nThanos voice* “tiny nuclear dick!”",
        "Haha right, Trump would never play loose with nuclear secrets.",
        "They will come away from Oppenheimer only learning the wrong lessons. I went with one and their take away was he was bad because commie.",
        "If you wanted to really piss off conservatives, explain to them how basically all serious historians now believe that the Soviet Union's declaration of war against Japan and invasion of Manchuria were much more relevant to Japan's surrender than the atomic bombings of Hiroshima and Nagasaki.",
        "Atomic by Blondie?",
        "For anyone curious, *Atomic Blond* was a amazing movie.",
        "Charlize Theron",
        "Atomic dog",
        "Before barbie girls got to play with a sponge, in the sink, on some dishes.",
        "Certified Jake Sully moment",
        "In my country, there was a famous religious leader who released full guidelines on how to marry and have sex with aliens if they exist. I wish i was joking.  \n\nSo yup, if we ever get an alien invasion, people’s main concern would be “but can we f*ck them ?”.",
        "You are very close, human.",
        "Hey, I sure wouldn't mind getting me some more of that Arcturian poontang!",
        "And they call everyone else snowflakes.",
        "Sounds like a guy who couldn’t do a proper Beach Off. smh",
        "🎵[Bring dustpan and a broom for this dry ass poon🎵](https://www.youtube.com/watch?v=jWsx2iqO1ks&ab_channel=Grandayy)",
        "Lmao, RedLetterMedia did this as a joke four years ago but with acetone instead of lighting them on fire.\n\n[Pathetic Man-Child Destroys 2,387 Vintage Star Wars Figures](https://youtu.be/bf2tBFfMLMk)",
        "Went out and purchased them? He already had the dolls, the playhouse, and the convertible in his playroom.",
        "I find it amusing that in the clip that I have seen of it is he such a failure that it seems he missed getting the Barbie into the trash can when he attempted to throw it away.  Instead, it suddenly cuts to Barbie laying in the trash can clearly not where he threw it.",
        "He spent almost $100 to burn them",
        "Honestly,  Ben Shapiro is just, wow what a sad human being...",
        "That's how he starts the video lol. Totally irony free.",
        "There's a monster at the end of this political party.",
        "How did he want to use the bomb?",
        "Just as an important historic note, before the nukes they were burning people alive by the hundreds of thousands, to the point where the nukes are only the second and third deadliest bombings of the war, behind Tokyo, that was bombed by entirely conventional firebombs. \n\nAnd bombings weren't a big killer during the war. After the Doolittle raid, in retaliation, Japan murdered roughly 250k Chinese civilians, that's more than both bombs combined.\n\nLeveling a city wasn't a matter for debate, the debate was around leveling another city. Japanese propaganda was adamant that when the Home Islands were invaded there would be no surrender, it would be a fight until extermination. The mass suicides on Okinawa and the resistance on islands like Iwo Jima, where Japanese soldiers fought on long after the last shred of hope for victory was lost seemed to reinforce the idea that this was going to be a fight to the death, there would be no Japan after the war.\n\nIn that context, nuking a couple of hundred thousand people seems almost trivial when you're mentally preparing to send in soldiers to manually kill millions while losing hundreds of thousands of your own men. Contrary to popular belief, the goal of the nukes wasn't to scare Japan into surrender. That was the hope of some people, but most of the military was gearing up to use them as tactical and strategic weapons, clearing the way for US troops to land. It was just one more tool in a very large arsenal that turns people into corpses and one that cost a very large fortune at that.\n\nSo yes, he wanted to use them. They were built to be used, they were built to kill a lot of people, because one way or another, a lot of people were going to die, so it might as well be the other guy.",
        "I dont think their portrayal of Truman was very good at all.\n\nTruman was the one who put a stop order on all further atomic bombings, which is actually what was the beginning of our modern system of presidential control of nuclear weapons.\n\nHe said he couldnt bare the thought of \"killing all those kids\".\n\n\nAnd he of course refused to deploy or use them in places like China or Korea later in his presidency when MacArthur asked too.",
        "> I'm glad they didn't pull punches about how shitty Truman was.\n\nEh, while there will always be controversy over his decision Truman is easily one of the top ten if not top five presidents of all time.",
        "Yeah, we're talking about people who listen to Jordan Peterson and find it coherent.",
        "Yup.  Reading this and seeing the word \"muppets\"...now I want more than anything a \"Muppet's Oppenheimer\" with the Swedish Chef as Robert Oppenheimer.",
        "Kermit: J Robert Oppenheimer (Cillian Murphy)\n\nPiggy: Kitty Oppenheimer (Emily Blunt)\n\nSam the Eagle: Gen. Leslie Groves (Matt Damon)\n\nUncle Deadly: Lewis Strauss (RDJ)\n\nDenise: Jean Tatlock (Florence Pugh)\n\nPepe the Prawn: Ernest Lawrence (Josh Harnett)\n\nCrazy Harry: Boris Pash (Casey Affleck)\n\nGonzo: David Hill (Rami Malek)\n\nSwedish Chef: Niels Bohr (Kenneth Branagh)\n\nFozzie: Edward Teller (Benny Safdie)\n\nProf. Bunsen Honeydew: Einstein (Tom Conti)\n\nRizzo as Alden Arenreich’s unnamed character\n\nJason Clarke stays as Roger Robb",
        "Alden Ehrenreich's character is obviously the only human, right?",
        "It's simple: Bombing Japan good, woman bad.",
        "This is silly, people have enough time and energy to talk about both.",
        "Barbie is a feminist toy brand? The one that has historically been the absolute whipping girl of feminist ideology and criticised for promoting mindless materialism, body image issues/dysmorphia and negative stereotypes among girls?\n\nIt's not a feminist brand, it's a mindless product that stuck a veneer of feminism® onto itself like any other neoliberal corp would. 'Look, now she's a doctor. Buy it'.",
        "Feminist toy brand?",
        "> feminist toy brand\n\nwut",
        "Barbie a \"feminist toy brand\"?",
        "You can brush my hair",
        "in fairness, they do talk a lot about communism in oppenhiemer, and other than the fact that characters have to publicly denounce it because of the red scare it's put in a much more favorable light than most media that would claim to be anti-communist.",
        "Nobody promotes the movie better for me than alt-right raging click baits.",
        "Bob was creating a bomb with the express intention of stopping fascists. No wonder, then, that US conservatives are triggered and feel personally attacked by the movie.",
        "both are also responsible for killing 250k japanese civilians and poisoning their children for another century",
        "Made in China",
        "Social credit score -10000",
        "Yup, it's 8 dashes which is significant. From the shape of things, that looks more like Anatolia the Levant than Asia and there's a similar dashed line between Greenland and the US/Canada that seems to be a trade route, not a border.\n\nThis is Vietnam making noise to raise awareness.",
        "the red circle should've been around the line close to the green land near barbie's head, cuz that was where the argument started",
        "I while not a Vietnamese, but was there for quite a long time, wholeheartedly agree lol. The government over there is crazily incompetent.",
        "can confirm. fucking chinese asskisser",
        "its a subtle nod to [China's nine dash line map](https://en.wikipedia.org/wiki/Nine-dash_line)\n\ntbf China has influenced Hollywood to cater to China's interest in order for Hollywood to gain access the Chinese market they also did this with Abomination and Uncharted movies putting China's nine dash line map which cause both movies to be banned in Vietnam and the Philippines\n\nIt was also the main reason why in the earlier trailer of Top Gun: Maverick they remove the Taiwanese and Japanese flags behind Maverick's iconic jacket so that the movie will get released in China, they didn't anticipate the backlash from that decision so they have to decide either choose China and get boycotted in the West or bring the flags back they chose the latter so they reinstated the flags back which also caused the movie to be banned in China.\n\nTop Gun: Maverick earned $1.5 billion USD despite no access to the Chinese market.",
        "[deleted]",
        "Crazy bc I'm not a trucker, I work for an incredibly liberal company in an incredibly liberal state, and the alt right everywhere is EXTREMELY LOUD. \n\n> nobody *normal* in the real world actually gives a shit about Barbie movies\n\nFTFY.",
        "Probably work too much to care to listen. I hear this shit not 30 minutes outside of nyc at parks with random idiots who also bring their dog to the park. Unfortunately, if you have a dog youre required to listen to these idiots talk while your dogs play. I met a lot of cool people but these outraged people do exist in quite scary numbers",
        "Why are you watching that Fox News?  Leave it to the grumpy old boomers like we’ve been doing since the 90’s.",
        "It's honestly impressive that someone could go for 43 minutes ranting about any movie, especially one you hate",
        "Ben Shapiro is an insecure emotionally stupid loser, and I’ve had the opportunity to troll him on a former Reddit alias of his.\n\nFuckers like him and chowder get an ass ton of air time on snap, insta, and tik tok, and they are grooming so many kids in to fanatical right wing nonsense.  \n\nThese people are delusional grifters with no convictions at all.",
        "Ben Shapiro did a 45 minute hate screed against it yesterday and literally set Barbie Dolls on fire. Itll be a few more hours before that trickles down to reddit.",
        "it's obnoxious karma farming at this point",
        "In my real life circles in a rural town it's mixed. I've had a couple people I know from work say they took their kids to see it and that nobody enjoyed it / why didn't they make a real barbie movie instead of feminist nonsense. I saw it, I think it was good but probably would have watched it at home instead of the theater since it seems like the kind of movie I'd rather just chill in a cozy spot during.",
        "No there's not. Ooops, time to place another pixel.",
        "is there significant outrage outside of reddit?",
        "On reddit.",
        "So that means there is something wrong with the movie in the first place and people know it ? Hmmmm",
        "Ye, the bomb is out there, the other insanity is still preventable.",
        "Wouldn't that have been an awkward conversation?\n\n\"Hey listen, we've got a great prospect for you! We've got a film about the construction of the device that killed a couple hundred thousand of your citizens in WWII. You interested?\"\n\n\"Excuse me?\"",
        "Im sure you can find some, and I have seen some outrage about Oppenheimer too, but whining every time someone doesnt like a movie is just silly.",
        "Why?\n\nI’m 100% not watching Barbie because I’ve never been interested in it, but why would someone care about it existing.",
        "What are you watching on YouTube for you to be recommended right wing videos though.",
        "\"There is a gay person in my movie. The west has fallen. Billions must die.\"",
        "That's the funniest thing to me, when these clowns go absolutely balistic over a product going \"Woke\" and crying about it on Twitter/Youtube/Reddit/4-Chan, they're actually helping the product or company or whatever they decide to be mad about more than actually cause harm.\n\nI also find it wild how he was suprised that Barbie, a toy brand that's entire ethos and thesis was to basically tell little girls they can be more than a wife or a mother is \"woke\" and that the movie based on the toy is also \"woke\"",
        "Shapiro promoted it for 43 minutes. \n\n>In the marketing and advertising worlds, any attention to a brand is traditionally thought to help the brand out. \n\nAll they had to do was say it was \"woke\" and add something to trigger the alphas. Looks like they fell for it hook line and sinker.",
        "Did they though? Anecdotally, no one I know is interested in seeing either of these. At least not until they come out on a streaming platform.",
        "His integrity as a redditor.",
        "It would cost him nothing to keep going, I’m close",
        "It rubs the lotion on her feet.\n\nWait, that’s not lotion.",
        "Tarantino rated Oppenheimer as a 9/10, deducting one point for not having a scene where Florence Pugh suns her bare feet in the glow of a nuclear explosion",
        "Trump? He's a true patriot...................................",
        "I guess when it comes to classic 80's songs about nuclear annihilation, everyone talks about *99 Luftballoons*, but for my money Blondie's *Atomic* is where it's at.  I mean, I like the idea of a balloon causing accidental missile launches that destroy the world, it has a very German sense of humor to it, but Debbie Harry singing to her lover as bombs explode all around them, *Your hair is beautiful tonight* just works for me.",
        "bow wow wow yippi yo yippie ya",
        "You misspelled Sooooooooooooooooleeeee.",
        "Also, Commander Shepard",
        "Definition of a mixed marriage.",
        "I can't wait for the Sponge people of Wolf 359 system learn about the term \"any hole is a goal\". Shit is going to get wild.....",
        "I don't want to step on any toes, but it *is* possible to have sex with aliens *without* marrying them.",
        ">\"...if they exist.\"\n\nThat's just rude.",
        "Am ashamed that I looked at your profile to try and work out your country of origin. Cause typing into Google \"Cult leader who wanted sex with aliens\" just rubs me up the wrong way lol",
        "yes we can",
        "Let’s get a link",
        "I don't need a guide on how to bang Mexican chicks.",
        "Based",
        "And what about you? Wanna put your money where your mouth is. Wanna beach me off?",
        "He can't beach like he can't pleasure his wife\n\n\n\n\nWhat a fucking loser",
        "butt plug",
        "Believe it or not, Oppenheimer didn't know that the \"Japslayer 3000\" was going to be used on Japan.\n\nTruman hid that fact from him",
        "(to my limited knowledge) Truman wanted to use the bomb as it was used.  Dropped onto a target on Japan. \n\nThere are many (imo) reasonable choices he wanted to do that. \n\nOne: Bring a quicker end to the war.  And force an *unconditional* surrender before an lingering war in the Pacific became horribly unpopular at home.  \n\nTwo: To see if it was viable. \n\nThree: (and to me this is probably the \"real\" reason).. to set off the Bomb on the world stage as a major message to our soon-to-be post war enemies (at the time Communists nations) as to the new power of the US military.  \n\nI am not sure how much Three is discussed.  But after WWII there were going to be some big power-vacuums.  And those vacuums were going to fill up quickly with either \"allies' or \"not-allies\".  And that could have near *instantly* triggered a second major world conflict.  \n\nThe bombs were clearly a giant message to the world about letting WWII end.. and then *stop*.  And while it's not the best run in the history of the planet .. large (like really large) scale wars .. have been deferred for one very important reason: Nuclear consequences.",
        "He wanted to set us up the bomb.",
        "Warringly i bet",
        "He used it on his chicken wings.  Most people thought they tasted terrible though.",
        "iirc it was \"\"\"tactical\"\"\" nukes against the chinese",
        "Sorry, the way I said it was a bit weird. What I'm TRYING to say is that Truman WANTED to use the bomb, and it wasn't some tough decision for him as to whether or not he SHOULD use it.\n\nHe went so far as to ignore his advisors advice for how to get Japan to surrender during peace talks that were already in the process of happening before the bomb was dropped.",
        "[SPOILER]\n\n>!Called Oppenheimer a crybaby, and handed him his shirt napkin to clean away the blood off his hands.!<",
        "Big boom 🤯🤯💥",
        "I agree with all of that, but Truman actively sabotaged peace talks that were taking place prior.\n\nI'm not saying we were wrong or right or anything. War is hell, and both sides committed atrocious acts.",
        "He put a stop order because the bombing of Nagasaki was more or less unsanctioned. \n\nAt the end of the day, it can be debated whether or not the bombing of Hiroshima was necessary, but Nagasaki wasn't. \n\nThe rules that came about are of course necessary, but they should have been thought up before hand.",
        "God the name of that shitstain alone. Sometimes the idiot comes up in my Youtube feed with a title like \"JP absolutely DESTROYS college graduate!!\". \n\nFuck sake, it's not a competition. If anyone learns anything, it's a win for both parties. Those idiots acting like it's a UFC fight.",
        "Not just coherent, they hear it and allow his words to deeply enslave them, because of how weak they are.",
        "I used to think he was good at certain things now I think he’s bit of an idiot.",
        "Oppenheimer was an American, that makes no sense. Niels Bohr was RIGHT THERE",
        "I think Ehrenreich’s character is playing Richard Feynman (though I’m not sure), so rizzo’s New York accent and braggadocio would probably fit him nicely.",
        "I haven't seen it, so I can't contribute to non-muppet casting.",
        "Funnily enough, that’s actually one of the big themes in the movie.",
        "Barbie was meant to be a feminist brand prior to its original creator losing control of how the product was handled. \n\nThe film isn't rebranding Barbie, it's pulling Barbie back to the original reason she was made, before the rebrand that happened when Ruth Handler lost control of the product. \n\nBarbie was always supposed to be a career woman, Handler was adamant that Ken was never Barbie's husband or even her boyfriend (regardless of the later wedding Barbies that Mattel produced).\n\nShe was supposed to be a career woman that Handler's daughters could look up to as a role model, and created in response to the overproduction of baby dolls encouraging daughters to become mothers and nothing else.\n\nThen Mattel saw dollar signs, and capitalism did its thing, and we have \"Do whatever to sell products\".",
        "meh, considering what it started out as they did some serious rebranding and changes over the years to where it can't just be dismissed like you're doing.\n\nYeah, I get it \"corporations bad\" and all that but living through the changes through the last 50 years, what they did has had an impact.",
        "At the same time Barbie has a toy for pretty much every job out there.",
        "One of the characters in the movie literally roasts barbie  in the movie when she comes to the real world with this lol",
        "Hell the movie actually addresses this.",
        "I think it’s slightly less clear cut than that. The only reason I played with any Barbies as a kid was because they had cool jobs. I didn’t really care about dressing them up, but scuba Barbie could explore the ocean, veterinarian Barbie saved animals, pilot Barbie flew airplanes, etc.",
        "Yes.\n\nhttps://www.latimes.com/opinion/story/2023-07-16/barbie-movie-feminism-doll-greta-gerwig-margot-robbie-ryan-gosling-mattel#:~:text=The%20first%20Barbies%20also%20came,feminist%20message%20to%20little%20girls.",
        "Undress me everywhere",
        "several of the physicists were socialist/communists (oppenhiemers gf and einstein among others)\n\nalong with oppen himself being banned from security clearance due to alleged communist ties lol.\n\ntruman wanted to also nuke china too\n\nyou cant remove communism from this era.",
        "If Ben Shabibo hates it, it's on my must watch",
        "Honestly I haven't been to the movies in ages, so I haven't been paying attention to what was coming out. And as a grown adult, Barbie wouldn't have caught my interest anyway. But all these posts and articles about conservative outrage and the resulting comments saying how great the movie was make me want to see it.",
        "I hate to say it but those civilians would probably have died anyways in an invasion of the four main islands (itself an inevitability based on the flimsiness of the ceasefire offered to the Soviets). \n\nOf course this should never happen again, and of course the U.S. should do more to progress nuclear non-proliferation and disarmament.",
        "> white collar job\n\nThat's the biggest difference ain't it? Culture war is middle class nonsense. Working class has no time to fret about it.",
        "I'm not, I listen to radio that will poke fun at Fox News.",
        "Wasn't there someone that did like, an 8 hour rant about Captain Marvel when it came out? Benny Shaps has some catching up to do.",
        "Wait til you find out about people like MauLer. \n\nThis man somehow managed to make a movie review that was almost 9 hours long.\n\nhttps://www.youtube.com/watch?v=95mL3us0HSQ\n\nhttps://www.youtube.com/watch?v=uFtFjH8NyQQ\n\nhttps://www.youtube.com/watch?v=Zb3F5WE6KBI\n\nLike I understand doing a \"deep dive\" but this just seems excessive.",
        "My favourite fact about Ben Shapiro is that he absolutely despised Trump right up until he won that first GOP primary, predicted that he'd tear the right apart, then immediately flipped to singing his praises without missing a beat.",
        "Lol at being proud of trolling",
        "Ben Shapiro is always upset about something, it's how he makes money and stay relevant to the people who like listening to him. \n\nHe can't just take a 2 month break because there's nothing for him to legitimately hate, he gotta keep at it, all the time, and if there isn't something for him to hate, he gotta make shit up. It's the logic of the rage-bait business model - and it applies to all rage/click-bait grifters (on both sides of the political spectrum).\n\nAll in all, Ben Shapiro being upset about something is a really poor indicator about how outraged people actually are. Compare the Barbie drama to say the Netflix Cleopatra outrage, and this is a big fucking \"*Huh? What?*\". If Cleopatra was a 7.5/10 on the outrage scale, Barbie scores a cold 2/10. Barely anyone cares.",
        "You guys watch Ben Shapiro? Why?",
        "You clearly don’t like Ben Shapiro so why are you watching him or following what he does? Like do you go out of your way to look at his shit so you can get pissed about it later and use it as some sort of gotcha? Seems weird",
        "Boo hoo",
        "Well, depends on your definition of significant. Right wing circles are throwing a fit. Benny boy Shapiro just made a 40 minute video on it, Piers Morgan is losing his shit, fucking Ted Cruz complained about it. It's definitely gonna be a shit show in coming weeks.",
        "It astounds me to see people calling takes that would have been completely uncontroversial just ten years ago \"insanity\". We really are regressing.",
        "Not really? It's an important event in their history to say the least. A high budget film about it I would expect to be interesting to them.",
        "In fact, they would be.  Japanese do a lot of \"history behind an event or product\"-type documentaries and dramas. \n\nBig nothingburger anyway as many films are released way after their American debut.  John Wick 4 is coming out in September for Christ's sake.",
        "You don't rly have to",
        "It doesn’t matter whether or not they’re interested in either film. Just the fact that everyone basically on the internet or watches some TV is culturally aware of the existence of both films and the meme is a huge successful marketing accomplishment.",
        "Exactly the opposite experience, everyone I know had zero idea these existed but now wants to do the back to back thing",
        "Where do I download integrity?",
        "Jek sooleee",
        "Why does she pronounce it Soolee when she heard him say it was Sully and she's never seen it in print.",
        "That's the spirit.",
        "Pretty sure he's referencing Raelism. But humans being humans, there might be others.",
        "I could beach both of you off",
        "What do you use it for sir?\n\nhttps://youtu.be/IzxkJETW7lg",
        "Yeah, he had no idea weapons development was related to the war.",
        "I cant tell if this is a joke or not but Oppenheimer was very aware that it was going to be used on Japan. He was on the targeting committee that helped pick targets for the bomb.",
        "[deleted]",
        "There is also the realpolitik consideration that Russia was on the way to \"helping\" the US conquer Japan through Manchuria and the US did not want to partition Japan amongst victors as it did Germany.  Technically part of your point one, but distinct in motivation from your summary.",
        "If you haven't seen it yet, basically half the movie is about Three :)",
        "All your base are belong to us.",
        "Pretty sure that was general MacArthur and Truman disagreed with him on that.",
        "That would've solved a lot of problems",
        "Of course he wanted to use the bomb. \n\nIf the invasion of Japan went ahead and as expected hundreds of thousands of US soldiers died, and then it came to light Truman had spent huge resources on a super weapon that could have ended the war sooner, all family members of those US soldiers killed would have hung him from a lamppost. \n\nToday we hand wring about what the best course of action was, but fact is Truman had no real choice but to use them.",
        "Because in the context of the Pacific front of WW2, we most definitely should have used it.",
        "And how fruitful would those peace talks have been, now that we know Japanese doctrine was to make the Americans bleed for every inch of mainland Japan?",
        "Did that not happen anyway?",
        "You mean the peace talks where the Japanese insisted on trying to keep parts of Manchuria?",
        "\"I agree with all of that, but Truman actively sabotaged peace talks that were taking place prior.\"\n\nThere is no peace with an expansionist fascist empire, only a ceasefire.",
        "Unconditional surrender was the agreed aim of the alliance. The peace talks were the Japanese maneuvering to keep what they had conquered after killing millions of people. \n\nYou have your home invaded, your entire family killed, and then agree to let your enemy keep your lands while he’s actively losing in order to prevent the loss of more life.",
        "The US wanted unconditional surrender.  Peace talks were a nonsense until Japan was willing to come to the table on those terms.",
        "[deleted]",
        "to them debate isnt a way to derive a nuanced position. it is a blood sport to have their muppet claim intellectual superiority, which by extension means they are smart. when in reality its just throwing a bunch of misinformation at you so fast, you cant really debunk each point. at least thats ben shatpiros tactic. jp is so incoherent you dont even know how to argue against the insanity. man almost died to apple cider",
        "Lol.  I just pictured the Swedish Chef throwing stuff randomly in a lab while having a crisis of conscious.  Can't stop smiling at the image.  Of course Kermit would get the lead, but I can dream.",
        "Yup.\n\nhttps://www.latimes.com/opinion/story/2023-07-16/barbie-movie-feminism-doll-greta-gerwig-margot-robbie-ryan-gosling-mattel#:~:text=The%20first%20Barbies%20also%20came,feminist%20message%20to%20little%20girls.",
        ">Then Mattel saw dollar signs, and capitalism did its thing, and we have \"Do whatever to sell products\".\n\nRight but that *is* Barbie as far as the brand is concerned. It may have had noble intentions originally but that isn't what it has stood for for almost everyone it has actually reached",
        "Man, the rich people really do ruin everything",
        "I’m pretty sure you’re thinking of Malibu Stacy",
        "How was control \"lost.\" Did she, like, drop it behind the couch?",
        "What they've done in the last two decades or so has had an impact towards reversing what they already did in the first place, and what they perpetuated for longer. If I steal a twenty off you I don't get credit for giving back ten",
        "Again, that's not what reached the vast majority of their consumer base, that's the original conception of the product. The brand chose to willingly abandon that in favour of everything it was criticised for.",
        "I'm genuinely confused. Why is everyone linking that article here.\n\nIt says: \"Invented by Mattel co-founder Ruth Handler, Barbie was essentially knocked off from the Lilli doll, a German gag gift for men, based on a comic character in a downscale German tabloid. Lilli was not a “nice” girl; her raison d’être involved swapping sexual favors for money.\"\n\nShe is based on a prostitute comic character. That disagrees wtht the comment you agreed with above no? like I'm not a native speaker, maybe i did miss something in the aticle?",
        "Devastation. US machinations.",
        "Imagination",
        "I'd reccomend it, even my 60yo father liked it",
        "I am working  class in a conservative market and I can't avoid hearing bad takes and incessant complaining about how woke culture is ruining their everyday lives because now they get disciplined for using the N word or harassing women.",
        "🤣 there wasn't even 8 hours of Captain Marvel/Carol Danvers reading material when the movie was released",
        "Oh there are plenty of Japanese films about the nukes they just have a slightly different tone lol, especially since there are still people whose family were killed by the bombs.",
        "To us, it was a Tuesday",
        "Yeah, being male tends to be enough to get that sidebar growing a pencil tasche. I've trained mine up to avoid that shit pretty well, but lord forbid I watch any videos about cars!",
        "What's the meme?",
        "That's pretty cool. I could see how the contrast in films could make for a good time.I only said anything since dude said \"everyone fell for\" But in my small circle no one cares.",
        "You just need some high quality tegridy",
        "[Here](https://www.youtube.com/watch?v=dQw4w9WgXcQ&pp=ygUjcmljayBhc3RsZXkgbmV2ZXIgZ29ubmEgZ2l2ZSB5b3UgdXA%3D) but it'll cost you your soul",
        "MyJek!",
        "I mean, if you actually are interested in the history of the bomb, they made it in a race against the Germans, and thought of it more of a deterrent than anything.\n\nSo the team of many Jewish scientists were a little less enthused when they learned they wouldn’t be killing nazis",
        "You know you guys could go watch Oppenheimer and realise all of this dialogue is covered in the film.",
        "Ah.. I have not seen it yet.  And good.. it was an important aspect of the \"rationality\" behind actually using the bomb and not just testing it and hoping the world would take note.",
        "What you say?",
        ">Today we hand wring about what the best course of action was, but fact is Truman had no real choice but to use them.\n\n\nThat's not true Japan was expected to surrender in the coming weeks, once Germany fell the soviets would have turned to Japan too. There would be no need to invade when you could just surround the island with the entire allied naval fleet. \n\n\nGeneral macarthur himself who was the leader of the Pacific theater expected the Japanese would have surrender. \n\nThe Japanese literally OFFERED to surrender to the allies they just wanted to emperor to remain the \"figurehead\" of the state. Instead the US rejected the offer and bombed them not once but twice with nukes.\n\nWe made a choice we could have ended it differently.",
        "Having no choice but to bomb civilians with a nuke because he *might* get bad press at home is certainly a take.",
        "Thank god I’ve found someone else in this thread with a reasonable take. You are 100% correct about the pressure Truman had to use the bomb. He was a nobody thrust into the presidency immediately after a president who was as close to a god in American politics as anyone since Washington. Not a military man. Not well-respected. Not really known by anyone. He (and Democrats at large) would have been crucified had he not used the bomb.\n\nAnd as much as I love Roosevelt, he was wildly irresponsible allowing the DNC to nominate Truman. Roosevelt was already very sick, and he basically had no input in who would be on the ticket with him. You could maybe argue that Roosevelt did this on purpose. He knew that if he died in office, a nobody like Truman would face enormous pressure to just do whatever people thought Roosevelt would do. I don’t think that was the case though. My best guess is that FDR was just delusional about his health and thought he’d definitely live to see the end of the war.\n\nI would just ask that everyone read the accounts of Saipan and Okinawa before they come to a conclusion on the morality of dropping the bomb. They are harrowing. People like to talk about the civilian deaths from the bomb and point to them as the reason it was so bad to drop the bomb. But read about Okinawa and Saipan, and you’ll quickly realize that civilians were not spared there either. Not because the allies killed them, but because the Japanese killed each other rather than surrendering.\n\nThe anti-bomb people seem to assume the Japanese were a rational (by modern standards) people. But that was not the case. Rational people don’t commit mass suicide or kill their families for a lost cause. It is tragic that it came to that point, but I am 100% convinced that it took the U.S. flexing to finally break the Japanese. “We can burn down your capital with massive air raids” didn’t work. It took “we can literally wipe an entire city off the map with one plane and one bomb” to get the message through.",
        "Not to mention the millions of Japs who would be killed and raped by the invading Allied troops. People are pontificating about the use of the nukes today but could you imagine the outcry when the wider world figured out millions of lives could have been saved by using them?",
        "There werent any peace talks happening the other guy just made that up.\n\nThe US had cracked the Japanese diplomatic code and knew what the Japanese government was thinking. They were still dominated by a war faction who believed they could get some concessions out of the US.\n\nTruman was continuing the policy of FDR which inisted on unconditional surrender which is of course what eventually happened. \n\n\nBut there were no active communications between Japan and America and Japan was not on the verge of surrender.",
        "He was told by a senior advisor that Japan held honor in high regard, and that they needed SOMETHING to save face. He advised Truman to allow them to keep there emperor in power, even if it was just a figurehead. And he refused.",
        "[deleted]",
        "There were, but not ones that were reasonable.",
        "Hence the \"was meant to\". It's a sad to see something with good intentions so badly twisted just to make money.",
        "But I think we can all agree it's better you gave back 10 than nothing at all. Just as we all agree the Barbie trying to pull itself away from the negative image it has created for itself is still better than them ignoring the problem or leaning into it.",
        "Your analogy is bad, and the way you're talking I get the impression there is absolutely nothing anyone can ever do to satisfy you. \n\nFrankly you come across as the type of voter who year after year refuses to vote for the best option since it's not perfect and then wakes up one day to realize their country has become a horrifying shithole.",
        "Are you saying that millions of women haven't gotten inspiration and motivation for what they could be in life from Barbie and similar examples of breaking out of the outdated views society had? How can you say a successful independent woman who's had every career under the sun isn't feminist? Just because she's pretty?",
        "What something is based on is irrelevant. The point is what it did itself. And Barbie as a person and brand has been progressive for decades.",
        "Come on Oppy, Don't be a Commie",
        "Come on Barbie let's blow the party",
        "I mean I'm not male but like sometimes yt is just fckn nuts with recommendations. The most political thing I watch is Jamie dodger and once got recommended \"why the nazis might have had a point\"",
        "screw you",
        "There were some scientists who said the bomb should be used in a demonstration before being used on an actual city.\n\nOppenheimer was not one of those people. \n\n\nHim along with the other members of the advisory committee dismissed this idea and he himself was very involved in which cities to target.",
        "Tbf, by the point the bomb was finished Germany had already surrendered, leaving only the Japanese on their home islands who absolutely were going to fight to the bitter end for every square foot. \n\nI personally don't buy their claims that it was only ever supposed to be a deterrent. It's a massive fing bomb. Of course it's going to be used",
        "You think they thought we'd start a war to drop a bomb on a nation that already surrendered?",
        "Would absolutely recommend seeing it! Sounds like you would enjoy the depth and nuance it goes into",
        "Main screen turn on",
        "There was no expectation that Japan would surrender before a invasion of the mainland was underway, even after the bombings of Hiroshima and Nagasaki a faction of the military attempted to overthrow the emperor to continue the war. \nIt really was only when the emperor himself told his people to surrender that it occurred.",
        "Then after they dropped the bomb they let the emperor stay in power anyway.",
        "[Gee I wonder why](https://en.m.wikipedia.org/wiki/Nanjing_Massacre)",
        "This is going to sound mad but Mattel does not run the country I live in, nor yours, they can gladly piss off without a fundemental loss to anything important. \n\nYou're here presenting a fallacy that mattel is an inevitable part of the human experience and we either work with them or ignore them to our detriment. That applies to governments, not toys. Stop treating Barbie like a political party, you're the one with the utterly nonsensical analogy.",
        "> Don't go Commie\n\nFits the meter better.",
        "And to add to this, this was happening since before we knew it was baked into the system.\n\nHow many people got radicalized 8-10 years ago because they were mildly dorky, awkward dudes and their feed started showing them feminist cringe compilations?\n\nThis whole shit snuck up on the entire internet and 3 out of every 10 men fell victim to it.",
        "I mean, what are they going to do? Go back to war against us?",
        "But without divine status.",
        "> but Mattel does not run the country I live in, nor yours,\n\nI never said this, you're saying it so you can deliberately miss my point. \n\n>they can gladly piss off without a fundemental loss to anything important.\n\nYes, the entire human race can piss off and nothing of fundamental importance would be lost. That is immaterial to what I was saying.\n\nDude, you're being a negative nancy."
    ],
    "Real Footage of Robert Oppenheimer testing the atomic bomb": [
        "I think nuclear explosions footage doesn't really put into perspective how big they are. Just for comparison, this first ever test was about 25 to 50 times more powerful than the [Beirut explosion](https://thumbs.gfycat.com/CorruptGorgeousBackswimmer-size_restricted.gif)",
        "I saw Einstein in that fireballs towards the last second of the clip.",
        "The footage of Oppenheimer, himself, was not actual footage from the Trinity Test in 1945 - it is a re-enactment from 1946. The film was called *Atomic Power*.",
        "This footage is way cooler that the explosion from the movie. Idk why they just didn’t use this.",
        "It annoys me when people reduce mega-projects like this down to one person.  People constantly pin it on one guy, either a worker who was in a management position or a politician who proposed the project.  The reality is that these are the works of thousands of people, maybe more, all working from various angles.  No one person built the nuclear bomb, and calling a man like Oppenheimer its “mastermind” is unfair both to him and the many others who worked with him.",
        "Documentaries seldom explain that perhaps the hardest part of building the first fission bombs was the timing of the detonations of conventional explosives which forced the fissionable material into a critical mass that would explode rather than just heat up and melt.\n\nElectrical current takes measurable time to travel over wires to \"blasting caps\" and all of the explosions had to happen at exactly the same instant so that the force compressing the fissile material was applied evenly in three dimensions.  Today there are off the shelf timer switches capable of that precision.  The Manhattan Project had to invent them and had nothing more sophisticated than ~~slide rules~~ rudimentary early computers and analog gauges to assess and model their performance.  (Thanks to u/Newme91 for the reminder.)",
        "Big bada boom",
        "Movie was pretty underwhelming with the test lol. In the move they just did a normal explosion\n\nThey should have used CGI to make it look like an atomic bomb explosion, or they could also use this video and a bit of enhancing/CGI-ing to make it look good",
        "so did anyone die of radiation after this test? was it safe for them ? because it was the first ever nuke so i don't think they know what to expect and what distance was safe for them.",
        "She was blind but saw it?",
        "Movie just looked like a puddle of gasoline being lit on fire",
        "Miles away ,a young girl ,blind from birth ,saw the light 😬🫨",
        "Anyone else see a face at the end?",
        "My grandpa worked at the lab that Oppenheimer worked at. My dad always told me stories of Los Alamos, NM since he grew up there. My dad developed cancer at a young age and was convinced it was because of this happening near where he grew up.",
        "When does Barbie show up??",
        "Fun fact about the people at 0:05! The guy center left (Harry Daghlian) and the guy center right (Louis Slotin) would be killed later by their own hubris when testing another nuclear source, the plutonium core nicknamed \"The Demon Core.\"\n\nEach of them would test how close they could get to a criticality event by (1, Daghlian) slowly lowering tungsten carbide bricks in place around the nuclear source using *his fucking hands* and (2, Slotin) slowly lowering two half spheres of beryllium over the very same nuclear source using a *fucking flathead screwdriver.*\n\nIn Daghlian's case, he dropped one of the bricks on top of the core, causing a criticality event that released a lethal dose of radiation into his body, killing him a few days later.\n\nIn Slotin's case, the flathead screwdriver slipped from its position (Slotin had removed the protective spacers that had been placed there previously to prevent the two halves from fully closing), the spheres closed, and another criticality event occurred, irradiating Slotin and 7 other people around him. Slotin died a horrible death several days later, as well.",
        "It makes me horrified everytime I see stuff like that.",
        "Imagine how highly classified this footage as at the time, but they filmed it anyway.",
        "[deleted]",
        "He has become death.",
        "Oppenheimer is one of the best movies Christopher Nolan has ever made. Immediately after watching it I just wanted to learn more about it and there’s very few movies that I can say I’ve had that experience with",
        "Humans are going to create their own downfall.",
        "This is the scene from the movie and you cant convince me otherwise",
        "Is that Rod Serling narrating?",
        "Cinema was fun this weekend, Oppenheimer and Barbie were two really nice movies to enjoy and watch.",
        "All those human lab rats breathing in the radioactive dust",
        "No I see the face of death in the gigantic fireball.  Chilling.",
        "Why would you build such a thing?",
        "Awful...",
        "\"*Blinded by the light. Revved up like a deuce, another runner in the night*\"",
        "The one thing that is always left out of the \"should we have dropped it\" debates is that Japan was *currently* committing atrocities against the Chinese that were on par with the Nazi's.\n\nThose bombs didn't save just American lives.",
        "This is crazy. And now we have deadlier ones and waaay more of them.",
        "Thanks for the spoiler. now I don't need to waste money for a cinema ticket.",
        "Love watching original footage of nuclear explosions. I’m just hoping I don’t have to see one up close",
        "Spooky stuff to watch tbh.",
        "Anyone see the face in the last few frames?",
        "But park your Honda civic, you are destroying our climate.",
        "Then there was eventually tsar bomba",
        "That depress the shit out of me",
        "miles away a young girl blind from birth saw the flash, \n\nso bright a blind girl saw the flash",
        "My great grandpa helped build the atomic bomb",
        "\"they HAD to\"\n\nFuck no, they didn't have to poke around with any of this at all.",
        "What is this clip from?",
        "At first I thought there was a guy getting inside.",
        "Why end it there.",
        "Um… werent they nervous at all assembling that thing? Especially connecting wires?",
        "We need to talk more about nuclear fall out and the effect this had on the ‘Downwinder’ communities in the area. Or any area where radioactive minerals were mined and used and the irresponsibly sloppy work the government did to contain it.",
        "Where is this footage sourced from? And do we know who was the videographer?",
        "source : [Yt Video](https://youtu.be/nAm_OPVeS4w)",
        "Worst Thing to ever Be invented... Footage is awesome though",
        "Business is BOOMIN'!\"\nStop saying that Robert.",
        "u/savevideobot",
        "The movie [Atomic Cafe](https://youtu.be/i9xQTJ-kbUk) has lots and lots of footage of nuclear tests.  People need to watch this if they are interested in the Oppenheimer movie.",
        "No way that's my birthday!",
        "Does anyone have the source for the whole clip? I would love to watch the whole thing",
        "Very deep man 🤔🤔",
        "I hope in the blu ray extras they actually show the full recording of the explosion they created. Be fuckin rude not to.",
        "Spoiler Oppenheimer's plot",
        "source ?",
        "looking at nuclear powers gradually destabilizing like russia/pakistan.  Only a matter of time before this shit but 100s times more power goes off again.",
        "The bomb just turned off sound for a bit.",
        "This generation is lacking the the hours upon hours of repetitive documentaries on History channel and TLC that describe all of this.  Everything from biology to anatomy to atomic bombs and religion.",
        "A lightening storm, the doubt that Earth’s entire atmosphere may ignite, “success”. I can’t even imagine.",
        "Question 🙋‍♂️ if it were _twice_ as powerful, would the Beirut explosion blast radius be twice is big? Or the destruction twice as bad? Like how does that scale?",
        "Why was it done during the night and not during the day so they can see better all???",
        "This trinity explosion was much more drastic and powerful looking than the movie.  The one in the movie was pretty underwhelming unless it’s cuz my seat wasn’t the best in the theatre",
        "I wish I could see a nuke go off in real life but I was born to late and nuclear testing can’t be done above ground anymore",
        "The balls this people had.\n\nNow we know a lot about exposition and health consequences, and what happens when you detonate an A bomb.\n\nBack then it was unknown or theoretical .",
        "No way they made him in real life after the movie that’s crazy",
        "Watch Trinity and Beyond.",
        "I need a banana for comparison please.",
        "spoilers? some of us haven't seen oppenheimer yet",
        "This was my one gripe about Christopher Nolan's Oppenheimer. He let his hubris get the better of him and refused to use CGI to create the explosion which in my opinion was a mistake. You can tell in the film that they had to edit away from the explosion as much as possible because the one they set off practically was pretty pathetic in comparison to the real reference. The build up was incredible but man what a disappointment, luckily everything around it from the acting to the sound design was able to salvage the moment.",
        "ngl, the movie was super boring unfortunately.",
        "12 years later:\n\n[H-bomb test](https://youtu.be/v1HkyHHmrgY\n)",
        "We’re definitely blowing ourselves up one day",
        "Wonder why they didn’t detonate it during the storm that would have been cool to see how it effects the storm.",
        "Is the blind girl story true? Because that would be crazy if it is",
        "This is how it’s all going to end for Earth, ain’t it?",
        "at the end theres putins face in the cloud",
        "04:02:55:08 \n\nI see side profile of an alien \n\nAnd a very very clear eye on the top left",
        "I highly recommend the documentary, Atomic Cafe — a lot of eye opening footage from this period of time.",
        "I'm ruined now when the initial flash goes off and it's silent because all I think about now is the guy who was filming this part of the movie in the theater and when it went silent he farted and everyone in the theater started laughing 😂😂😂",
        "how did they even have the same music as the movie?!??\n\n\n\n\n/s",
        "The descriptions people give of what it was like to see it in person are insane. It was stuff like even with their hands in front of their eyes the brightness of it still completely whited out everything he could see. Or another one was a guy saying he held his hands up to shield his eyes and he could see all the bones in his hands.",
        "This what happens to my toilet after eating Taco Bell.",
        "Dr Oppenheimers work is truly fascinating! I only wish all that time went into more life supporting elements of his work :/",
        "It that the IMAX quality, very nice",
        "u/savevideobot",
        "Way better and scarier than the movie’s explosion high key",
        "A born blind girl seen the flash? That’s worth investigating isn’t it?",
        "Such a terrifying weapon. The power it unleashes is unreal.",
        "Still such amazing footage of such a terrifying event.",
        "and the first ones are like grenades compared to what we stock now.",
        "and that gif does an astonishingly horrible job of portraying the magnitude of the Beirut explosion, compared to the original video. \n\ngifs are the worst part of reddit",
        "This is why I found Nolan's practical explosion so underwhelming.\n\nI was like yeah... Some things do need CGI.",
        "How did they know that they needed to look away at the initial explosion? Everything was based on theory.",
        "In 1917, a cargo ship carrying munitions exploded in Halifax harbour, Canada. The blast wiped out nearly half the city in damages. This blast was 1/5th the size of the Manhattan project test. A whole cargo ship filled with the strongest explosives of the time was barely 1/5th the size of a single bomb that was developed 25 years later.",
        "Goodbeirut",
        "I saw that face as well. 💀revealed itself to mankind",
        "The main surprising takeaway I got from the movie is how absolutely little Einstein has to do with any of it.  Like, zero.  I grew up thinking he spearheaded The Manhattan Project when in reality wanted nothing to do with it.",
        "The birth of the entity known as Bob.",
        "[Screenshot](https://i.imgur.com/NIx2jJJ.png)",
        "mufasa ass mushroom cloud",
        "I thought it was Karl Marx",
        "Brooo I legit paused this clip looking for a different comment, looked up and saw Einstein 😳😳🤣🤣",
        "Holysht, now i have seen it too",
        "Some of it is original — the early color footage is actually of the real assembly prior to the test, taken on silent 16mm film. The black and white footage is from a reenactment. The final nuclear explosion is not Trinity (I'm not 100% sure which one it is, but it's not Trinity; it has the feel of Upshot Knothole Badger to me, but is lacking some key features in most footage of that test, so probably not).",
        "The audio from the movie was crazy good though.",
        "I was surprised as well\n\nBut I imagine it was on purpose... they really didn't want to glorify the atom bomb, or its explosion\n\nThe movie was about politics",
        "I agree 100%. I was put off by the fiery/sparkler effect they went for. Can't get any better than the raw explosion footage.",
        "I'm sure the original tape is slightly better than what we see here, but I doubt it's good enough to be usable alongside 70mm IMAX.\n\nI think they could've gotten a wide shot of a similar looking explosion using practical effects alone, but as Nolan mentioned in interviews, it was always meant to be a somewhat abstract montage like you see in the final movie.",
        "I think you are missing the point a bit, as shown in the opening act of the movie, Oppenheimer thought in the realm of subatomic particles. For him the experience of watching the bomb go off was not so much the wholesale explosion but what was happening on the smaller scale, each atom bursting open releasing its energy. The explosion was shown zoomed in because we were seeing it through Oppenheimer’s frame of mind and way of thinking.\n\nEdit: corrected neutron for atom as pointed out by someone underneath. its past my bed time.",
        "The build up of the movie only to see that explosion was... a big let down to say the least",
        "Nolan does not use full cg shots, so instead went for some pyro , and there is not enough tnt in all of Nevada to get a practical effect to look right for a nuke.\n\nfor once, one thing that computer fx simulations do correctly is nuclear explosions. Nolan should have just gone with that.\n\nInstead, the movie ended with an underwhelming slow-mo close-up shot of a petrol fireball.",
        "Totally agree and can’t believe more people aren’t saying this. While the explosion was cool, it was so painfully obviously not a nuclear explosion. It wasn’t even that large in terms of conventional explosives. CGI would have beeen better especially considering they literally used CGI detonations in some of the beginning sequences.",
        "Totally agree. I think it would’ve been better.",
        "Agreed. Look, I think Nolan's dedication to doing things practical as much as possible is great, but there are things where CGI is the better tool, and a freaking nuclear explosion is one of them. The sound design was stellar but the actual explosion in Oppenheimer was underwhelming.",
        "It’s almost the exact same.",
        "Probably to not let it steal the main message from the movie…”that we have in fact started a chain reaction that will destroy the world”",
        "Because having a new movie shot in one aspect would look dog shit having some decades old footage spliced in? What a dumb suggestion.",
        "I keep saying this exact thing. I was let down by the movie explosion. The sound was great but I didn’t feel like it was that impressive/impactful",
        "Ye I wish they sliced in some actual footage from the test and the bombs being dropped, I feel like it would have added abit more to an otherwise great movie",
        "I said this. The bomb footage sucked",
        "My thought exactly. Looking at this, the movie was incredibly underwhelming. \n\nPretty disappointed in Nolan.",
        "Yeah, biggest disappointment in the movie. The dude has made cities fold in on themselves just for the sake of looking cool.You'd think he could do an explosion that actually does the bomb's scale justice.",
        "At least it was zero percent CGI",
        "Its because Nolan really thought the marketing stunt \"no-vfx\" was a good idea. Without vfx you can't make this explosion.",
        "Yeah, the movie did not do this justice.",
        "Was about to say the same. I don’t think they showed the scale well enough because it looked much smaller than it really was while watching the movie imo",
        "All that fuss about not using cgi and I’m sitting there thinking that maybe a bit would’ve been cool.",
        "[deleted]",
        "I was hoping there would be more of that ball of fire they showed for a brief second",
        "They're both cool in different ways",
        "That's just how the brain works. We do it with everything game changing.  It'll never change.",
        "It's true. In a way it's a reward as well as a punishment to the \"lead\" person's conscience. \n\nHowever, you're missing the point in this. It's not about giving credit but about inspiration. Thus you need someone to be that inspiration. The human body has all the parts, yet when one falls, the head is always protected even at the cost of losing hands.\n\nIf we go by the logic, no one can be the progenitor of anything. Everything is built upon BILLIONS of people working towards little things. Ferrari, a supercar, was built upon the wheels cavemen invented. Thomas Edison used the inert gas someone else discovered. \n\nThe head of something is one who brings it all together. One who is bold enough to \"take that leap of faith\". \n\nI haven't watched Oppenheimer, but I'm sure there were instances/dilemmas where he took some important decisions that eventually saved the day. That's what we credit him for, not for the \"blast\", but the \"project\". \n\nCrediting one does not mean discrediting everyone else. If it were so, Oppenheimer would be the only person in the project in the movie.",
        "I mean, he was head of Los Alamos ofc he'll get credit just like Bin Laden is credited for 911 or Hitler for the holocaust.   \n\n\nLos Alamos was created because of Oppenheimer, at a location chosen by Oppenheimer. Oppenheimer also organized Los Alamos and chose the people in charge. I really don't think it's unfair to credit its creation to him because it probably wouldn't have happened the way it did, and as fast as it did without him.",
        "Yeah I read somewhere over 125k people worked in some shape or form to invent the bomb",
        "They need a trademark to sell",
        "humans grasping 1 point easy.  humans grasping 1000's of points hard.",
        "This is how things work in reality. The leader will get all fames. Same goes to the president of the country, monarch of the kingdom and CEO of the company.",
        "just like covid vaccine efforts. took 30,000 humans across the globe to crack the virus in less than 3 years time and produce a statistically safe solution to it. \n\nbut dorks online think it’s some 10 evil dudes in the a back room plotting against entire cultures and countries lol",
        "No one is going to memorize 1000 people who worked on a project so our options are 1 or 0. 1 is better than nothing",
        "The movie makes this exact point multiple times, lol. He's called the \"Father of the Atomic Bomb\", but it's really just marketing and a testament to how human beings prefer simple stories; in reality, many of the ideas that made the bomb work were contributed by other people, it was very clearly a massive group effort, etc, etc.",
        "Yep, that’s why the implosion design was the biggest factor that could ruin the test. I believe they didn’t use that design for the actual bombs over Japan, but correct me if I’m wrong.",
        "Let's not forget the seemingly impossible task of  enrichment. Separating atoms that are the same element and only differ by the weight of a few neutrons is still incredibly difficult today. The Manhattan project was as incredible as it was horrible.",
        "The slide rule comment is completely disingenuous. They had cutting edge computers running calculations using punch cards. There was an entire computing division that worked with IBM and was under direction of Feynman. The Manhattan Project was the first successful big-science venture and paved the way for modern mega-projects in science. At the core of these projects are cutting edge super computers and teams of the best scientists to run them.",
        "WWII was the single greatest leap in technology in human history.",
        "That’s not the hardest thing. By far the hardest thing was enriching the uranium. You don’t need an implosion to make a nuclear bomb, the Hiroshima bomb wasn’t an implosion.",
        "Scott Manley on YouTube recently did a video on this exact thing. \nWell worth the watch.",
        "that's literally how all technology is developed. it's called a prototype. slide rulers weren't an impediment but were necessary to remove an element of human error",
        "Multi Pass.",
        "Bada Bing Bada Boom",
        "Yeah, big bada boom",
        "Bada boom bada bing nukes are my thing",
        "Everything leading upto to the explosion was brilliant , but yeah the explosion could've been a bit bigger",
        "Nolan's aversion to CGI is baffling sometimes. It would have worked better here, and in Dunkirk. There were tens of thousands of men on the beaches, but they obviously couldn't get that many extras for the film, so it looks more like a few hundred men waiting.",
        "https://youtu.be/i9xQTJ-kbUk",
        "I was going into the movie fully expecting Christopher Nolan using a MOAB. If anyone could get it done it’s him. Yea the fireball was a little underwhelming",
        "yea I was shocked at how underwhelming it was, it looked like a generic barrels-full-of-gasoline hollywood explosion, just filmed in slow-mo and zoomed in to make it seem larger.",
        "Pyrotechnics in Nolan movies have always looked like a wet fart.   \nI dont know why they couldnt have just stacked 100kg of TNT on top of 500 gallons of gasoline and just filmed that instead of the elaborate flamethrower bullshit they were doing for this movie.\n\nhttps://www.youtube.com/shorts/n3NMS3WaujE",
        "In the time after the tests, the infant death rate in surrounding communities doubled, so while no deaths are directly attributed,many became ill and died as a direct result, soon after or years later.",
        "you should google 'atomic veteran' that should answer all of your questions.  \neven after they knew what to expect they did a bunh of really bad stuff.  \nAlso keep in mind that is only the actual veterans and there were way more people involved from civilian personell to people just living near the test site.  \n\n\nIt was just conveniently ignored for a long time since taking responsibility would mean having to pay all those medical bills and quite a bit more.",
        "My uncle did data collection at nuke tests.  He died of \"unrelated\" cancer 20 years later.",
        "There's a whole group of states called \"downwinders\".  There was a compensation bill passed in 1990 to pay compensation to these folk.",
        "I was wondering this when watching the movie. I kept waiting for the driver of the car who denied eye protection to go blind after.",
        "Blindness varies greatly. In many cases it's quite normal to be able to see light.",
        "I imagine it would be the same as you having your eyes closed but having someone take a picture with a flash a few inches away?",
        "I’m an optometry student. As another comment said, there are varying degrees of blindness. However, even if she was completely blind, the technical term being “no light perception” for any number of reasons, she still may have been able to see flashes. Some forms of ionizing radiation are strong enough to penetrate flesh and trigger a photoreceptor, causing a flash of light to be observed. Astronauts on the ISS (also exposed to more direct high energy radiation) have reported perceiving flashes even while their eyelids are closed.\n\nIn some visual diseases causing blindness, young kids may even rub their eyes really hard because small flashes may be given off by this action and it satisfies an almost primal desire of the brain for some sort of visual input. They have to be dissuaded from doing this, as it can cause other problems on the front of their eyes. \n\nIn any case, hard to know exactly what this girl saw, but interesting to speculate nonetheless.",
        "Soldiers near the blast site who covered their eyes with their hands got X ray vision for a brief moment - they could see the bones in their hands from the brilliant flash of light",
        "You will probably find [this](https://www.reddit.com/r/Damnthatsinteresting/comments/11ejlny/glasses_representing_different_types_of_blindness/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=1) interesting.",
        "The eyes may not work properly but the nerve receptors behind the eyes can still work.\n\nA strong enough source of radiation (say, from a nuke) can penetrate the head and activate the receptors even if no light is getting to the eyes.\n\nAstronauts actually are able to see random flashes with their eyes closed because of cosmic radiation bursts hitting them. \n\nI'm betting this is what happened to her.",
        "Crazy buildup and then the explosion looks like a gasoline fire like 50m away from them😂 It was really anticlimatic",
        "I do wonder if that's real or just a kooky 50s exaggeration",
        "Good explanation here: https://www.reddit.com/r/BeAmazed/comments/15dr933/real_footage_of_robert_oppenheimer_testing_the/ju41b7v/",
        "r/paredolia",
        "[An hour ago](https://www.reddit.com/r/BeAmazed/comments/15dr933/real_footage_of_robert_oppenheimer_testing_the/ju3vyc7?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2)",
        "Einstein's face",
        "Barbie was introduced in 1959, but Mattel was founded in January 1945",
        "Is this the one where they took note of where everyone was standing during the event, so they'd know who received a fatal dose and who didn't?",
        "That just might be the worst thing humanity has ever created",
        "That’s not exactly how classified stuff works.  If you’re testing a highly classified new type of weapon, you’re going to film it.   They still do it to this day.",
        "You're not alone. There's a pretty fair consensus that whilst it was a great movie, the explosion was rather subpar.\n\nIm not sure Nolans dedication to authenticity has paid off here.",
        "Nope, I 100% agree with you. All that build up for a tiny fireball made no sense to me either.",
        "destroyer of worlds",
        "I would suggest Ricard Rhodes’ “The making of the atomic bomb”. It’s a substantial, detailed book, but very readable as far as historical books go.",
        "They already have we’re just waiting it out now",
        "Bunch of boomers figuring out new ways to kill each other, entire countries and the planet.  When we just want to chill and have a beer in the  sunshine. The amount of tech, effort and time put into ending lives is sickening.",
        "Ego",
        "I believe this is Westbrook Van Voorhis, who incidentally originally narrated the pilot episode of the twilight zone before being replaced by Sterling.",
        "I don't care what the actual lyrics or anyone says. He's saying revved up like a douche.",
        "Once the knowledge of atom bombs was available, evil people would push for its development no matter what. MAD was the only way to avoid nuclear conflict",
        "Also check out movie “Trinity and beyond” basically a compilation of tons of WMD tests in chronological order",
        "nice catch. i saw it  too",
        "The guy's face at 1:14 says it all.\n\nEveryone was having a good time setting it up, thinking it would be an incredible explosion, maybe like fireworks or something.\n\nOnce it was detonated the look of sheer horror on their face shows he realized the grave mistake that humanity just made.",
        "[removed]",
        "How crazy is it that we can get within a couple orders of magnitude of a nuclear explosion completely on accident with just a bunch of improperly stored chemicals",
        "Yep.. That part where the narrator says: 'a girl, blind from birth, reported seeing the flash'.. Just puts it into perspective IMHO.",
        "The nukes of old are simply sub components of the thermonuclear hydrogen bombs we now use.\n\nEdit: grammar and wording",
        "The USSR had hydrogen bombs 4000 times as powerful as this one. It’s mind boggling.",
        "It plays as a video with sound for me, that's weird.",
        "Here's some better footage in different angles that helps put it into perspective for those who are curious:\n\nhttps://www.reddit.com/r/Damnthatsinteresting/comments/13o1l5q/footage_of_the_explosion_in_beirut_in_2020_from/",
        "They hyped it up so much in the marketing then I saw it in theaters I was like that's it?",
        "Because they scientists were aware of the theoritical effect that explosion would be.",
        "Sky Gandhi judges you.",
        "I think it’s because of the E = mc2 we all learned as kids. Kind of explains how (any but here specifically nuclear) matter can be converted into energy.\n\nBut Einstein’s biggest (admittedly indirect) contribution was from the letter he wrote to FDR. Three Hungarian physicists (Leo Szilard, Eugene Wigner and Edward Teller [future father of the H bomb]) came to Einstein, since he was such a famous and respected scientist, and told him of what they had learned about Germany’s interest in experiments into nuclear fission. Szilard and Einstein crafted the letter to FDR, although the Manhattan project didn’t commence until a couple of years later. \n\nIncidentally, another piece of trivia is that Richard Feynman claimed he was the only person to directly view this first test. He was some distance away and figured it would be the UV radiation that would blind you, so he sat inside a truck and viewed the blast through the UV-blocking windshield.",
        ">I grew up thinking he spearheaded The Manhattan Project when in reality wanted nothing to do with it.\n\nWhich, thankfully, ended up being a major point of the film, that Oppenhemier didn't want to be viewed as Einstein, redundant after his life's major discovery, so he used his status to sway political decisions as best he could (as Einstein & Bohr did in their public letter to FDR, something Bohr encouraged him to do) and thereby making the enemies that eventually ended his career.",
        "I haven’t watched the movie yet, so not sure what you are concluding. But I’d think Einstein has everything to do with it- as much as Newton has to do with the Apollo 11 mission. \n\nEinstein wasn’t a part of the Manhattan project, I thought that was a common knowledge, but I can understand how some might have thought he was. He is credited with the famous mass to energy conversion ratio e=mc2. This doesn’t tell one how to convert it, but it says it’s possible. You can get intensive amount of energy through a small mass- which is what happens in a nuclear fission, I.e. atomic explosion. Without that fundamental understanding we wouldn’t work toward making atom bomb or nuclear power plant.",
        "Nope. He basically wrote a letter to the president to get the ball rolling (on request from the other physicists).",
        "Got a light?",
        "I actually see him twice. \n\nThe first time is what you captured. The second time is right at frame: 04:03:10:11. Look at the bottom right corner, his face sideways can be seen.",
        "Oppenheimer, remember this. Everything the bomb touches is your kingdom.",
        "Right. I just was specifically alluding to the black and white Oppie shots, since this post tried to pass it off as being actual footage of him from Trinity.",
        "WHAT",
        "Ya but could it make a def man hear again, the real footage made a blind girl see again.",
        "It was too much, i watched in a cinema and had heart palpitations.",
        "Notice that the cheering screaming and stomping in the following scene is actually louder and more violent than the bomb exploding.",
        "No, it's because Nolan likes to do things practical as much as he can. Usually, that's cool but in this case the result is a somewhat underwhelming effect.",
        "You'd be surprised with the weird artistic choices Nolan makes.\n\nIt was absolutely trying to \"glorify\" (at least in the way that makes you scared) the bomb, he just insisted on practical effects which made the explosion look terrible. The closeups of what looks like typical hollywood fireballs didn't make it better.\n\nMeanwhile David Lynch in Twin Peaks: https://www.youtube.com/watch?v=vYg8nos8SdA",
        "yeah, sure. it just made the scene laughable. there was a scene where they show an angle of them on the ground with the bomb in the background, it didnt even look that far and it was small af.",
        "They should have zoomed out instead of getting such a close up shot",
        "[deleted]",
        "imax was biggest waste of money for oppenheimer. what a fucking let down.",
        "> I think you are missing the point a bit\n\nThat's kind of contrary to Christopher Nolan's own marketing. He's been hyping up the use of practical effects for the Trinity explosion for months. No doubt people are going to be disappointed once they actually see it...especially since the director of the movie made it out like it was going to be spectacular and threatening.",
        "Makes sense. Same as a developing the combustion engine. The math looks really cool but until it starts up, the scale is entirely unknown. I don't think the makers of the engine knew it would run so quickly at first.",
        "The neutrons don’t burst open nor release energy 🫤. Uranium is split into smaller atoms through the process of fission, which is triggered by neutron bombardment due to uraniums unstable nature (because its atom is so large). Then the split uranium atom releases more neutrons causing surrounding atoms to split as well, causing a chain reaction, as explained in the movie.",
        "It was so fucking loud",
        "the amount of denial and deflection that try to downplay it, and the loops and convoluted explanations to explain why it was small from the nolan fanboys is hilariously bad, they all use the same argument",
        "It wasnt so much the explosion for me. It was the 5minute of seeing every. single. persons reaction before i got the big boom\n\nNolan ruined my eargasm",
        "I think he also made the not using CGI mistake on Dunkirk leaving the beaches looking like they way less people than were really there.",
        "Sad to agree on this one. It's fair to say he subdued the explosion itself because he didn't want it \"celebrated\"... I think better would be an explosion beyond all levels of fucked. A flash so bright and explosion so loud you feel like your eyes and ears are ringing. The imagery chosen could have been the mostly ghostly horrific shit you can imagine - literal blue/purple skeletons walking against a white sky and earth as people scream in shock and horror at what's going on. show the burning of surface flesh from the sheer heat of the photons alone. One thing I noticed is how it's still very much \"night\" when the bomb goes off. That shit should have been brighter than the brightest day imaginable. So much more could have been done to really hit home how horrific this is. Dreams of the V2 rockets raining hell on the world would've been justified, and timely. Images of hydrogen bombs nuking moscow, times square, berlin, london... everywhere. The destruction imagery potential is immense.\n\nIt;s 90 seconds to midnight. We need to know what midnight looks like or we are fucked and doomed to reach that timeline.",
        "Outside of the first microsecond of the explosion, they honestly do look quite similar: https://youtu.be/18ZFUCOT8Xc (colorized video) \n\nI feel like people are used to the [massive massive explosions that were held over water.](https://youtu.be/T2I66dHbSRA) This was a “small” bomb on land.",
        "> can’t believe more people aren’t saying this\n\nIt's literally the number one complaint and probably the most common comment I've seen of any kind about the movie.",
        "I really wanted to see Oppenheimer's mental walkthrough of the detonation. The processes of the warhead going off. Give the audience *anything*.",
        "It was the biggest let down of the movie. I wanted something technical and that showed the fundamental force being harnessed. It was even more of a letdown because the film had indicated already that it had a visual language to express particle  physics- I loved the way Nolan used wave imagery",
        "Yeah I feel like this is being a contrarian for no reason. This is impressive but in the movie, it was jaw dropping with all the buildup and the way the sound was used.",
        "Personally I think its important to show the audience what *exactly* he created and how enormous and destructive it was compared to anything else ever made at the time. That sort of thing needs to be drilled into the average movie goers head imo to understand why he was horrified.",
        "Saved you a few bucks. There's *barely* an explosion. The whole film is shot like it's this epic adventure a la Dark Knight or Inception but it's just people talking. Talking here. Talking there. Sometimes we hear the whole conversation, sometimes there's so much ambient noise you give up and try to appreciate all the visuals that aren't there.\n\nSuch a weird movie. If it was shot differently I think I'd like it more.",
        "Ford created the assembly line. \n\nEli Whitney - cotton gin\n\nEdison - light bulb\n\nAl Gore - Internet /s\n\n\nYeah, we do that.",
        "I don't agree. Academia has already moved away from \"Great Man history.\" We're beginning to change how we teach history to move away from single individuals.",
        "Maybe you do. Maybe you can't change.",
        "absolutely not, people are absolutely capable of understanding these things, you just pulled this \"it'll never change it's human nature\" out of your hat with 0 proof",
        "the message in the movie was pretty clear, Oppenheimer was a genius at managing the different personalities and putting together a team that could accomplish the goal of a nuclear bomb faster than the Germans.\n\nAnyone who thinks he “got all the credit” should pay better attention",
        "The Hiroshima bomb was a gun-type bomb using Uranium. The Nagasaki bomb was an implosion bomb using Plutonium.",
        "The second bomb dropped over Japan was Fat Man, which was a plutonium bomb with physics identical to Gadget, which was the test bomb. [Fat Man Wiki](https://en.wikipedia.org/wiki/Fat_Man)",
        "Quite true.  Still a challenging process.",
        "I think it was more a problem of things like detonation cord not burning at the exact same rate. The calculations weren’t that complicated it was more about trying to get timings correct when things just weren’t manufactured to the same specifications.",
        "Hard disagree, I would say the Cold War was way more.",
        "By what metric?",
        "Lilu Dallas",
        "I legit just got my gf to watch that movie over the weekend for the first time, such a awesome film",
        "I AM Corbin Dallas",
        "Nolan should have just used a real nuke smh.",
        "Think they focused on the wall of fire part of it in the film.",
        "You beat me to it. Great collection. Was supposed to be an anti-nuke documentary, but once the editing was underway the producer saw no reason to even say a word.",
        "I was so disappointed with it as well, the fireball itself looked like a gasoline explosion, the shockwave looked like a fart instead of it lifting and pushing dust everywhere.\n\nAnd there are other details that could have been added, like a witness said he had his hands covering his eyes and when it exploded, and he could see his hand bones and other peoples skeletons because of the x rays.\n\nNolan stubbornness I’m not using CGI really hurt the movie this time around",
        "Can anyone qualify this a bit more?\n\nLike, how big a radius around the test are we talking about where the infant mortality rate doubled (was it like a few miles, or the whole state), when you say 'doubled', what did it double *from*, etc.\n\nSorry, just hard to get an idea of the scale of the fallout from your comment.",
        "Yeah this isn't remotely proven.  \n  \n[You can look at infant mortality rates here for the time the test happened.](https://thebulletin.org/wp-content/uploads/2019/07/Figure-2-alvarez.png.webp)",
        "That is such a big lie",
        "Considering 1/5 of people die of cancer, it is extremely possible it was unrelated.",
        "aka legally blind, making the anecdote completely irrelevant",
        "He says blind from birth. \n\nBlind from birth means nothing. Not darkness like closing your eyes, but nothing at all. \n\nMaybe she was \"legally blind\" which is a whole other thing.",
        "yep blindness is the same as closing your eyelids. and polio is like when you wake up and your foot's asleep",
        "During a CT scan of my brain I saw violet light.  Obviously you can't see X-rays, it was the phenomenon you're describing.",
        "Yea that was pretty good, thanks!",
        "Super disappointing. Especially given a lot of the marketing materials, adverts, hell even in the first 10mins of the movie used scenes that imply an explosion of immense magnitude albeit in slow motion.... And then we arrive at the trinity test. I was honestly convinced with 45mins yet to go we would be seeing Hiroshima or Nagasaki, and then nothing. \n\nIf it wasnt for the incredible soundtrack and soundfx I'd be really questioning why the fuck Nolan made such a song and dance about seeing this in IMAX.",
        "Ngl I kinda feel this way, the cinematography of the scene was great but this is one time that CGI would’ve likely enhanced the scene greatly",
        "If you don't believe my lie is true, just ask the blind man, he saw it too.",
        "![gif](giphy|OYjrA155y3lv2)",
        "This is a [chilling scene](https://www.youtube.com/watch?v=AQ0P7R9CfCY) in the movie [Fat Man and Little Boy](https://www.imdb.com/title/tt0097336/?ref_=nm_flmg_t_200_act) (1989) wherein this is shown.",
        "That’s correct! That’s was with Louis Slotin’s case",
        "To play devil’s advocate, the presence of nukes has pretty much all but guaranteed another conflict like WWII cannot happen. Conventional warfare is effectively impossible due to the threat of MAD. \n\nFor a continent like Europe, which saw WWII, WWI, the Franco-Prussian War, the Crimean War, the Napoleonic Wars, the 7 Years War, the 30 Years War, and so on…. Nukes have brought an unprecedented level of peace.",
        "Yes. It's just that the film is classified.",
        "It wasn’t dedication to authenticity. It in no way looks remotely like the real bomb, like the footage of it. That’s not authentic imo. It’s dedication to practical effects to a fault. CGI is a tool and shouldn’t be a crutch, but exists to augment and supplement the limits of real life. And short of using a real nuke, nothing will look like one. Cause it’s a fucking *nuke*.",
        "Technically it would have been the boomers parents.  (The Greatest Generation)",
        "Most boomers weren’t even born yet, wtf you talking about.",
        "Oh they wanted to chill and have beer's but someone had to drag the whole world Into a war, so they fucked around and found out.",
        "They don’t call em boomers for nothin",
        "\"Now we are all sons of bitches.\"",
        "I almost died that day. I still suffer from insomnia. Couldnt sleep for a fee days after saving my sister and aunt from under furniture. Still have difficulty sleeping. 3 year remembarance is in 5 days. August 4 2020. The day my government killed my people",
        "The scientists knew exactly what power they were playing with. They even thought there was a possibility of igniting the air and triggering a self-sustaining fusion reaction destroying the entire earth.",
        "It wasn't a mistake. Someone was going to discover it at some point, and it is currently the reason that there have been no more world wars and we have lived in relative peace the last 80 years.\n\nAlso, that footage is from a 1946 movie where he re-enacts what happened. So the reaction you see is essentially fake.",
        "Was it a mistake though?  The bombs are dangerous, but they also bought us a long peace, which looks pretty good to people who lived through 1914-45.",
        "Yeah I was expecting something far more awe inspiring like this footage makes me feel. I was rather disappointed by the movie version.",
        "So- most of the footage we’re used to seeing from atomic bombs are from blast MUCH bigger than the trinity explosion depicted in Oppenheimer. \n\nTrinity was like 25kilotons while other famous atomic bombs we’ve seen like tsar bomba was 58 MEGAtons. \n\nSo trinity was a pretty small explosion by comparison. Even if you look at the wiki page, it has a cool gif of it, and you can see it’s a pretty quick puff\n\nhttps://en.m.wikipedia.org/wiki/Trinity_(nuclear_test)\n\nCompared to tsar bomba\n\nhttps://m.youtube.com/watch?v=YtCTzbh4mNQ",
        "[deleted]",
        "Having the explosion larger would have had a load of people saying \"wow, cool\" in awe. Which is the last thing Oppenheimer saw it as. Nolan was trying to balance the horror and awe.\n\nThe detonation would have become the main character, not the man who was in charge of the bomb programme and his moral torment about it. Oppenheimer saw a baby explosion relative to the ones used on Japan, so this is through his eyes. \n\nWe all know what it actually looks like or no one here would be complaining at the explosion being too small.\n\nEdit: Did anyone else leave the cinema feeling emotional? Not at the rights and wrongs of it all, but just because it was A LOT?",
        "There is one specific video from the Beirut explosion that shows the air pressure clouds form around the explosion that is both beautiful and mind blowingly scary once all the aspects of it sinks in.",
        "forgive my ignorance but that doesn’t make sense to me. The nukes of TODAY are subcomponents of the h bombs WE NOW USE",
        "Oh they still have it.",
        "Note that the size of the fireball (and the destructive effect) doesn't scale linearly with the yeild.\n\nModern warheads are not the 20x (typical modern nuke is something around 200kt) more destructive they appear looking at the numbers (in terms of surface area destroyed for example).",
        "Not ghandi. Please no",
        "I like how, post war, Feynman became interested in art and instead of going to an art school to do Life drawing would go to strip clubs and draw the performers.\n\nSource: his autobiography \"Surely You're Joking, Mr. Feynman!\"",
        "> Incidentally, another piece of trivia is that Richard Feynman claimed he was the only person to directly view this first test. He was some distance away and figured it would be the UV radiation that would blind you, so he sat inside a truck and viewed the blast through the UV-blocking windshield.\n\nI was so happy they put this in the movie. Also, Feynman playing bongos during the Christmas party.",
        "I meant it in the pure literal sense, which (forgive me I never looked too far into the project before the movie) I had seen his name constantly paired with the project.  To me, he shouldn't be paired with it at all, as much as Newton is never paired with the Apollo 11 mission.  In fact I'm pretty sure Einstein would have preferred not to be.",
        "I also thought Einstein was part of the Manhattan project before watching the movie. I think that’s what this commenter had thought too.",
        "THE AUDIO FROM THE MOVIE WAS CRAZY GOOD",
        "It also shows visions of people throwing up from radiation poisoning and mourning their dead relatives, I'm not sure that was meant to portray glorious success alone.",
        "And they use that audio to highlight his anxiety. The man has flashbacks to the moment after the bomb and everyone celebrating it",
        "I liked the close up because throughout the film they'd emphasised the science behind it and the potential chain reaction. By showing it close up you're literally seeing the explosion spreading",
        "They should have just used tons of TNT if they wanted practical effect, but they used what? 500kg?? It was so underwhelming, the sound and acting had to carry that scene since the explosion looked like it failed.\n\nI've seen poor opium farmers create bigger explosions that make you feel *awe*, if you know what I mean.",
        "If I'm not mistaken DNEG was involved in the Chernobyl series, too, and they definitely figured out how to make a nuclear incident look absolutely breathtaking.",
        "Cant comment on marketing material, im analysing the movie not the ads. But sure i guess.",
        "I was thinking of atom, its late. You are 100% correct however that is kinda besides the point.",
        "[deleted]",
        "Well for one, that massive explosive is a second generation nuclear device. Thermonuclear bombs are on a completely different scale than the atomic bombs used in WW2.",
        "eh not really, the /r/movies thread had like 1 comment chain and thats it",
        "Al Gore was certainly instrumental in the internet becoming more widely used. As senator in the 80's and 90's, he promoted legislation that funded an expansion of the ARPANET, allowing greater public access, and helping to develop the Internet.",
        "All this nonsense started with that confounded 'gin. Whitney is the real man responsible for the bomb.",
        "Didn't Eli Whitney steal the cotton gin from one his slaves?",
        "Erm didn't Tim Berners-Lee have something to do with the Internet?",
        "Yeah, teaching of history in the 80s/90s when I was at school, very much emphasized that it is seldom one person who impacts history alone. We don't live in a movie with a simple plot. People and events are complicated and messy, as are concepts of right and wrong. \n\nThat was in the UK, though, so I can't speak for how things have been taught in the US.",
        "I'd like to personally thank Mr. et al for all their contributions to every paper I've read. Singe-handedly being behind so much research.",
        "Noble prizes are still only awarded to 3 people though.",
        "Wouldn't be a cold war without wwii",
        "Anyway, we’re in love",
        "![gif](giphy|xUPGclrAkkzaJS7vJm)",
        "Multipass",
        "Jared Leto coulda acted his ass off as the bomb!!",
        "It definitely leans anti-nuke.  There's a lot of satire mixed in there. [Tommy the Turtle](https://youtu.be/LWH4tWkZpPU) comes to mind.",
        "I’ve been to the trinity test site, and what needs to be understood is how remote it is. It’s in the middle of this big valley that is probably 50 mi by 100 mi wide. It’s just a vast flat expanse of pretty much nothing for dozens of miles in every direction. It said the spectators watched from the hills… so we are talking dozens of miles away. I don’t think they were anywhere close enough to get radiation directly. And when they went to inspect the site after a couple of months they were aware that the fallout was on the ground and tried to minimize spreading it around.",
        "the part about the blind girl seeing the light of a thousand suns is true though",
        "hmm data from 1948, they couldn't possibly have any motivation to cover up the actual mortality rate, right?. [https://thebulletin.org/2019/07/trinity-the-most-significant-hazard-of-the-entire-manhattan-project/](https://thebulletin.org/2019/07/trinity-the-most-significant-hazard-of-the-entire-manhattan-project/)\n\n&#x200B;\n\nlook into the Tularosa Basin Downwinders Consortium",
        "Look into the Tularosa Basin and Alamogordo downwinders. There is truth to what he says and a quick visit to the National Museum Nuclear History in Albuquerque, NM will have a great sections about the studies and impacts. (ABQ native and have been to the museum many times).\n\nI can’t speak to exact numbers but the Trinity test absolutely had an effect on rural New Mexico and was systematically covered up and downplayed in the years following the test.",
        "In the 1960s for data collection, the US army put soldiers in a ship, told them to cover their eyes with their hands, and then detonated a nuke in front of them. The soldiers reported seeing an x-ray of their hands during the test. They were horrified by what they saw and the majority went on to develop cancer. Read more here: https://www.theguardian.com/world/2020/oct/11/poisoning-the-pacific-new-book-details-us-military-contamination-of-islands-and-ocean. It is extremely possible it was related.",
        ">blind from birth means nothing \n\nPeople who have extremely limited vision from birth can also fall into the “blind from birth” category. Some of them can sense light.",
        "Interesting. I’ve never heard of that one before so that’s really cool!",
        "The movie is from Oppenheimers perspective, he didn't witness the actual bombings so neither do we.",
        "Exactly this. The footage they used for the Trinity Test was so tiny I thought they were saving the real explosion footage for Nagasaki or Hiroshima, but nope. Just a huge build up to a tiny gasoline fire with some shots of camera zoomed in. \n\nThe movie was excellent but I don’t agree with this decision to downplay the explosion, I feel like it diminished the terrifying power of the atomic bomb, and was a missed opportunity to portray the moral dilemma the scientists all found themselves in. \n\nStill 9.5/10, but it was 10 seconds of CGI away from a 10/10 for me.",
        "Well this is disappointing.",
        "It was such a famous test that even the deaf have heard of it.",
        "I can't believe I've never seen that! That was harrowing, the build-up to the screwdriver slipping was so tense. I think I'd off myself during the latent phase if I was in Slotin's position; I'd have time to get my affairs in order, but I wouldn't be prolonging my suffering  given an inevitable death. Obviously the effects of ARS were not as well-known back then, so Slotin did a solid for cowards like me even on his deathbed.",
        "They probably named themselves that and have been patting themselves on the back ever since.",
        "Boomers are just one of reddit's favorite Boogeymen",
        "For I have become Spez, destroyer of worlds",
        "I can't stop laughing at LazyPurple's [mangled attempt to make Soldier from TF2 say that line](https://youtu.be/xlyyu1Go4yU?t=177) every time I see that quote now.",
        "I hope you, your family and your city will eventually recover. Such a shocking tragedy, seeing all the different cameras filming and not knowing who survived, who was injured...",
        "Glad you're still here. Please get therapy if you haven't. It can really help. And go back if you start having trouble again.",
        "They ran the calculations and found that there was NO possibility that the bomb would ignite the atmosphere. This wasn’t something they left to chance. But Enrico Fermi took bets on whether the Trinity test would ignite the atmosphere as a kind of joke that people not in-the-know at the time took out of context.",
        "I know we aren’t in a WORLD war but you can’t say there is not war happening all over the world",
        "Guess that depends on if your family is the one being blown up \"for the greater good.\" Easy to say it was necessary from the side doing the bombing.",
        "It depends on whether or not they'll use them again in the future. If they do, then it was a huge mistake. If not, then all is good.",
        "Watched it last night.  Very good movie.  The story carried itself well, and got home to read up and learn more.  It's one of those movies that keeps revealing things in your head long after you've watched it.  I actually thought about the explosion in the film and thought that: we all know what to expect, and the director almost downplayed it or make it far more artistic (there were zooms into different particles of the explosion).  The movie blended the physics of it all with art throughout.  The political intrigue was next level stuff.  Oppenheimer comes off complicated, flawed, brilliant.",
        "It's because you're conditioned and desensitized to it. We grew up seeing SFX in movies with explosions, etc. Whereas for their generation it's a miracle they managed to film with colour.",
        "That's all down to the fact he didn't use CGI and used real explosions for the film.  I get the desire for not using CGI, but sometimes it just isn't the right move.  Same as not using CGI crowds on the beaches in Dunkirk.",
        "Was hoping for something that overtook terminator 2, but didn’t get it. Loved the movie but the blast was a let down.",
        "https://youtu.be/QaFb572jyvQ",
        "It looks almost the same as in the movie. I don't know why people are criticizing it.",
        "I think that’s cuz the atomic bomb, like Trinity, is a lot smaller than we’re “used to” seeing. Tsar bomba was an H-bomb, not an atomic bomb - but that’s definitely the type of explosion we see depicted more often in terms of nuclear warfare!",
        "I dunno... I get what you're saying but I feel like it just didn't convey the sheer power of an atomic bomb. Like it was a big explosion but didn't seem to inspire the sense of awe I've felt when watching footage of other explosions.  I think there's a way to show it and convey that immense release of energy without necessarily portraying it as like a Michael bay level explosion or something where the only goal is for it to be cool.  (Though I do agree with the people here talking about how the first nuclear bomb was much smaller than some of the subsequent tests so embellishing it wouldn't be right either",
        "Exactly. It was just like the autobiography, which was its intent.",
        "I didn't actually get too emotional until the very last scene where we finally hear the conversation between Einstein and Oppenheimer, then all of it kind of hit me. I thought that was very well done.",
        "why is there so much denial about the measly movie bomb representation, its all the same deflection and comments about it \"well, actually the movie is just oppenheimer no bomb\" they literally marketed it with the climax being the bomb, the bomb is on the fucken poster. why are you nolan fanboys so in denial? \"is small cuz not about nuke\" seriously this is such an overused deflection. Maybe they should've made the movie about the remainder of oppenheimers life after the bomb and start the movie there with no bomb, but its literally about him and the bomb, that is the climax. my goodness the deflection",
        "Yeah. In order to start a fusion reaction, you need a lot of energy. Once the reaction starts, it's self sustaining until it uses all available fuel. The best way to start a fusion reaction is a fission reaction. So use a nuke to start an H bomb.",
        "In a nuclear warhead there’s a core of uranium or plutonium.  The fission core then fuses the radioactive hydrogen isotope component to boost the detonation.  \n\nhttps://en-academic.com/dic.nsf/enwiki/11552119\n\nThe round ball part is how atomic weapons used to be.  They didn’t have the secondary fusion fuel.   That ball is similar to what was in the Fat Man type device",
        "A modern nuclear bomb of the type mounted to ballistic missiles is actually 2 bombs.\n\nThe first bomb that goes off is a conventional fission nuke like this first one. The energy from that is used to superheat and crush a canister of other stuff, which starts a fusion reaction that is immensely more powerful than any fission nuke alone.\n\nSo basically we use this bomb in the video here to jumpstart an even bigger one.",
        "Unlikely, those were hilariously inefficient.  \n\nEveryone moved to having more, smaller nukes for a reason.  \n\nWith a bomb like the Tsar Bomba, you spent a shit ton of money on each one, had to severely limit your delivery options due to the size and weight of the thing, and you didn't even get much more out of it since most of the destructive energy just went up and away rather than into the target.  \n\nYou get way more destruction with multiple smaller bombs than you could ever dream of getting out of one big bomb.",
        "[deleted]",
        "maybe on paper, local security officer has long since sold all the material for scraps",
        "TBH: it looked more like Psyduck to me",
        "Our words are backed with **NUCLEAR WEAPONS**!",
        "One of the best books I've ever read.",
        "[I like how he played the bongos and sang about orange juice ](https://youtu.be/HKTSaezB4p8)",
        "Newton was a few centuries removed from the moon landing. The time between Einstein's mass conversion formula and the atomic bomb is a mere couple of decades. Einstein lived to see the bomb created and knew his role in its development, as much as I'm sure he hated it.",
        "You have a misconception that there’s a common belief Einstein was involved in the Manhattan project",
        "#What?!",
        "If you can’t do it proud, do it loud\n\n-my mother",
        "The blow from the floozy was crazy good?",
        "I COULDN'T HEAR THE AUDIO AFTER THIS FUCKING SCENE SO I CAN'T COMPARE IT TO ANYTHING ANYMORE",
        "was it radiation poisoning?  \nJust came back from the movie, and (as i saw it at least) i thought we saw the general wild celebration, and then those that finally got hit by the dreadfull impact their creation had brought to the world!",
        "Lol, they’re not throwing up from radiation poisoning, you completely missed the point of that scene.  They’re throwing up from the guilt of what their bomb has unleashed, and from Oppenheimer’s speech where he said he wished they’d developed it early enough to use on the Germans.",
        "That whole scene was strongly designed to show Oppenheimer feeling sick and extremely guilty about what their \"accomplishment\" had wrought on the world. There was no ambiguity about it.",
        "Ummm no there was a scene of a man being sick but it's heavily implied it's due to the guilt of dropping the bomb not radiation sickness.",
        "Exactly. From a certain perspective the test bomb exploding was a single moment in time and miles away. In reality the chain reaction it set in motion was much more substantial. \n\nOn one hand, I truly wanted the explosion to knock me on my ass. On the other, I can understand why restraint, contrast, and subjectivity is important in a film like this.",
        "We've also seen countless real and cgi'd bombs, but not many of the 'inner workings' so to speak. I thought it was unique, and cool.",
        "I get what you mean, but these are things Nolan has literally said in interviews!",
        "I do agree with your point completely. It would just be stronger if the reasoning behind it was also accurate. And to add on to your point, it was about his viewpoint but also the politics and psychology involved throughout his life. In a biographical context.",
        "Good use of practical effects: cutting a real plane in half during the dark knight rises, having real planes flying in Dunkirk.\n\nBad use of practical effects: a nuke that looks like a jerry can exploded.",
        "Yes. \n\nI was an IP technician for many years, I am well aware of his role in making the Internet more possible for the common person…but his direct words were \n\n\"During my service in the U.S. Congress, I took the initiative in creating the Internet.\"",
        "That's not even remotely responsibility for the success of anything... not even remotely.\n\nThat's like saying that the CEO of a fund that funds a research project to fight HIV is then \"instrumental\" for when the project happened to be successful.\n\nNo not even that, because then there is at least a piece of the cake. \n\nIt's a senator who promoted a thing instead of another thing...",
        "Nor is Edison the sole inventor of the lightbulb.",
        "Corbin... Corbinmyman",
        "LeeLoo Dallas Multipass",
        "They received a dose of gamma rays which would have arrived simultaneously with the visible light and the neutron flux was probably there about the same time.\n\nThey were probably upwind so they wouldn't have had to deal with radioactive fallout but they would have absolutely received forms of radiation.\n\nPeople downwind would have been exposed to fallout as it is an incredibly fine dust so it would have traveled for hundreds of miles (obviously getting less dense with distance).",
        "No where does your link suggest the majority went on to develop cancer.   \n  \nAnd the majority of people who radiation sickness, do not develop cancer as a result of it. Cancer rates are obviously increased when exposed to ionizing radiation, but not nearly as severely as people in this thread are falsely claiming.",
        "Yup and in 50 years the kids will scream about all the bad stuff you did.  Just remember, you killed the World with your pre-packaged meals, 3 bottled waters everyday and new cell phone every year.",
        "I have become meth, destroyer of the world's - Heisenberg",
        "It did make one of the most chilling realization quotes of all time absolutely hilarious.",
        "Going to my first session tomorrow!  ❤️",
        "i’m here for it, adds a nice lil dash of dramatic paprika",
        "I didn't say there is not war happening. Those wars are basically skirmishes when compared to WW1 and WW2. We have not seen anything even close to those 2 things on a world scale since then. Nukes would never be a thing in localized battles anyway.\n\nThe threat of nukes is what keeps countries in line at this point. The word saw the bombs and went, \"Oh shit. The world could really end\" and decided that they should all play nicer.",
        "Your argument is a bad one for two reasons.  First, it's not like the alternative to having the bomb dropped on them was continuing on into a wonderful modern life.  The alternative to the bombs was continued firebombing, starvation and eventual conscription to fight the invasion.  Many of those killed by the bombs would still have been killed otherwise.  The reason is the idea that we shouldn't do anything that might harm someone is fundamentally foolish.",
        "The first hour’s pacing was bizarre. Way too quick with no emotion. Was just fact dropping to get to the second and third hours which I enjoyed more",
        "Oh man, it really is a good movie, don't get me wrong. I've thoroughly enjoyed it. I have looked up so many other scientists and scientific discoveries they made and spent hours reading about as much of it as I can so far. Truly fascinating.",
        "Read American Prometheus. The movie was pretty much spot-on in a historical sense.",
        "Astute observation. We are moving ridiculously fast through technological innovations and it's interesting to see what the next steps in SFX are with AI and such.",
        "Wait WHAT\n\nI haven't seen it but he tried to simulate a nuclear explosion with... Hollywood pyrotechnics??\n\nThar sucks so much! Like the problem with CGI isn't that it's incapable, it's that people use it lazily and don't restrain themselves, instead just vomiting it all over the screen with overwrought sequences pumped out sloppily by overexploited artists.\n\nBut if you really crafted it deliberately, you could make an amazing CGI nuclear explosion. Hire a bunch of scientists, do simulations, etc.",
        "T2 will likely remain the most realistic depiction of a nuke in cinema because they researched the hell out of it, and since no one wants to just copy perfection and wants to come up with their own thing, they invariably screw it up.",
        "Reddit comment warriors in a nutshell. \"Yeah, the terrible nuclear explosion that took 120 seconds really soiled the movie for me, 2/10.\"",
        "It makes you look complex if your criticise something popular. \n\nObviously.",
        "Man didn't name the test site after the form of God and cast himself as Shiva because he was setting off a firecracker on a railroad set.\n\nAnd I can think of other ways if you want to avoid going all out on an earth-shattering kaboom. Maybe a high altitude shot where all you see is a spot of light and silence with the curve of the Earth in the background for scale. Maybe go full anti-climax and cut to black. Pick back up with some wrecked shit or a geiger counter chirping away as some uniformed shmuck scans it over some Trinitite glass. People can figure that kind of thing out. \n\nMeanwhile just a weak explosion just seems like the move that isn't going to really satisfy anyone even if they'll overlook it for other virtues.",
        "Yeah I am not sure how a smaller explosion is supposed to make it scarier.",
        "\"bRo yOu dOnT gEt iT, iTs oNlY boUt OpPeNhEiMer, No BomB\" as we see the trailers, posters with the fucken bomb and explosion on it. why are these nolan bros deflecting so much",
        "Why are you so mad at other people disagreeing with you? Breathe. It's ok. You couldn't just not care and have your own opinion on it? I didn't even like the movie that much but thought the way the bomb scene was handled was really good - it's not some cult theory exclusive to fanboys to think this way.",
        "I get what you're saying, but the movie was made by Nolan, the posters and trailers weren't: they were made by the marketing dept. And people love bombs, so...\n\nPersonally I think the movie explosion looks bigger than footage I've seen of Trinity. The really big bomb explosions we're used to seeing are probably H-bombs, like Tsar Bomba - which really are terrifyingly enormous.",
        "Interesting fact: The energy from the fusion reaction makes up only 1% of a thermonuclear bomb's energy output.",
        "No nuclear bomb (fission or fusion) uses all of its fuel. The fuel is obliterated and scattered by the release of energy before all of it can participate in the reaction.",
        "Man what you said still doesn't make sense. Maybe you meant the nukes of BACK THEN are sub components of TODAY's nukes",
        "The Tsar Bomb is 50+ years old...why do you believe that power isn't available in a smaller transmissible bomb. \n\nlook at the size of computers in 71 versus 2021+.",
        "The same concept applies to cluster bombs too. If you're not attacking a bunker it's better to scatter 80 grenades over an area the size of a football field or 2  than to dig one crater in the middle. The dud rate on those grenades is a big problem though.",
        "Like how Americans dropped it in their territory? Yeah, I agree. Russians have probably covered up bigger fuck ups.",
        "I wonder if they have headaches again. 😔",
        "Giving me PTSD to civ 5 Ghandi on deity lmfao",
        "Let's face it, a film about Feynman's life would blow Oppenheimer out of the water.",
        "Until literally right now I thought he was part of it.",
        "The electric city!",
        "#THE AUDIO FROM THE MOVIE WAS CRAZY GOOD!",
        "Don't think you were paying attention during this scene. There were images of burned charred corpses on the ground. Oppie walked past one man who literally disintegrated into ash in front of him on the floor.  \n\n\nSafe to say, it was a vision, not actual.",
        "I've only seen it once so far and it was a lot to take in, but there were images of people crying in misery, dying, burning and throwing up, interweaved with the celebrations. I figured those were the horrors that the destruction and nuclear fallout from 'his' bomb will and did cause, including radiation poisoning, pictured as Oppenheimer's internal conflict.",
        "I wanted to believe it was some people experiencing awareness of the civilian casualties",
        "There is a little scene where they’re handing around a bottle so many of them were likely intoxicated. Throwing up from drinking too much.\n\nBut I’m sure it is intended to have multiple meanings.",
        "Quite frankly, I’m not sure why you’re so confident in your interpretation. That was pretty *violent* vomiting to be caused by guilt. I assumed it was meant to symbolize radiation poisoning.",
        "How is it heavily implied that it’s from the guilt and not radiation sickness? This, in my opinion, is quite obviously about Oppenheimer realizing what he has caused. There was a burned child and the woman getting her face burned as well.",
        "Y’all arguing but helpful to keep in mind that something can have multiple meanings",
        "How did it not knock you on your ass? The moment from the explosion to when the sound hit scared the ever living fuck out of everyone in the theater I was in",
        "Yeah i mean im not disagreeing, but as i said, cant comment. I prefer to avoid any and all marketing material for movies im interested in so i simply haven’t seen the things you are referencing.",
        "Pedantics.",
        "I guess a fun way to look at it is to imagine how much later the internet would have arrived without his efforts. It was coming no matter what but government funding towards a big project like pre-internet tech is a pretty big deal.",
        "I got no fire!",
        "Breaking bad memes have ruined me, I almost laughed every time they mentioned Heisenberg in Oppenheimer",
        "Put your dick away Waltuh",
        "that’s true! \n \n…I also can’t help but think about how compared to the history of humanity, the last 80 years are a tiny blink of an eye. when you scale out proportionally we’ve only had these weapons for a couple days, and already almost accidentally blew up the world on two separate occasions",
        "That's Nolan for you. Guy loves his exposition.",
        "[removed]",
        "Is it really dry or a decent read?",
        ">I haven't seen it but he tried to simulate a nuclear explosion with... Hollywood pyrotechnics??\n\n\nWhat's even weirder is there are a handful of obvious implementations of CGI throughout the movie, including the closing shot, so it's not like he was totally CGI-averse, it was more like he was making an academic point than he was making good choices for the film itself.\n\nLots of interesting choices made throughout the production that work, but this is probably the biggest one that I think just doesn't and it's a shame because it's the only thing keeping it from a 9/10 film for me and easily Nolan's best (that and better written female characters). Luckily the film settles into a plot surrounding political intrigue by the third act, and the Trinity Test isn't even the apex of the film (the speech afterwards is). Wonderful film with one glaring flaw.\n\nEDIT: I stand corrected, NO CGI was used in the film, I guess the shots I'm thinking of were just VFX and small models - pretty impressive craft, but I'm still not sure it was the right decision in conveying the scale of the explosion.\n\nEDIT2: I stand double corrected, there was a fair amount of CGI VFX used in the film and the VFX artists are giving vocal backlash to the narrative that either Barbie or Oppenheimer \"used no CGI\".",
        "> he tried to simulate a nuclear explosion with... Hollywood pyrotechnics??\n\nUnless you're burning specific chemicals for different colours, an explosion is just an explosion. Many of the big nuclear tests we're used to seeing are H bomb tests on water which naturally have a different result but you can do a pretty much perfect scaled-down replica of a small nuke with traditional explosives as long as you use the right mix ignite enough air.\n\nThe only thing you really miss out on is the blast wave, though that could be replicated by being close enough to a large enough explosion I don't think that'd get past health and saftey.",
        "Elbows too pointy.\n\n&nbsp;\n\nJk, i haven't seen it",
        "Are you ok? Personally, I haven't seen any Nolan films before. You know that having different opinions on things is healthy?",
        "What makes up the majority of the energy?",
        "This always blows my mind. Similar the first nukes were this powerful and only burned a tiny tiny fraction of the Uranium or Plutonium to do that. Matter to energy ratio is insane.\n\nIf we could figure out how to get all of that material to fission we'd break the planet in half.",
        "Yes you’re correct.  I had a brain fart",
        "Even if that were true, it doesn't mean much.  Tsar Bomba is scary but not very efficient. \n\nYou can test this out at [Nukemap](https://nuclearsecrecy.com/nukemap/).  \n\nYou can drop 100 one megaton bombs or one Tsar Bomba.   Try dropping those on your city and you'll see that while the radius definitely increases by a noticeable amount, it doesn't increase 100x.  \n\nWhat happens is that a lot of energy goes into ensuring that the stuff that was already completely obliterated is just incinerated and obliterated even more.  It doesn't really matter if the heat at the point of detonation is the temperature of the surface of the sun or 10,000 times that.  Nothing survives.  It doesn't matter that you dig a crater 100 feet deep or 1000 feet deep unless you are dropping this bomb on NORAD, and that is dug in deep enough that even Tsar Bomba might not touch it.  \n\nIt's just better to break your huge bomb into a lot of smaller bombs and distribute them over a wide area.  It's why most of our ICBMs now are really [MIRVs (Multiple independently targetable reentry vehicle)](https://en.wikipedia.org/wiki/Multiple_independently_targetable_reentry_vehicle).  Look at [this photo](https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Peacekeeper-missile-testing.jpg/1584px-Peacekeeper-missile-testing.jpg) of a LGM-118 Peacekeeper and realize each of those streaks represents a 300kt bomb (20x the bomb dropped on Hiroshima).  And that missile carries *12* of the goddamn things.   And you could launch 27 of those ... or *one* Tsar Bomba.\n\nThat bomb just doesn't make much sense.",
        "Because of nuclear test ban treaties, which can actually be enforced because we can detect nuclear explosions happening anywhere on earth except deep underground (and we're working on that too). \n\nSo for a long time the only way to develop nuclear weapons is with simulations or underground tests.\n\nComputers haven't had such restrictions placed on their development and testing.",
        "Idk if it'd be better than Oppenheimer but it would sure as shit be funnier. Feynman was a goofy guy.",
        "Agreed. I'd even take a mini-series.",
        "You are Mandela Effected 🤷🏼‍♂️",
        "r/unexpectedoffice",
        "scranton?",
        "![gif](giphy|TaBRY9MzqfoDHfDrcx|downsized)",
        "He actually stepped on a charred corpse in the aisle. Had to pull his foot out. Metaphorically of course.",
        "I doubt they missed that.  I believe that what they're saying is that there was a mixture of visions in Oppenheimer's head (flesh peeling of the girls face, charred bodies underfoot, etc) and of real reactions from people having the same reaction Oppenheimer did (guy throwing up outside).  That's how I felt.",
        "Lots of amazing symbolism in the movie! During the leadup to the detonation and the rest of the movie, i was at the edge of my seat! Everything was so intense!",
        "Initially there's a play on reality with the girl in the crowd flipping from cheering to crying, which was in Oppies head, but then I believe that some of the people reacting negatively were real. \n\nWe know there was a contingent  that had been having meetings discussing if they should even drop the bomb, and they're obviously a clever bunch, so I'm sure some of them were at least partially aware of the horrors they'd unleashed.",
        "Yeah I don't think enough people realise this (which seems obvious to me). It was intentional to have multiple different interpretations, so that you couldn't be sure.",
        "Because Oppenheimer later told the story in an interview. I don’t think he mentioned vomiting, but he specifically said people cried, which is also part of the scene with the guy vomiting. It seemed clear to me that the movie showed one reaction inside, but showed the horrified reaction of some outside. I don’t find it odd at all someone might throw up like that with the knowledge that an invention you helped  make was just used to kill tens of thousands of people in an instant.",
        "How would you react to knowing an invention you had a hand in killed so many people?",
        "Yeah I realised that, it just struck me as ridiculous at first but I can see their point.",
        "Personally, I thought the use of silence in a couple of parts of the film were amazing. There was some kind of silent moment in the tense scenes before the bomb went off, that were cool as shit. I've never been in a packed theatre before with the ENTIRE audience dead ass silent waiting on pins and needles. It was eerie and cool. The bomb silence was the same way, sorta, but less tense.",
        "Father, you smoke?",
        "Even me",
        "He's too in love with his gimmick, distracts him from the story",
        "Reminds me of Tarantino too.\n\nLike yes this is great and its very well written, but theres a point where it drags the pacing to hell.",
        "Wasn't the sex scene to show that Oppenheimer's wife felt that her husband's affair was being literally thrown in her face and she felt he was totally exposed?",
        "Excellent read. Although I’m partial as my grandfather worked on the research early to a limited extent at UC Berkeley before the Manhattan Project started. \n\nCheck out some reviews. It covers everything, and the movie was spot-on pretty much, including the JFK vote which nobody really talks about on the political side of the story.",
        "> What's even weirder is there are a handful of obvious implementations of CGI throughout the movie, including the closing shot\n\nEverything that I can find says there is zero CGI in the movie, with him confirming it on a few websites",
        "You can encase the bomb in regular non-enriched uranium metal which has the dual benefit of containing the fusion reaction to get the most out of it, and making a really big explosion as the uranium becomes very rapidly 'enriched'. So you get a fission reaction comparable to the WW2 bombs igniting a much bigger fusion reaction which in turn ignites an even bigger fission reaction. Overall you can get 1000x the explosive power.",
        "Plus it's two entirely different things.\n\nComputers became more powerful because we were able to shrink transistor sizes and fit more of them onto chips. The early '70s would have commercial chips with a whopping 2 thousand transistors on them while Apple sells a chip today with 134 billion transistors on it, and there are private firms with CPUs that have trillions of transistors.\n\nA nuclear bomb at the end of the day can only be engineered so far because the destructive force comes down to how much nuclear material is in it and how much of that you can get to actually fuse. The current limit that has actually been achieved is about 5kt of explosive power per kg of material.\n\nNot forgetting that the later tactics of nuclear powers put a heavy focus on smaller more tactical weapons that had limited blast ranges but made up for it in being cheaper, easier to maintain, harder to stop and much easier to deploy.\n\nThere was never any need (let alone the possibility) of making a suitcase nuke that could make the Tsar Bomba look like a damp squib.",
        "In other words, there is a common belief that Einstein was involved with the Manhattan Project",
        "#BUTTLICKER! OUR PRICES HAVE NEVER BEEN LOWER!",
        "That was his real life daughter too playing that charred corpse.",
        "This will wrinkle your brain a little as well. Oppenheimer would look at a woman cheering, look away, then look at her again and would see her crying, almost as if that when she was not being observed she could conceivably be doing both, or either. In the physics world this phenomenon is called quantum superposition and is at the crux of the whole field of quantum mechanics, and is pivotal to the wave/particle dual nature of light. Oppenheimer, well versed in quantum mechanics, was observing people using the same principles that he observed physics.",
        "Almost like a \"quantum\" uncertainty, which would be very poignant for the leading mind in quantum mechanics in the US at the time.",
        "I don’t think he cared about that, as was shown. I think he cared about the future impacts",
        "Yeah totally, I didn’t see the whole thread sorry. And not trying to pick you out personally just noticed a trend in the comments!\n\nTbh I think both views are valid! Hard to say what Nolan’s intention was of course, but I personally lean towards it being purposefully vague so that the viewer is unsure whether he is throwing up because he partied too hard, or that he too feels guilty, or even that it is a hallucination/symbolic of radiation sickness (along with some other images from that scene) - the vague nature of it all is anxiety-inducing, which matches the emotions and inner conflict Oppenheimer is going through in that moment. We, the viewer, are experiencing the confusion and dread alongside him.",
        "I get that, but I feel like there could have been a better way to convey this. It felt really sudden and out of place to an almost uncomfortable (which I guess was the point) and comicle degree.",
        "Ooh I shall read it then. Me and my husband noticed the JFK vote and were saying that even before he was President, he clearly wasn't afraid of following his conscience rather than the status quo.\n\nEdit: and kudos to your grandpa. He must have had a brilliant mind.",
        "Wait, what?? But.... they blow up the world at the end. They achieved that with practical effects? That's actually pretty damn impressive if true.",
        "You are correct, no cgi at all and only a small portion of the film had vfx.",
        "Do you have a source on this?",
        "It doesn't get enriched, just fast-fissioned.  Well any nucleus is enriched for a few femtoseconds I suppose.",
        "[removed]",
        "Yeah, it felt a bit like something from Twin Peaks. Really jarring and out of place. Which was maybe the point? I'm talking about the interrogation room one. I thought the one in the bedroom was ok.",
        "And then he got the Cold War and the bay of pigs. Strange how things work out.",
        "> no cgi at all\n\nAny idea how they pulled off that final shot of the film, with the world burning?",
        "It's in the wiki articles for one thing.  Look up Teller-Ulam design."
    ],
    "First Image of Cillian Murphy as J. Robert Oppenheimer in 'Oppenheimer'": [
        "Do we know if Feynman will feature?",
        "Cool finally seeing Cillian as a lead in a Nolan flick! \n\n He always killed it as a supporting character in his films.",
        "Nukey Bombders",
        "Yep, that's Cillian Murphy in a hat.",
        "Looks great. It's fantastic to see Cillian Murphy get a leading role in a big movie, he's a terrific actor and no doubt he'll knock this role out of the park",
        "Production has officially begun on Christopher Nolan's 'Oppenheimer', set for a July 21, 2023 release:\n\n* Cillian Murphy as J. Robert Oppenheimer\n* Emily Blunt as Katherine Oppenheimer\n* Matt Damon as Leslie Groves\n* Robert Downey Jr. as Lewis Strauss\n* Florence Pugh as Jean Tatlock\n* Rami Malek\n* Benny Safdie as Edward Teller\n* Josh Hartnett\n* Dane DeHaan\n* Jack Quaid\n* Matthew Modine\n* Dylan Arnold as Frank Oppenheimer\n* Olli Haaskivi\n* Alden Ehrenreich\n* David Krumholtz\n* Kenneth Branagh\n\nThe film will be shot on a combination of IMAX 65mm and 65mm large-format film photography including, for the first time ever, sections in IMAX black and white analogue photography.",
        "If the picture is of any indication, this will be the first Nolan film in which people smoke cigarettes.",
        "I’m currently halfway through the Pulitzer Prize winning book “American Prometheus” on which this movie is based.\n\nOne of the most famous traits of all of Nolan’s films continues with Oppenheimer.\nGuess what that is?!",
        "Looks a lot like Cillian Murphey with a hat on.",
        "Black and White? Looks like Nolan's going back to where it all started.",
        "\"Now I am become Death, the Destroyer of Worlds.\"",
        "Cillian Murphy deserves all the praise in the world.  I feel in the mainstream eye, he's always been one role away from making it big.  You look at his fucking credentials though?  Mother fucker should be bigger than 90% of the box office with the work he's done.",
        "This looks great. Universal got a steal when they got Nolan to do this",
        "Looks like ed Harris in a beautiful mind.",
        "Oppenheimer after the bombs drop: I told you my product would take you places. I didn’t say they’d be places you wanted to go.",
        "For reference, this is a pic of the real Oppenheimer: https://content.magnumphotos.com/wp-content/uploads/2019/05/cortex/par196080-teaser-story-big.jpg\n\nThe casting is spot-on it's nuts.",
        "This makes me wonder if the film will be in black and white.",
        "I can’t see that photo of Robert Oppenheimer without hearing Jurassic Park in the background and hearing Sam Jackson go “access main program, access main security, access main program grid.”",
        "Is no one playing Feynman? Oppenheimer had a lot of stories but I always liked Feynman's because \"Oppie\" as he called him seemed very much a pal; Feynman humanized Oppenheimer to me. Obviously wouldn't be a huge part of the story but the humanizing aspect would be welcome of Oppenheimer with the junior scientists.",
        "Heck Yeah! Love Murphy",
        "Serious Cad Bane vibes.",
        "he looks like a peaking focking blinder to me, mate",
        "The right man in the wrong place, can make all the difference in the world.",
        "This just reminds me of the Epic Rap Battles of History performance, and how haunting it is. I hope Cillian Murphy does just as well here.",
        "This dude is such a great actor. I hope this role launches him into movie stardom.",
        "He sure does love a smoke 🚬",
        "Now I am become a Peaky Fookin' Blinder",
        "They’ve been filming it in UCLA for some reason though. Parts of campus keep closing for it",
        "He looks a lot like Cad Bane.",
        "A younger Ed Harris in Westworld vibes.",
        "Oh man. This is oneof those are ones I gotta see in the theatre. I read Oppenheimers biography, goddamn what a story",
        "Also Cillian Murphy as Thomas Shelby in “Peaky Blinders” and Cillian Murphy as Dr Johnathon Crane in “The Dark Knight Rises.”",
        "Yup, it's Cillian Murphy",
        "im getting Half Life vibes",
        "More like 'Oppenhottie'",
        "He'd be a good fit for the synth detective in Fallout 4",
        "Sigma rule #1945\n\nCreate weapons of mass destruction for maximum grindset.",
        "Damn near identical",
        "Great, you know this image will be used on FB with a bunch of stupid sayings about being masculine, independent, quietly dangerous, don't care if others don't like me etc etc etc.",
        "\"Now we are all sons of bitches.\"",
        "I looked up pictures of the real Oppenheimer to see how it compares.  He kinda looks like a more gruff Joseph Gordon-Levitt.\n\n[Oppenheimer.](http://blog.nuclearsecrecy.com/wp-content/uploads/2012/10/Oppenheimer-1946.jpg)\n\n[Levitt.](https://compote.slate.com/images/d199fe8d-ef65-4edd-a5e2-07a345b6a3cc.jpg)\n\nLevitt is too pretty boy-ish to be the part, so I guess Murphy makes more sense.",
        "Pls get the mixing right. Last two Nolan movies have been LOUDLOUDLOUDquietquiet",
        "\"Now I am become Death, destroyer of worlds\" -- Robert Oppenheimer, quoting the Bhagavad Gita, upon withnessing the first atomic bomb test\n\nI'm assuming this was also the pitch for this show.",
        "Wow he looks like Ed Harris in that photo. Specifically Ed Harris as The Man in Black in *Westworld*.",
        "That’s it. I don’t need to see it. It’s all summed up in that photo.",
        "Im not into men, but this is one fine dude.",
        "I hope they include the parts where he was poisoning his TA or choking out his friend because Oppenheimer was jealous of him getting married.",
        "\"Gordon Freeman in the flesh. Or rather, in the hazard suit. I took the liberty of relieving you of your weapons; most of them were government property. As for the suit, I think you’ve earned it.\"",
        "Will this be shot in black and white like Following? Or do we even know yet? \n\nI'm really looking forward to this one, thanks to my mom I've always been fascinated by atomic bombs, and especially the whole Oppenheimer story, and Nolan is perfect for this material. I even have a huge mural on the wall in my living room of the baker explosion. \n\nI can already see Nolan recreating the first test of the bomb, and how loud it's going blast those IMAX speakers and probably leave me deaf. I'm ready!",
        "He looks like he just saw death",
        "Can't wait to see how this turns out. I finished American Promethius recently, and while I think there's disparities in physical appearance when comparing the two, Im hopeful he can pull off the duality of Oppenheimer.  Oppie was kind and empathetic to many, but it's often mentioned he could be incredibly condescending to those he thought were his intellectual equal which earned him many friends and enemies.  This role requires someone both \"cold\" and \"charming\" and will take considerable skill to pull off. \n\nAt the very least I hope we can hear the dialogue.",
        "Cigs are in this dudes contract",
        "I’m not a movie industry buff but how often do productions use test shots as their teasers for their movies? Cause this feel like a test shot instead of an actor/actress doing his/her role in set.",
        "Perfect casting.",
        "Looks like he should be in a David Lynch movie",
        "this pic goes so hard",
        "O’ive becooome death destroya of wuuuurlds",
        "Yo is that Thomas shelby",
        "I preferred him in his epic battle which Thanos",
        "I am trying to figure out exactly what in this movie requires a 100 mil budget",
        "This is already exhausting.",
        "I wonder if the movie will be in black and white.",
        "Tommy bought a hat.",
        "Dwight Schultz's performance is going to be pretty tough to beat.",
        "Or is it Cad Bane?",
        "Would look good as Cad Bane for Kenobi series",
        "So when are we getting Cillian as G-Man in Half Life?",
        "Its fuckin' Cad Bane",
        "This Cad Bane looks nothing like his beautiful visage in “The Clone Wars”.",
        "Can someone shop this to have the Cad Bane tubes for the good of the internet please?",
        "\"\"Now I am become death...by exile!\"",
        "I'm not sure if it's the hat, but he gives off some live action Cad Bane vibes.",
        "I thought that was Cad Bane",
        "https://i.imgur.com/ZDFug6O.jpg",
        "These movie studios better be ready to buy this man some new lungs at the end of his career.",
        "I love the movie already",
        "[The resemblance is pretty uncanny](https://barnebys.imgix.net/https%3A%2F%2Fdyn1.heritagestatic.com%2Flf%3Fset%3Dpath%255B2%252F2%252F7%252F5%252F2%252F22752046%255D%252Csizedata%255B900x2000%255D%26call%3Durl%255Bfile%253Aproduct.chain%255D?auto=format%2Ccompress&crop=0&cs=tinysrgb&fit=crop&h=400&ixlib=php-2.3.0&trim=auto&w=400&s=880785b463706128638cef3c84034f18)\n\nAlso, if you are interested in in the history of the Manhattan Project there is a fantastic book called The Making of the Atomic Bomb by Richard Rhodes.  Absolutely riveting.",
        "Bro, nolan directing a nuclear bomb movie. I am already imagining a A bomb scene! It will be amazing and terrifying. We will finaly now what kind of impact such a bomb really has. Cant wait..",
        "Where is Nolan gonna detonate the nukes?",
        "He could be Carrie-Anne Moss's brother.\n\nI remember the 1st time I saw him in a movie. I couldn't help but think, that he was a very *\"pretty\"* man. He definitely won the looks gene lottery.",
        "He'd make a great Half-Life G-Man",
        "Remember that matching game in Super Mario 3 where you have to match up 3 segments? I feel like that's how they came up with Murphy's face.",
        "They gave him a hat! What will they think of next?",
        "*I am become Death*",
        "I’d be very surprised if that isn’t who Jack Quaid is playing, he looks a lot like young Feynman",
        "This is my question too. I hope Feynman gets some of his story told as well.",
        "Surely* you’re joking",
        "Dane DeHan I’d say",
        "Or just any Brits at all would be nice considering they came up with the idea and put a ton of work towards it before the Americans got involved.",
        "Yes! Really hyped for this aswell.",
        "He was my favorite parts of Inception and Batman Begins. I'm really excited for this one",
        "*Death, by exile*",
        "Totally. His expressions during the \"I was disappointed that you tried\" moment of Inception were incredible, it was that moment the whole movie has been working towards, all the intensity of the movie would not have meant as much if he didn't convey the severity and he really delivered.",
        "Oppenheimer was famous for his “piercing blue eyes.” Honestly how could they have *not* cast Cillian Murphy. \n\nhttp://blog.nuclearsecrecy.com/2012/05/04/friday-image-ol-blue-eyes/",
        "I am become fookin' death, polly, destroyer of fookin' worlds",
        "Weah the fookin' Nukey Bombders",
        "Destroyer of fookin worlds",
        "28 Isotopes Later",
        "\"Olfie, we've got to build our own fooking Nooke!\"\n\n\"Tommy, jguk daathkvl juyolmc eh lobse?\"",
        "by odah of the Nukey fookin' Bombders",
        "*sigma male guitar strums*",
        "MORTAR KOMBAT!",
        "oii bruv",
        "Peaky Gigers",
        "This is the first thing to actually make me laugh out loud in a week",
        "Got sick of wearing a flat cap I guess.",
        "Me, an intellectual:\n\nThat's Tommy fookin' Shelby in a fedora.",
        "You fool. Don’t you see the cigarette? The cigarette plus the hat equals Oppenheimer. It’s a simple mathematical equation.",
        "I knew I was going to find this here",
        "Don't pretend like he doesn't look different here--noticeably skinnier.",
        "For a long period of time I assumed that Micheal Pitt was Cillian Murphy after losing some fat in his face. Few years ago I looked it up and realized they only look similar in my head, when I remember them.",
        "He was the lead in one of my all time favorite movies *Sunshine* directed by Danny Boyle. Fantastic film imo",
        "28 days later?",
        "How do we know that Oppenheimer is the lead role?",
        "He's one of those \"trademark stamp of approval\" actors for me. He is such a damn good actor in everything I've ever seen him in, I always know what to expect from him: excellence.",
        "It's a shame no one's going to hear a word he's saying",
        "And the fact that Nolan is a big fan of him has my hopes very high. Can’t wait for this to come out",
        "Damn, that’s one hell of a cast.",
        "Interesting tid bit. Imax 15 perf film is the highest resolution medium available for movies with it being able to scan out at 12k. Due to the human eye’s bias towards black and white we see much more resolution on the grayscale. (Because we are actually pretty shit in seeing color) so if you see a film print in full 70mm imax for this film you will be seeing the highest resolution film ever made.\n\nNot that it really matters, just found it interesting.",
        "I wonder if Kenneth Branagh has replaced Michael Caine as Nolan's new 'Good Luck Charm\"?",
        "the lack of Michael Caine makes me sad",
        "JOSH HARTNETT??? Is he back?",
        "Stacked cast and some awesome first timers in a Nolan movie.\n\nFlorence Pugh, Emily Blunt, and RDJ will be fun.",
        "No Michael Caine or Tom Hardy, huh? *Unwatchable*.",
        "So who plays Einstein, Malek?  Or do you avoid having him as a character.",
        "Alden Ehrenreich! Was hoping his career wouldn't die because Solo flopped, and Brave New World didn't exactly do much to help him, hopefully this is the start of a comeback.",
        "Torille",
        "The big reveal I'm waiting for is who's going to play Feynman. He is one of the most charismatic and interesting scientists of the 20th century, playing someone with such a well known manner and way of speaking will be one heck of a challenge",
        "Florence Pugh has quickly become one of my favorite actresses and Midsommer and (believe it or not) her roles in Black Widow and Hawkeye are why. She just inhabits those roles so well.\n\nOne as a shattered girl with a frail mental state who's trying to keep it together, and the other an entirely self confident bad ass who isn't above being humorous.",
        "I'm interested to see how they portray Jean Tatlock's death.",
        "Right. It’s also ‘coz Oppenheimer was a chain-smoker.",
        "[deleted]",
        "In “Insomnia” the best friend of the murdered girl smokes in Al Pacino’s car, so HA!",
        "That's not true if you mean the first time a single person has smoked a cigarette. In Insomnia, Katharine Isabelle's character smokes when Pacino is driving her. [https://www.youtube.com/watch?v=1uPWt9g_H0M&t=102s](https://www.youtube.com/watch?v=1uPWt9g_H0M&t=102s)",
        "I never saw Dunkirk but I'm shocked there was no smoking in a war movie.",
        "Are u sure about that? No smoking in The Prestige, Insomnia, Memento or Following?",
        "Wife/gf dies",
        "> I’m currently halfway through the Pulitzer Prize winning book “American Prometheus” on which this movie is based.\n\nA book on the overall project of the atomic bomb *The making of the atomic bomb* by Richard Rhodes (ISBN 9780684813783) is good (it won the Pulitzer Prize). It goes back a few decades for the history of atomic research as well to get a general context and ends with the droppings on Japan.\n\n* https://en.wikipedia.org/wiki/The_Making_of_the_Atomic_Bomb\n* https://en.wikipedia.org/wiki/Richard_Rhodes\n\nHis *Dark sun: the making of the hydrogen bomb* is on my to-read list as well.",
        "Wild guess here… Time?!",
        "Shoddy audio mixing?",
        "Great book.",
        "I am just about done! Seriously one of the best bios ever written.",
        "Pretty sure it's Tommy Shelby but what do I know",
        "Looks like Cad Bane to me",
        "This image is about to be slapped up with a bunch of gothic font text about loyalty and gentlemanliness by a bunch of 15 year olds with countable pubes.",
        "Stock model. Comes with a hat.",
        "hahaha this is immediately what I thought too.\nDon't get me wrong I like Cillian Murphy quite a bit. But he's got such  striking features that he always just.... looks like Cillian Murphy in a [insert costume/clothing piece here].\n\nNot a terrible thing, to look like Cillian Murphy, though. I'm sure he'll do an excellent job in this role!",
        "Remember Sammy Jenkis",
        "I bet he does a Spielberg where the nuke scene is in full colour and everyone is like, ‘the fuck we just done’",
        "I wonder if his color blindness makes him prefer black and white.",
        "Thats definitely going to be the closing line of the first trailer",
        "I like how when it's written down, it sounds like Oppenheimer is trying to sound badass. When you actually watch him say it, he's a broken man, wracked with guilt, who probably hasn't had a good night's sleep in 20 years.\n\nhttps://www.youtube.com/watch?v=lb13ynu3Iac",
        "It’s crazy that I know this line will be said at some point yet it will still give me goosebumps when I go see the movie.",
        "I think he already made it big a long time ago. If you mean Leonardo DiCaprio status where everyone’s grandma knows who he is then no but there’s only like two or three actores every 20 years that achieve that, but Murphy has had multiple leading roles in huge movies and currently one of the biggest shows in the world. He is mainstream.",
        "This could be his Oscar right here, Im thinking....",
        "From Wikipedia\n\n> Some of Nolan's demands included a $100 million budget and an equal marketing budget, a theatrical window of at least 100 days, 20% of the film's first dollar gross, and a three week period before and after the film's release, in which the studio could not release another new film.\n\nHe's one of the rare directors working today who can get away with these demands.",
        "Warner’s really let a big fish escape.",
        "I think he looks like a younger Ed Harris too, though to me he resembles The Man in Black from Westworld",
        "Oppenheimer to other scientists as the bomb is detonated: we'll just have to imagine the fire",
        "Wonder if Nolan finally just wanted to give Murphy a lead role in a biopic and googled “famous people who look like Cillian Murphy”",
        "Not sure why you wouldn't link this one https://i.imgur.com/HxjESKx.jpeg",
        "Kind of looks like Harry Shearer.",
        "I was thinking Murphy was too good looking but that must’ve just been because the only image I have of Oppenheimer is that interview where he’s like 80",
        "It looks nothing like Murphy?",
        "I have no doubt he can resemble him well enough but I’m really curious to hear his voice. Oppenheimer has such a distinct, gravelly voice that sounds nothing like I’ve ever heard Murphy sound.",
        "I was hoping for another picture of Cillian Murphy.  I am disappoint.",
        "Thats the photo Nedry has framed on his desk in Jurassic Park",
        "I don’t know if Murphy will capture quite the feeling of helplessness and total regret that plagued the later decades of Oppenheimer’s life but eh I guess we’ll see",
        "“Oppenheimer” will be shot on a combination of IMAX 65mm and 65mmlarge-format film photography including, for the first time ever,sections in IMAX black and white analogue photography.\n\n[https://www.thewrap.com/oppenheimer-cast-image-christopher-nolan-movie-cillian-murphy/](https://www.thewrap.com/oppenheimer-cast-image-christopher-nolan-movie-cillian-murphy/)",
        "And 1.19:1 (a la *The Lighthouse*), until the bomb goes off and the aspect ratio expands into ~~widescreen~~ IMAX!\n\nEDIT: Forgot who I was talking about here.",
        "\"Please!  Goddamn it, I hate this hacker crap!\"\n\nYour post made me smile remembering this scene!  Also note he doesn't say the same words as he is typing, lol.",
        "Willing to bet Jack Quaid is playing him, the resemblance is uncanny",
        "Nice to see him alive and well",
        "After several veiled threats from Edward Teller, [Oppenheimer worries that he may be strangled](https://imgur.com/3bUcT8m).",
        "You were born to eternals, but came out looking so scary, that your own mother tried to make you a temporary",
        "His raps are only hot periodically",
        "I love how they prostrated Oppenheimer in the ERB",
        "It's a crazy battle to watch because eventually it hits you that while one is fictionally responsible for the deaths of trillions, the other one is actually responsible for the deaths of hundreds of thousands if not millions in real life.",
        "*You're in the Endgame now Twinky, Winky. I'll finish this like Ant-Man: ALL UP IN YOUR STINKY*\n\nSeriously, though, Oppenheimer woke up and chose violence and that ERB. He was fucking brutal.",
        "Nolan is building a real atomic bomb to detonate.",
        "Knowing Nolan they will blow up a real atomic bomb.",
        "Look at the cast. Plus it will probably include explosions and war footage. Both are expensive.",
        "Wow he really does",
        "Me too, although Alden Ehrenreich just got cast and he also has the forehead for it.",
        "Actually, Chris Pratt is playing Feynman. Jack Quaid will be playing Sonic the Hedgehog.",
        "Just read more into this guy. The fact that he was critical to the design of the nuclear weapons, working his ass off, all while his wife was dying and he had limited time to be with her (Manhattan Project security) is a whole story within itself.",
        "I've read the Oppenheimer biography their basing the movie on and I don't recall Feynman being featured in it much at all",
        "If they are following the book closely, no. :(  He was mentioned in the book, but not to the extent everyone wants him to be in the movie.",
        "That would be about the time he went Hugh Hefner after his wife died.",
        "The forehead is enough of a giveaway that Jack Quaid will be playing Feynman.",
        ">Sure you’re joking\n\n\\*Surely",
        "Just looked and there were a fair few of them at Los Alamos in key positions too.  \n\n\nI suppose it will all depend where Nolan wants to centre the drama and how he wants to tell the story.",
        "[deleted]",
        "Sold! To the man in the cold sweat.",
        "Death; by exile",
        "He did say, or re-say that, right?\nEdit: Are you from Lewisham?",
        "eh?",
        "If weah gonna continyou to 'ave dealin's with this fuckah, I demond to know woy.",
        "NO. FUCKING. FIGHTING.",
        "OI AM BILLY KIMBA",
        "Bat-Little-Boy Begins",
        "BAI OWDAH UV DEH PEEEAAAKY FOOOKIN BLAYNDAHSS",
        "Thank god he didn't have to stop smoking for 15 minutes for this role",
        "Or a mask made out of a sack.",
        "Oy am Johnny Kimba.\n\nNever seen the series, but hovered the mouse over the Netflix preview many many times.",
        "I thought the cigarettes and hat made it Leonard Cohen.",
        "They just gave online \"alpha\" men a new profile avatar for the next few years",
        "And hopefully it will continue to be found, as long as we get these stupid \"first look\" PR teasers that reveal pretty much *nothing* about a movie.",
        "I think that’s a lens effect.  It looks like a very short focal length, which has the effect of making faces look much narrower with longer noses.  ~~You can see that the front brim of his hat, as well as his ears, are out of focus~~",
        "Cillian Murphy always has had a skinny face.",
        "I can see how you could mix up the two: both have a gaunt aspect about them.  \n\nBut I'll take Murphy any day of the week.  I imagine he's a lot easier to work with, too.",
        "Fuck, dude. I remember my older brother got it when it came to dvd or blu ray. Excellent film, I just got done telling my girlfriend how we need to watch it.",
        "Still my favorite movie to this day! So few people know about it. If you’re reading this and haven’t seen it, do it tonight!",
        "28 days later is gold too",
        "Was 28 Day Later a big movie when it came out though? Genuinely curious, I was like 10 and don’t remember. Also Danny Boyle wasn’t Danny Boyle yet, whereas Christopher Nolan is one of the biggest names where people will highly anticipate whatever he’s attached to at this point in his career.",
        "Also Red Eye",
        "True. This could be a *Julius Caesar*  type of situation.",
        "Thats how it works with Titles, Just ask Zelda, and their lil green outfit.",
        "It's a pretty reasonable assumption for the time being.",
        "well, you know, the title",
        "this is like 3 movies worth of “hell of a cast,” I could easily divide this cast into 3 movies and have a “hell of a cast” for all of em. This cast is just outrageous.",
        "Probably Nolan's most stacked cast. Though, the most interesting collaboration I'm looking forward to is Nolan and ludwig göransson.\n\nI personally thought Hoyte was an improvement over Pfister. Let's see if the trend continues with the composer and editor.",
        "One hot group of scientists.",
        "Let’s hope Nolan doesn’t fuck up the sound so we can actually hear them.",
        "It’s fucking absurd. I am full mast for this movie",
        "Where is Christian Bale? Nolan and Bale was really tight during the Dark Knight trilogy just like Johnny Depp and Tim Burton.",
        "I wonder who's making the film. I guess Kodak's the only company left.",
        "Depends who you ask about 15/70mm's effective resolution, some say 12k, some say 18k, others say less. There's also 5-perf 70mm which runs vertically like 35mm, and again depending on who you ask, that can be anything between 8k and 12k. Given it's Nolan, there's likely to be some number of prints in both of these formats. It's all academic because film doesn't really have a defined resolution, since that's just not how film works. Random grain distribution means random \"resolution\". Semantics aside, either of these formats will contain many times more detail than any digital projection systems. If you have the chance to see it on film, I would certainly recommend it!",
        "Highest resolution film, lowest resolution center channel dialogue.",
        "*totem",
        "He’s the bomb.",
        "I wouldn't be shocked if he still pops up in a short cameo or doing some voice over. I think at this point he's just too old to be part of a main cast.",
        "A nuclear bomb the size…of a tangerine",
        "Michael Caine is going to be an announcer over the speaker system that counts down from 10 to 1 for the first atomic bomb testing scene.",
        "I think Nolan is contractually obligated to have Michael Caine in some role in his films. He might be an uncredited minor role like Dunkirk.",
        "You know, Nolan movies are just better when My Cocaine is involved.",
        "He will pop up somewhere.",
        "He has trouble walking these days",
        "lol that's what I thought too. Hasn't he not been in a movie in like 20 years? Pearl Harbor maybe?",
        "Seriously what has he been up to?",
        "I am excited for David Krumholtz.",
        "But it has Cillian Murphy and Kenneth Branagh is the new Michael Caine.",
        "Yeah I'm wondering who Malek would play. Probably would be good as a lead scientist/engineer.",
        "He was great as Han Solo. I hate how the movie flopped in theatres because critics wrote it off, so then everyone else wrote it off without even watching it. I was in a normally packed theatre for first showing of the movie and there were 12 people! Damn shame since the movie as a whole was great as well.",
        "Allthat Eagleflight should be the next Bendywick Crumblewhack, but his career isn't big enough for it yet. I really want that to happen.",
        "🇫🇮🇫🇮🇫🇮",
        "My guess is Jack Quaid.",
        "I like her in everything else and she was alright in Black Widow but she was kind of a mess in Hawkeye. Either her acting looked shabby across from Steinfeld in their scenes or her accent was a bad idea to lean into.",
        "She’s amazing in Little Women too",
        "I am become *coughs* death, erm...what the fuck *cough cough* destroyer of *cough cough* no I can't- I can't go on. Can we do it again? *cough* It's a nice quote",
        "I am become death, the destroyer of my lungs",
        "Just finished Band of Brothers, and if that is any indication, everybody was in the 40s.",
        "[sobbing] yeah",
        "The Atomic Bomb will kill Oppenheimer's wife for cheap emotional attachment.",
        "Nope (I mean, it could be, not a sure-shot trait).",
        "What?",
        "The whole 90 minutes of dialogue will be buried under explosion noises for maximal impressionism.",
        "Tommy *fookin Shelby",
        "Even Following also.",
        "Memento was awesome.",
        "Don't believe his lies",
        "Is it wrong I hope they hold it back.",
        "[deleted]",
        "I'm listening to Dan carlin's podcast on the atomic bomb project and the cold war (it's called 'The Destroyer of Worlds') for the second time and it's so so good. One of the best parts is when he describes the attitudes of Oppenheimer and his peers towards the further development and usage of atomic and later thermo-nuclear weapons. You really get the sense that Oppenheimer was just wracked with a \"what have I done\" feeling for the rest of his life.\n\nHighly recommend the podcast.",
        "I didn't even know ANYONE could make demands like these.",
        "Yep. 20% of first dollar gross is an absolutely unbelievable contract.",
        "Top result: Cillian Murphy",
        "I don’t think Tyler Glasnow (MLB pitcher) is quite famous enough to get a biopic yet, but he’s got maybe the closest resemblance to Cillian. \n\n[For reference](https://preview.redd.it/agwlvx9hsz361.jpg?width=640&crop=smart&auto=webp&s=be3f629704f62603c78f8fee4166752ea085aba5)",
        "Fun fact, Robert Pattinson gifted Nolan a book about Oppenheimer as a wrapping gift on the set of tenet. Pretty sure that’s what inspired him to make this movie",
        "Any time I watch *Stop Making Sense* with someone, they always say something along the lines of \"hey David Byrne kinda looks like Cillian Murphy!\" He's too old to do a Talking Heads biopic now but it would've been great casting like 15 years ago.",
        "Looks like Cillian Murphy in a hat.",
        "Cigs on the wrong side. Says a lot about Nolan’s attention to detail with this film. Meh. \n\n(/s)",
        "This thread is cracking me up. What the fuck is this? First there’s the whole post which is like 97% upvoted of Cillian in a hat then there’s a highly upvoted comment of the dude who Cillian is supposed to look like that he looks nothing like, then a response of Oppenheimer in a hat and Cillian still looks nothing like him.",
        "So the whole movie gonna be in b&w or just few sections?",
        "\"Nolan actually mounted one of the last IMAX cameras just 500 yards from a nuclear bomb and detonated it on purpose even though he promised he wouldn't\"",
        "Meanwhile I've mastered the atom, more than any man alive,\n\nNow I'm here to split U like 2 and 3 from 5",
        "And he's gonna destroy yet another IMAX camera because he wanted to get close up footage of the explosion",
        "And yet somehow he still had time to be a workplace menace with the lockpicking and other hijinks.",
        "His autobiography, \"Surely you're joking, Mr. Feynman!\" is an amazing book.\n\nHe was bored on the Manhattan project, so he taught himself how to pick locks and crack safes and started breaking into the classified documents safes in everybody's offices. He didn't care about the documents, he was just entertaining himself. So they upgraded the security to try to stop him, and he took joy in exploring the new challenge :)",
        "And if I correctly recall anecdotes from Surely You're Joking, who chauffeured Mr Feynman to and from his wife's sanatorium? Klaus Fuchs.",
        "I just finished Genius and couldn’t get enough of him so I just started Quantum Labyrinth\n\nSuch a fascinating fellow",
        "He was like 24 as well",
        "He was also instrumental in the Congressional hearings over the causes of the Challenger shuttle explosion. Just a fascinating guy all around.",
        "His talk \"Los Alamos From Below\" is *excellent*.",
        "There are a couple great biographies of Feynman that are absolutely worth the time.",
        "TIL the R&D centre I work for is on a road named after this guy",
        "That's a shame, Feynman's a super interesting dude, though I suppose most of the people working on the Manhattan project were interesting people.",
        "Feynman is a beloved scientist on the internet but within the project he wasn’t a major figure.",
        "Also after a major existential crisis. After the atom bomb, he'd see people building bridges and buildings and think, why? Why would they bother? Don't they know or could all be gone in an instant? \n\nNot saying you are, but we really can't blame the guy for *however* he handled his combined personal and universal grief and guilt.",
        "I'm surely serious, and don't call me honey.",
        "Nice",
        "Yeah I get he needs to tell a concise story but a nod to the origins would be more than ample and take up less than 10 mins. \n\nJust wouldn't be surprised if it's left out entirely it wouldn't be the first Hollywood WW2 film that's revised history.",
        "The thing is the story is plenty of drama on its own, Oppenheimer had an utterly fascinating life.\n\nGiven the casting of the guy who went on to ruin him, a decent part of the film will be dedicated place after the war.",
        "I know Oppenheimer was a top dog at the Manhattan Project. \nThe quote itself was said by the very strong Krishna who needed to convince a fighter who did not want to fight. That fighter was Arjuna, an archer(?) and the enemy had a lot of his family and friends he would undoubtedly need to kill in the war.\nKrishna convinces him and turns into his warrior form. He then says the \"I am death\" line. It's also implied that Vishnu said there will be no retreat and grew into an even scarier god. Krishna is depicted as handsome(and blue), and romantic.\n\nThis is oversimplified, but looks like Oppenheimer finally accepted that he and his collaborators, the physicists, all others involved, would kill a lot of people. When he saw that first explosion, there was no doubt left. The Hindu philosophy is difficult but reminds me of other religions in it's emphasis on faith, divine forgiveness, being a faithful \"warrior\" and death being impermanent. Oppenheimer did not absolve himself and died quite young.\n\n\nDropping the A- bomb was a very late action by the USA. \nAccording to reliable sources, someone important spared Kyoto because he honeymooned there and it was beautiful.(The War Secy, Stimson).",
        "\"I am become death, destroyer of worlds\", a line from the Bhagavad Gita(Hindu\nreligious text), attributed to Vishnu,\nwas what Oppenheimer said/ thought(?) when he saw the first nuclear explosion.",
        "Oy. Oi.",
        "Storp, chorlay. Thys has gon on lowng enuf",
        "*NO. FOOKIN'. FIGHTING.\n\nFIFY",
        "What about snow?",
        "No fookin nookin!",
        "That cigarette fused to the corner of his mouth at some point during Peaky Blinders.",
        "I swear this man smokes like a train in every role I can think of",
        "He’s currently going after Jon Hamms onscreen smoking record.",
        "Funny thing is, I'm pretty sure I've read that he's a non smoker. Can't stand it actually...",
        "It almost looks photoshopped in, like they took the picture and thought \"No, that's not quite right...something is missing.\"",
        "Or [a whole bunch of prosthetics](https://youtu.be/jFjO_YClDEo)",
        "You should try it out! Def grew on me.",
        "I love Peaku Blinders but \"oy am Johnny Kimba!\" is what drove me to the \"turn off previews\" button in Netflix. It's so peaceful now.",
        "It's a really good show that gets at least ten times better if you're even remotely familiar with Britain in the 20s",
        "They just started filming this week, what do you want a trailer?",
        "FYI, although you’re right about it being a short focal length making him look thinner, that isn’t the reason for the brim of the hat and his ears being out of focus. That would be due to the aperture being more open, causing a shallow depth of field",
        "An attractively skinny face. Here, he looks almost gaunt.",
        "Ol'e skinny face Murphy.",
        "I watched it for the first time completely stoned out of my gourd. The \"twist\" to the movie and how it changes tones was really entertaining for me.",
        "Have you seen Disco Pigs?",
        "Not sure as to how it was received, but I was roughly the same age as you when it released. Didn't see it until I was 15, though. That movie scared the shit out of me. Thinking about it still scares the shit out of me as an adult.\n\n28 Days Later zombies are easily the scariest zombie variant presented in modern media. They're so incredibly fast and psychotic.",
        "I saw it in a completely packed theater.  Zombie stuff wasn't *quite* as popular then as it is today though, so it wasn't as big a deal as it deserved to be.  It's still the scariest zombie film of the 21st century if you ask me.  Scared the fuck out of me in the theater, lmao.",
        "The Wind That Shakes The Barley, even.",
        "I dont recall Oppenheimer getting stabbed 23 times",
        "Yeah, holy shit lol.  Could easily be a giant troll.  \n\n\"Haha, yeeeah, ok Chris...  Kenneth Branagh *last* in a non-alphabetical cast?  Seriously...\"",
        "When I, an idiot, know almost everyone's names in a movie cast, you know it's insane.",
        "You want hell of a cast go watch the 3rd Austin Powers",
        "I feel like Hollywood is petrified of a movie failing so they just shove as many stars in it as they can to minimise risk. \n\nIt’s almost become a generic formula lately.",
        "Didn't Nolan and goransson already work together on tenet",
        "My favorite fun fact is that Ludwig Göransson did the music for Community",
        "Goransson is amazing.  As a longtime Nolan fan, I was disappointed when I heard Zimmer had backed out of Tenet in order to score Dune - but if that means that Goransson now has his foot solidly in the door to collaborate with Nolan, then that is a resound \"hell yes\" from me.  He deserves it, and I'm really looking forward to hearing what he does with Oppenheimer.",
        "Pfister really torpedoed his career when he turned to directing himself, didn't he? He went from being an Oscar-winning cinematographer to going a decade without a major credit.",
        "Where TF is Michael Caine, though‽",
        "Nolan and Bale had to be tight during the dark Knight trilogy because Bale was….Batman.\n\nBesides, it’s been a decade since Bale since partnered with Nolan, why are you surprised.",
        "Yes Kodak is the only provider of film stock for motion pictures. I forget which year Fujifilm cut off their production.",
        "Yes all this is true, however imax generally says well handled and exposed 15 perf will come out to a “natural” 12k and that is the currant cap on scanning. And since Nolan likes his films sharp they are generally pretty consistent when it comes to the resolution. \n\nWhat is arguably more important is the color depth, digital scanning and projection caps out at 12bits, which is a lot, however imax estimates their film stock could be scanned out at 24 or 28 bits if the technology were available.\nThis means a film print will be showing a much greater range of color then any DCP can.\n\nIn general the variation in resolution and bit depth is not as noticeable as digital because of the organic nature of film. So our eyes generally read it as more natural.\n\nThis is all assuming someone is watching projected in 15 perf 70mm film print. Where the benefits are most apparent. I was fortunate enough to see Dunkirk on a 15 perf film print and a 5 perf regular 70mm film print. And besides the smaller framing the resolution difference was noticeable. (The later was a smaller screen placed farther from the audience while the full imax was very close and 90 feet tall.)",
        "Lol probably, though Nolan’s films are mastered basically just for imax so it will probably be the most audible version released.",
        "*token",
        "YOU WERE ONLY SUPPOSED TO BLOW THE BLOODY DOORS OFF!",
        "Yo",
        "The bomb... the size of tangerine.",
        "My heart can't take the thought of no more Michael Caine : (",
        "The child was holding a tangerine the size of a tangerine.",
        "T-5\n\nT-4\n\nT-3\n\nT-2\n\nTea break\n\nT-1\n\nBoom",
        "Corpse on the beach: Michael Caine",
        "He’s fortis leader, a pilot you only hear on the radio in the dogfight segments.",
        "most recently i saw him in Guy Ritchie's *Wrath of Man*, which came out last year",
        "Almost.  He did Lucky Number Slevin in 2006, and 30 Days of night in 2007, and Bunraku in 2010. But outside of that was a bunch of stuff I've never heard of.",
        "I think he had a cable series... Penny Dreadful",
        "got married and moved to london i think. and basically just chilled out lol. i think he talked about when he was doing press for the guy ritchie film.",
        "Saw him in a movie called Target number one from 2020. Pretty good, first movie I've seen him in since, ye quite awhile.",
        "David Krumholtz and Christopher Nolan, not something anyone would've predicted.",
        "He's actually reprising his Freddie Mercury.",
        "Fermi, maybe?",
        "The critics had little to no contribution to that films failure. It was mostly due to a complete lack of successful marketing and the fallout after the Last Jedi.",
        "I thought they wrote her character a bit different in Hawkeye vs. Black Widow so that’s what stuck out for me",
        "Nice Coat 🧥",
        "I am become cancer, destroyer of lungs.",
        "Tbf It’s only happened in 4/11 movies, and not in any of the past decade. Felt like an early career trend more than a long-standing one.\n\nEdit: also I just looked it up and his first girlfriend commits suicide 5 years after they broke up. He died 5 years before his wife did. It doesn’t seem like it plays to any trope.",
        "Now you can’t say I spoiled",
        "Is it cheap emotional attachment if it's what literally happened in history? lol",
        "Shoddio mixing",
        "Boi oodah of the PEYKEY FOOKIN BLOYNDAHS",
        "Peeky fookin' blindahs!",
        "Or Doodlebug",
        "Lenny!",
        "I almost don't want to watch any trailers in case they say the line. I want to hear it at the cinema, in front of an IMAX screen.",
        "\"Now I am...\"\n\nCut to logo",
        "Murphy definitely has the range to pull it off. Id be shocked if we dont see an Oscar nom for him with this movie.",
        "Amazing podcast. Dan Carlin is fantastic",
        "Steven Spielberg, James Cameron, and now Nolan can get anything they want from a studio. That happens when you make massive blockbusters that also happen to be critical darlings.",
        "what does that mean?",
        "Cillian Murphy as the lead role in a Cillian Murphy biopic would be inspired casting",
        "Fuck, that made me laugh",
        "Damn that’s pretty good. But you’d probably need 28 Days Later/Batman Begins-era Murphy",
        "Fuck it, make one anyway.",
        "And he didn't even get a role. Rough.",
        "They did name drop the Manhattan Project in that movie too",
        "He is having one hell of a career since twilight.",
        "I mean… [I think they look kind of similar in some photos.](https://deadline.com/wp-content/uploads/2021/10/Cillian-Murphy-J.-Robert-Oppenheimer.jpg) I suppose it’s subjective",
        "Reminds me of HBO posts on the TLOU subreddit, where folks spend inordinate amounts of time convincing others (and presumably themselves) that such-and-such looks like so-and-so. And in this case, I can't imagine that most people, even those who know who Oppenheimer was, have a great mental image of his face stashed away.",
        "Perhaps a wee bit of mar-ket-ing presence in these threads",
        "Probably sections. Kodak does not produce a B&W movie film in 65mm format, they are currently all in color. But they do have a 35mm film that they could enlarge and respool for specialty orders.\n\nThe cinematography crew working on “Euphoria” did the same thing with a special batch of Kodak film for season 2, just not in IMAX quality",
        "[removed]",
        "That shit was hilarious to read. Figuring out how many people didn't change their locks/codes and lockpicking to leave notes in his coworkers cabinets (to the extent one was convinced they had an intruder/leak) is top-tier trolling.",
        "If anyone wants to listen to him tell some of his stories, check this video:\n\nhttps://www.youtube.com/watch?v=uY-u1qyRM5w",
        "Agree, fantastic book and amazing person.",
        "Idle hands are the Feynman's playground.",
        ">So they upgraded the security to try to stop him\n\nI think with another site they just told their staff not to let Feynman in their offices.",
        "You guessed it...\n\n\nFrank Stallone",
        "As I recall, he mentioned he would sometimes hitch a ride with him into town.  In hindsight, he realized that was the same car he was using to smuggle secrets out, possibly in some of those same trips.",
        "This guy Fuchs",
        "This was referenced in \"The Hunt For Red October\".\n\nRamius : \"It's an ancient Hindu text, quoted by an American\"",
        "Arfur gang fur loyfe!",
        "*NO. FOOKIN'. FOIGHTING.\nFIFY",
        "No... No... No.... No cocaine.... No cocaine. No sports. No telling fortunes. No racing. No fucking sucking petrol *slaps Finn* out of their fucking cars!",
        "Vestigial butt.",
        "I always wonder, are those real cigarettes or prop?",
        "Does the fear spray in Batman Begins count as smoking?",
        "Herbal cigarettes is what I read in a recent article.",
        "Or nothing in that scene from 28 Days Later",
        "Well that was intensely strange, even by Rubberbandits standards.",
        "Shit was that really Cillian Murphy as Dertie Ahern?!",
        "Just be careful you don’t watch too many episodes in a row… I called my mother and I found myself accidentally saying “fookin” way too much",
        "It's currently the 20s here in Britain.",
        "No, I'd simply settle for less *PR noise*.  \n\nBecause that's all this is: some hack at the studio's preferred PR firm pushed a button, and this sub (as usual) eats it up even though it provides no insight into the film itself or filmmaking in general.  \n\nIt's a commercial that mentions the product name, but really doesn't tell you what the product does.  Should one become excited over that?",
        "It could be that they used a long lens for the portrait.\n\nEdit: I was wrong.. [Definitely a wider lens with low f stop.](https://londonschoolofphotography.com/wp-content/uploads/2018/06/different-lenses-1024x1024.jpg)",
        "This looks like basically every picture of Cillian Murphy I've ever seen.",
        "That twist actually makes my stomach turn no matter how many times I watch it. It’s quite eerie.",
        ">Not sure as to how it was received\n\nit changed the entire zombie genre (fast zombies) and helped launch Boyle for the next decade",
        "IKR?! Makes the slow ones look tame...",
        "Friends, Americans, countrymen. Lend me your ears!",
        "I mean the government did metaphorically stab him in the back.",
        "I’d be more impressed if Branagh was 16th on a cast list that was sorted by alphabetical order tbh",
        "Yeah the further I got the more I was like “okay I’m being trolled here” but if legit… whoa",
        "Oh, I must be a greater idiot than you",
        "Or that everybody and their dog wants to work with one of the best blockbuster directors? It’s fucking Nolan, the cast doesn’t sell the movie.",
        "I ain't complaining",
        "They did. And while the movie was good, (it wasnt great like i hoped), the music was awesome.",
        "It’s honestly where I know him from LOL also because of Ludwig and Childish Gambino stuff",
        "\"Greendale is where I belong\" is such a relaxing listen, I love it",
        "Community was an all-star team, in front and behind the camera. From Harmon (now doing Rick and Morty), the Russo Brothers, Justin Lin, Ludwig, to Glover, and the rest of the cast, all doing interesting stuff all around. Hell, even the fucking dean has an Oscar.",
        "I think he did new girl as well. Very weird seeing his name pop up during rewatches.",
        "He also did Bad Trip lol.",
        "Funnily enough it worked out great for both films - Goransson’s score for Tenet was so propulsive and interesting and industrial, and Zimmer nailed this incredible otherworldly feel for Dune that completely fit the massive scope of the story.",
        "Wally Pfister is still in the industry and making good money too: http://www.resetcontent.com/wally-pfister\n\nJust because he makes commercials doesn't mean he isn't actively working. And it's related work - Ridley Scott still does it through his company Ridley Scott Associates.",
        "I hope they get together once again. They were a masterful duo.",
        "one day i saw a child playing with a uranium sphere the size of a tangerine",
        "Jesse what the fuck are you talking about",
        "Michael Caine and Anthony Hopkins are two celebrity deaths I don't ever want to read about.",
        "You missed the Tangerine",
        "That was good, with Jason Statham",
        ">Guy Ritchie's Wrath of Man\n\nProbably my least favorite Ritchie film; felt like he was trying to ape the tone of Sicario. Not a fan of the dialogue either. Pretty much none of the wit that I expected from his writing. A competently done action flick, but that's it. Holt McCallany was probably the best part.",
        "He's also in the Guy Ritchie movie that is coming out this year.",
        "Penny Dreadful wasn't unheard of. Not a movie but enough that he didn't dissappear.",
        "Man Bunraku was great.",
        "Loved him in Bunraku",
        "That's right, forgot about that",
        "He's very versatile. He can do comedy, he can do drama. He worked with the Coen Brothers by making a brief appearance in \"The Ballad of Buster Scruggs.\" He was on HBO with \"The Plot Against America.\" He gets a lot of work. He's not just the guy snorting cocaine in Superbad, lol.",
        "If it was released in december instead of may it probably wouldnt have been hit as hard, it was just way too soon after TLJ.",
        "“Thanks!” - bum in Batman Begins",
        "What really? That's what happened ?",
        "I'm guessing I've told you about my condition.",
        "He's not really a professional historian and isn't 100% accurate all the time but he is at least honest about his own biases when they come up and does his best to give a complete version of history. I really love his shows.",
        "Basically Nolan will get 20% of every ticket sale starting from the film's release date continuing for whatever time the contract says. He will get the 20% regardless if the film turns a profit or not, so the likelihood of \"Hollywood accounting\" screwing him over is minimised. Not that I think any studio would dare to screw Nolan over.\n\n20% first dollar gross is a deal that only people with MASSIVE star power like Tom Hanks, Steven Spielberg, Leonardo DiCaprio and like Arnold Schwarzenegger in his prime can get.",
        "Fuck it, we'll do it live",
        "Honestly if he was like a decade older, Pattinson would’ve been a great option for Oppenheimer. But honestly this role was practically MADE for Cillian Murphy",
        "Absolutely one my favourite actors working today. Cant wait for the Batman! I’m watching Batman returns right now lol",
        "He definitely looks more similar with this comparison but I didn’t see it in the picture posted.",
        "If you're Nolan you can probably get Kodak to crank out a batch of whatever. Plus putting B&W emulsion on 65mm stock is a fairly straightforward request, assuming the 35mm isn't cut down and perfed from a wider bulk reel already. He probably could shoot the whole thing on 65mm Kodachrome if he really wanted to flex, lol.",
        "65mm is the same as 120 film of which Kodak makes plenty of Black and White film types. All you need is to add perforations to it.",
        "It must leave you enraged, when you compare our talents.\n\nBecause in this battle, there is no balance.",
        "See also deciding the guards need to know about the hole in the compound fence, and then (very scientifically!) wondering how long it would take them to notice he was only ever going past them in one direction...",
        "One of the funniest parts of that was when he visited another facility and did the same shit and notified the leadership of how easy it was to get in to their filing systems, they didn't implement the measures he recommended, they just told everyone not to let Feynman in their offices lol",
        "IT HIS WEDDING DAY YA FOOKIN KNOW!",
        "Props. Instead of tobacco they used blends of herbs so the actors can “smoke” but not get lung cancer etc.",
        "In my book it does. Don’t think he smokes in Sunshine tho",
        "Or a lovely pretty dress like in Breakfast On Pluto",
        "Or an 'ohmygodtheykilledkenny' [space suit](http://www.sciencefictionarchives.com/en/collections/71/sunshine-space-suit-original-costume)",
        "Their [other new one](https://youtu.be/SAXGmyQGkHI) is a banger though!",
        "The economy is in the shitter, crime is through the roof and the colonies all thoroughly dislike the British government, it's definitely the 20s in Britain",
        "It shows you what the star of a movie called Oppenheimer about J Robert Oppenheimer will look like as J Robert Oppenheimer. That’s really all there is to know about the product. “This is a movie about a guy. Here’s the guy the movie is about.” That’s the whole sell.\n\nAnd considering Cillian Murphy and the movie have been trending today on socials and people are engaging with it online (including you), it’s done it’s job, no? If it annoys you you could just not engage with it, because building hype and getting people to discuss a dude’s face a year and a half before the movie in which it appears comes out (like we’re doing right now) is literally the job of a marketing department and they’re doing it well and we’re participating so they probably won’t change strategies any time soon.\n\nEdit:\n> It's a commercial that mentions the product name, but really doesn't tell you what the product does.  Should one become excited over that?\n\nAlso, this sub is quite flip-floppy over what marketing is too much and what’s not enough. People always complain that trailers spoil too much and that marketing should just convey tone, but other times a [B&W recreation of the central famous historical figure](https://imgur.com/HxjESKx) is apparently useless about indicating what this film will be.",
        ">Should one become excited over that?\n\nSure, why not? It seems that people like Cillian Murphy and want to discuss him and the rest of the cast. People like speculating.",
        "First Look at \"Movie\". And it's just a picture of the actors and nothing special. Front Page. 20k upvotes.",
        "Ultra-wide lens up close will do this. Also, it makes your nose look bigger. I'm guessing anywhere from 12mm-24mm basically touching the lens.",
        "Cast for Nolan's following film: \n\n* Amy Adams\n* Ben Affleck\n* Jessica Alba\n* Mahershala Ali\n* Jeniffer Aniston\n* Stephen Ammell\n* Will Arnett\n* Alec Baldwin\n* Christian Bale\n* Jason Bateman\n* Kate Beckinsale\n* Krysten Bell\n* Annette Bening\n* Hally Berry\n* Cate Blanchett\n* Kenneth Branagh",
        "Same, I only recognize the first 4 in that list..",
        "I mean almost everyone on reddit is an idiot so I wouldn't sweat it.",
        "It can be both you know",
        "If the cast didn't sell the movie, we wouldn't have promo posts like this to drum up interest",
        "Completely agree.  Everyone came out a winner here.",
        "Agreed. As much as I love Zimmer, Goransson was the better fit for the specific project of *Tenet*.",
        "Oh my god",
        "https://youtu.be/ZS6bD3SpIvk",
        "This is why I Reddit",
        "She was only 16 years old!",
        "We are still finding some of the uranium cubes from wartime Germany. Great paperweights if they'd stop the discoloration! Also don't lick them.",
        "Yeah Mr White, Science!",
        "The dialogue was absolutely shite. Couldn’t believe it was a Ritchie movie tbh",
        "I was hoping someone would bring up Penny Dreadful. He was great in that!",
        "Always love Krumholtz. Just has a nice presence on screen. Top tier character actor of his generation.",
        "They have a big fight and she goes to the Trinity test site and unplugs the bomb.  Then she feels bad after finding out it was all a misunderstanding and returns to Trinity to plug it back in with 5 seconds to go before the test.",
        "I don’t know if you’re kidding, but no. That’s not what happened.",
        "Yes, he forgot that his wife was strapped to the atomic bomb as it detonated in Hiroshima. He was a very forgetful man, and the movie will explore that through a very complex narrative structure.",
        "Only every time I see ya!",
        "Literally lol over this.",
        "I don’t think inhaling any kind of smoke is safe but at least they won’t be addictive",
        "\"According to Boyle, the funnel shape of the helmet was influenced by the character Kenny from South Park.\"\n\nYou weren't kidding.",
        "Sunshine was a fucking awesome movie and doesn't get the praise it deserves.",
        "It’s just the default tone of Reddit. \n\nThese aren’t actual problems, it’s just most people here can only speak in a contrarian voice. \n\nComplaining is the lowest common denominator of relatability, which in turn makes upvotes, and so Reddit intrinsically encourages that kind of speaking voice with its voting system.\n\nIt is insufferable, seems to have gotten worse recently, but unfortunately there’s not a lot of alternatives for these sorts of communities.\n\nPersonally I think ignoring it is best. If you debunk every opinion like that, you’ll spend all day at it and get nothing in return.",
        "So he's going to look like himself in a hat\n\nHow whelmed should I be?  Over? Under?",
        "Bitch!",
        "A token funeral is held. There is nothing to bury. A circulatory system is seen, by the perimeter fence. A few days later, a partially muscled skeleton stands in a hallway, and screams for a moment before vanishing.",
        "You can hold the smoke in your mouth/throat without inhaling it. Maybe not the most ideal but it’s a hell of a lot better that putting it in your lungs.",
        "Bingo. You want to find the bad in *anything?* That's easy, just put it on reddit.",
        "Personally, I'm underoverwhelmed. Some people might be overunderwhelmed, but me? Nah.",
        "Biznatch?!",
        "Bro",
        "Yeah I’m sure they do that when possible but there are scenes where it’s clear they took it to the lungs",
        "HE CALLED MY ABUELITA BIZNATCH!!",
        "If that wasn’t quoted from another film it would be quite the cryptic yet strangely beautiful comment."
    ]
}