{
    "Official Poster for Christopher Nolan's 'Oppenheimer'": [
        "\"I know Scarecrow is a smaller role, Cillian, but stick with me and I'll put you in a lead role in maybe two or three or seventeen years.\"",
        "I can already not hear the dialogue over the amazing visual effects",
        "So many people \"joined\" this movie that I didn't know that Matt Damon or RDJ were in it.",
        "This is an actual pic of Cillian Murphy watching Christopher Nolan detonate an actual bomb on set",
        "The second entry in the series of movies where Cillian Murphy ends up staring at blindingly bright things.",
        "I’m just happy for a poster that isn’t floating heads.",
        "ZE GOGGLES DO NOTHING!",
        ">\"Now I have become Deaf, destroyer of words.\" - \n\nC. Nolan.",
        "[deleted]",
        "This film feels like a special event In the HOLLYWOOD. Like something really special, IDK why but It does.",
        "In theaters July 21, 2023\n\nA new IMAX trailer is playing before Avatar starting tomorrow.",
        "The new Maxell Cassette Tape ad.",
        "I hope this is another great movie featuring Cillian Murphy staring at bright lights",
        "The Trinity test was 25 kilotons. I wouldn't put it past Nolan to truck in that much conventional explosives to get an authentic experience.",
        "I am really excited for this movie.",
        "***This is Fine***"
    ],
    "Oppenheimer (2023) and Barbie (2023) open the same day. One is about the invention of the atomic bomb. The other is about a plastic doll. Guess which one stoked the most political outrage. Go on, take a wild fuckin' guess": [
        "Margot Robbie vs mass destruction weapons.",
        "Atomic bomb and blonde bombshell. I am become Doll, destroyer of young girls self image.",
        "People have waaaaaay too much time on their hands",
        "“I am become Barbie, destroyer of Ben Shapiro”",
        "Osama Bin Laden and Bratz movies next year please.",
        "Oppenheimer will stoke even more outrage once the muppets realize it doesn't actually glorify American militarism and nuclear weapons.",
        "Guess which one has full frontal nudity.",
        "Conservatives when a filmmaker that frequently discusses feminism in her films discusses feminism in her films: 🤯🤯",
        "Ah yes, one of the most politcal controversy: plastic",
        "Weirdly both of them.",
        "Shouldn't have touched east Vietnam/ west Philippines sea.",
        "Can we stop pretending that this is \"political outrage\"? The right wing grifters probably made their review videos after the first trailer dropped.",
        "I think Greta Gerwig, Noah Baumbach and Margot Robbie would all disagree that it's really about a plastic doll. Haven't seen the film but from what I've heard it does make some social statements about feminism and the patriarchy. Not defending the outrage merchants but it's disingenuous to pretend it's really a film about a doll.",
        "what outrage? I only ever see posts on this subreddit complaining about anti-barbie people but I never see anti-barbie posts",
        "Saying Barbie is about a plastic doll is like saying Schindler's list is about a factory.\n\nTotally disingenuous.",
        "To be fair Barbie is way more political than what you'd expect from a movie \"about a plastic doll\""
    ],
    "Real Footage of Robert Oppenheimer testing the atomic bomb": [
        "I think nuclear explosions footage doesn't really put into perspective how big they are. Just for comparison, this first ever test was about 25 to 50 times more powerful than the [Beirut explosion](https://thumbs.gfycat.com/CorruptGorgeousBackswimmer-size_restricted.gif)",
        "I saw Einstein in that fireballs towards the last second of the clip.",
        "The footage of Oppenheimer, himself, was not actual footage from the Trinity Test in 1945 - it is a re-enactment from 1946. The film was called *Atomic Power*.",
        "This footage is way cooler that the explosion from the movie. Idk why they just didn’t use this.",
        "It annoys me when people reduce mega-projects like this down to one person.  People constantly pin it on one guy, either a worker who was in a management position or a politician who proposed the project.  The reality is that these are the works of thousands of people, maybe more, all working from various angles.  No one person built the nuclear bomb, and calling a man like Oppenheimer its “mastermind” is unfair both to him and the many others who worked with him.",
        "Documentaries seldom explain that perhaps the hardest part of building the first fission bombs was the timing of the detonations of conventional explosives which forced the fissionable material into a critical mass that would explode rather than just heat up and melt.\n\nElectrical current takes measurable time to travel over wires to \"blasting caps\" and all of the explosions had to happen at exactly the same instant so that the force compressing the fissile material was applied evenly in three dimensions.  Today there are off the shelf timer switches capable of that precision.  The Manhattan Project had to invent them and had nothing more sophisticated than ~~slide rules~~ rudimentary early computers and analog gauges to assess and model their performance.  (Thanks to u/Newme91 for the reminder.)",
        "Big bada boom",
        "Movie was pretty underwhelming with the test lol. In the move they just did a normal explosion\n\nThey should have used CGI to make it look like an atomic bomb explosion, or they could also use this video and a bit of enhancing/CGI-ing to make it look good",
        "so did anyone die of radiation after this test? was it safe for them ? because it was the first ever nuke so i don't think they know what to expect and what distance was safe for them.",
        "She was blind but saw it?",
        "Movie just looked like a puddle of gasoline being lit on fire",
        "Miles away ,a young girl ,blind from birth ,saw the light 😬🫨",
        "Anyone else see a face at the end?",
        "My grandpa worked at the lab that Oppenheimer worked at. My dad always told me stories of Los Alamos, NM since he grew up there. My dad developed cancer at a young age and was convinced it was because of this happening near where he grew up.",
        "When does Barbie show up??",
        "Fun fact about the people at 0:05! The guy center left (Harry Daghlian) and the guy center right (Louis Slotin) would be killed later by their own hubris when testing another nuclear source, the plutonium core nicknamed \"The Demon Core.\"\n\nEach of them would test how close they could get to a criticality event by (1, Daghlian) slowly lowering tungsten carbide bricks in place around the nuclear source using *his fucking hands* and (2, Slotin) slowly lowering two half spheres of beryllium over the very same nuclear source using a *fucking flathead screwdriver.*\n\nIn Daghlian's case, he dropped one of the bricks on top of the core, causing a criticality event that released a lethal dose of radiation into his body, killing him a few days later.\n\nIn Slotin's case, the flathead screwdriver slipped from its position (Slotin had removed the protective spacers that had been placed there previously to prevent the two halves from fully closing), the spheres closed, and another criticality event occurred, irradiating Slotin and 7 other people around him. Slotin died a horrible death several days later, as well."
    ],
    "First Image of Cillian Murphy as J. Robert Oppenheimer in 'Oppenheimer'": [
        "Yep, that's Cillian Murphy in a hat.",
        "Nukey Bombders",
        "Production has officially begun on Christopher Nolan's 'Oppenheimer', set for a July 21, 2023 release:\n\n* Cillian Murphy as J. Robert Oppenheimer\n* Emily Blunt as Katherine Oppenheimer\n* Matt Damon as Leslie Groves\n* Robert Downey Jr. as Lewis Strauss\n* Florence Pugh as Jean Tatlock\n* Rami Malek\n* Benny Safdie as Edward Teller\n* Josh Hartnett\n* Dane DeHaan\n* Jack Quaid\n* Matthew Modine\n* Dylan Arnold as Frank Oppenheimer\n* Olli Haaskivi\n* Alden Ehrenreich\n* David Krumholtz\n* Kenneth Branagh\n\nThe film will be shot on a combination of IMAX 65mm and 65mm large-format film photography including, for the first time ever, sections in IMAX black and white analogue photography.",
        "Cool finally seeing Cillian as a lead in a Nolan flick! \n\n He always killed it as a supporting character in his films.",
        "Do we know if Feynman will feature?",
        "Looks great. It's fantastic to see Cillian Murphy get a leading role in a big movie, he's a terrific actor and no doubt he'll knock this role out of the park",
        "Looks a lot like Cillian Murphey with a hat on.",
        "If the picture is of any indication, this will be the first Nolan film in which people smoke cigarettes.",
        "For reference, this is a pic of the real Oppenheimer: https://content.magnumphotos.com/wp-content/uploads/2019/05/cortex/par196080-teaser-story-big.jpg\n\nThe casting is spot-on it's nuts.",
        "I’m currently halfway through the Pulitzer Prize winning book “American Prometheus” on which this movie is based.\n\nOne of the most famous traits of all of Nolan’s films continues with Oppenheimer.\nGuess what that is?!",
        "\"Now I am become Death, the Destroyer of Worlds.\"",
        "Black and White? Looks like Nolan's going back to where it all started.",
        "Cillian Murphy deserves all the praise in the world.  I feel in the mainstream eye, he's always been one role away from making it big.  You look at his fucking credentials though?  Mother fucker should be bigger than 90% of the box office with the work he's done.",
        "Serious Cad Bane vibes.",
        "I can’t see that photo of Robert Oppenheimer without hearing Jurassic Park in the background and hearing Sam Jackson go “access main program, access main security, access main program grid.”",
        "This looks great. Universal got a steal when they got Nolan to do this"
    ],
    "This is the 11-mile long IMAX film print of Christopher Nolan’s ‘OPPENHEIMER’ It weighs about 600 lbs": [
        "At what point does \"footage\" become \"mileage\"?",
        "Bro, you can’t just show the whole movie. Spoiler alert please",
        "so any imax movie screening would require one alike? somehow thought it was some huge raw file",
        "Why’s it so big",
        "Woah here I was thinking it was all digital now",
        "I miss my first job working in the movie theater when I was a teen seeing this. I have tons and tons of movie posters and still have the mylars and the film teasers for star wars and lord of the rings. Great times we watched lord of the rings and everything else a week before it came out and got to bring the bong along.",
        "I can’t wait to watch it",
        "Sex scene is 4 miles long",
        "Watch it noodle to the floor lol",
        "How the hell are these things transported? The film cans must be enormous!\n\n\\*\\*Edit: now that I think about it they probably ship a number of shorter rolls and splice them into one continuous roll. Any IMAX projectionists want to confirm?",
        "Is there a digital imax camera?",
        "Chris Nolan Oppenheimer print! His name is my name too!",
        "Wow, with nothing comparable next to it for sizing to show just how big it is, nice...",
        "Is the audio any good or is it like Tenet?",
        "The angle is confusing to a film reel noob like myself. Is it as big as a a standard frisbee? A cable satellite dish? A Korean bbq restaurant cooker thing?",
        "272kg."
    ],
    "Cillian Murphy Confirmed to Star As J. Robert Oppenheimer In Christopher Nolan’s Next Film At Universal, Film Will Bow in July 2023": [
        "Im so happy for Cillian. He’s such a tremendous talent and he finally gets to lead a Nolan film. I have to imagine he’s going to absolutely kill this.",
        "So when will Michael Caine be confirmed?",
        "He'll find a way to squeeze Michael Caine in there somehow",
        "I wonder if there’s a role for Robert Pattinson in this? I hope he becomes a Nolan regular, he was the highlight of Tenet",
        "Hoyte Van Hoyte as DP and Ludwig Göransson will score it\n\n&#x200B;\n\nhttps://twitter.com/TheInSneider/status/1446536962593144841?t=Fk9b7HpTPDw8aMETl\\_Z1fw&s=19",
        "Tom Hardy will play the bomb.",
        "So nice to see Cillian Murphy not be the side character in a big film",
        "What does \"film will bow\" mean?",
        "Man I hope this is just a drama about the manhattan project and not some tricksy sci-fi thriller somehow revolving around it.\n\nIt'd be nice to see Nolan step back from the nonsense of something like Tenet and just take a breather while not trying to constantly go bigger and more cerebral.\n\nCould be Nolan's Oscar play if he chills out with the exposition.",
        "Most exciting thing is Jennifer Lame editing again. Tenet's editing was incredible, and she proved that she can edit anything perfectly. Hereditary, Marriage Story, Manchester by the Sea, and the upcoming thriller Don't Worry Darling. So glad to see Nolan continue with her.",
        "Very interesting, super interested in this type of project. Love how Nolan uses the same actors though, thats real relationship building",
        "My mans! Even more stoked for this now. Cillian is such a talented, fascinating actor & screen presence. Probably revisit a movie of his at least once a week (Sunshine, Red Eye, 28 Things Later..) Looking forward to this!",
        "Am I missing something, was Oppenheimers life really interesting before the Manhattan Project?\n\nAlso if they don't have a Young Richard Feynman running around in the background unlocking safes and cracking wise at Los Alamo, movie won't be worth shit.\n\nFeynman life's would make a great great movie, imo.",
        "This guy played batman.. for like 40 seconds",
        "*drops bomb*\n\nBWWWWAAAAAMMMMMM",
        "It’s about time he gets the lead role. He’s fantastic in every Nolan movie I’ve seen."
    ],
    "Oppenheimer moment": [
        "Now i am become family guy the funniest of moments.",
        "What else do you expect from the guy who tried to Snow White a Cambridge tutor with a poison apple just because he hated his studies so much",
        "And this is why so many of the physicists that worked on the Manhattan Project, including Oppenheimer himself, spent much of the rest of their lives trying to prevent the weapons they developed from ever being used again.",
        "**A note**: the original \"I am become death, the destroyer of worlds\" was basically followed by \"All these soldiers you see before you will die, even if they survive this day/battle\" and it was said from a god to a young prince that was hesitant about going to battle because he didn't want to cause the death of his soldiers.\n\nOppenheimer certainly didn't miss this context; when he said it, he most likely took on the role of the prince who was told \"even if you don't do it, someone else will\".",
        "It is pretty scary to think that the only two nuclear weapons that were ever used in warfare and subsequently laid waste to the cities they were dropped on had just a fraction of the explosive power of the bombs that exist in the arsenals of nuclear powers today and even the ones that were tested.",
        "I am become Mort, destroyer of worlds.",
        "Might be an unpopular opinion, but this seems like the best timeline. It was inevitable that they'd be created, but if groups like the nazis or Soviets had gotten them first, they could've used the time before other got it to impose their global dominance and nuke anyone who resists",
        "Niels Bohr moment too",
        "While the threat of nuclear Armageddon is a bit unsettling, it did prevent direct conflict between major powers. So in that sense nuclear weapons have saved millions of lives. (I doubt the US and Soviet Union would have constrained themselves to proxy wars for a couple decades if not for nukes.)",
        "Suffering from success.",
        "America has the A-bomb!\n\n...\n\n_Oh fuck, America has the A-bomb_",
        "Einstein was ridden by guilt when it was revealed the Germans were still years from developing their own Atom Bomb when they surrendered. \n\nAfter all, he wrote that letter to Roosevelt urging him to kickstart development after he learnt about Otto Hahn's and Werner Heisenberg's research, fearing a Nazi Germany with a nuclear monopoly.",
        "Eh you could argue that the invention saved billions of lives, what with ww3 never happening. The only cost is a bit of existential dread every now and again.",
        "Now I am become Death, the destroyer of worlds",
        "\"Your scientists were so preoccupied with whether or not they could, they didn’t stop to think if they should.\" \n\n\\-That one guy from Jurrasic park",
        "Near unlimited power but at what cost."
    ],
    "New images of Cillian Murphy, Emily Blunt, and Robert Downey Jr. in Christopher Nolan's 'Oppenheimer'": [
        "[removed]",
        "The cast on this film is bonkers huh\n\nDune and This are my two most anticipated films and they both have Florence in happy days",
        "Gary Oldman confirmed in a podcast he’s in the film too.",
        "Nolan/Murphy is one of my favorite combos",
        "Why is Cillian Murphy's bone structure so perfect for playing a early 20th century working man? He looks like he spent his childhood starving in a coal mine, but is still attractive.\n\nDoes anyone know what I'm talking about?",
        "Anyone who wants to learn more about this crazy time and genius man, listen to Dan Carlin’s episode of Hardcore History called ‘The Destroyer of Worlds’",
        "[deleted]",
        "Robert Downey Jr kind of looking like a whitewashed Gus Fring.",
        "Robert Oppenheimer is one of the most fascinating characters of the 1940s and certainly of the early 20th Century. I would recommend the day after trinity on Oppenheimer. He’s extremely complicated individual who ushered in the atomic age but ended WWII. Another individual is Lewis Strauss who fits the mold of a questionable American capitalist businessman. He’s decisions would later transform into the atomic energy department and later form basis of the EPA today.",
        "Spent a full 2 minutes on the first picture saying “ok I didn’t know Mark Rylance was in this but where’s Robert Downey Jr”",
        "I was surprised to see colour. I thought the entire movie would be in black and white",
        "I hope this movie does not bomb at the box office.",
        "The second image is Emily blunt telling him he needs to get a hold of himself and get back to building a nuke",
        "God I love Cillian murphey",
        "Cillian Murphy can really transform can’t he? 😯😯😯",
        "I'll watch anything with Cillian Murphy in it. Dude is so fucking talented, it's ridiculous."
    ],
    "They have books about this David": [
        "\"The movie hasn't been released\"\n\nDo... Do people think Oppenheimer's a fictional story that's being told for the first time in this movie?\n\nEDIT: So today I learned that people thought the Titanic wasn't real until recently... jfc",
        "If you're not at war, and someone does war stuff to you, and you do war stuff back, is that a terrorist attack?",
        "Oppenheimer is a spinoff. It actually follows Oppenheimer as he travels to Tokyo to meet with a scientist who claims to have found the secret of the quantum dark matter device. Before they finish their meeting, there is a massive explosion which alters the course of the war. But I don’t want to spoil anymore.",
        "Nanking was just as deadly. And involved far worse cruelties.\n\nOppenheimer probably wouldn't have to even develop such a bomb if the Japanese didn't have the need to kill & rape everyone they could find in the first place... You know.",
        "Meh that's not clever at all.",
        "The death toll would have been much higher with an outright invasion of Japan. The world was at war and dripping the bomb was seen as the lesser of two evils.\n\nNot sure I get the equivalency with terrorism, like at all.",
        "Sovereign nations attacking other sovereign nations are not terrorists. He sounds like he doesn't know what words mean.",
        "This is western idiocy at its finest. The atomic bombs don't even come close to the fatalities of some of Japan's attacks on China (through obviously non-nuclear means).\n\nThis also ignores that Japan was making plans to drop bubonic plague bombs on San Francisco even after surrendering.",
        "Fellas is it terrorism to end a war?",
        "Dude is off his rocker, dropping a bomb isnt a terrorist attack when both countries are at war.",
        "News flash when countries go to war 1 is all you can score, like the guy said.\n\nAlso it was not a terrorist attack, they fucking dropped flyers stating they were going to bomb the the shit out of the city. Japan as a country was 100% at war with the United States, as in 100% of their cities supported the war effort. What a gaslighting fuck wad.",
        "David might be stupid but I do not agree with the bombs being terrorist attacks. With Japan's war model they would have lost so many more lives than the bombs took. It was a mercy killing if anything.",
        "Yeah, that was not Terrorism. That was war.",
        "Are Musk fans still upset that this man got his job back?",
        "I don't care about anyone still using Twitter. \n\n\nThese hot takes are just ego-hungry micro-celebrities.",
        "Calling the bombings terrorist attacks is maybe the dumbest that i read today."
    ],
    "Went to Oppenheimer today": [
        "Zero chance I could have tolerated the iPad games WITH sound. That’s absolutely nuts.",
        "And no one thought to maybe get staff involved?? This is why people think they can do shit like that in movie theaters, because no one says anything about it.",
        "People are weird, I have a 4 year old daughter and would never bring her or any other kid close in age to that movie. I would love to see it but get a babysitter. Sorry that happened to ya OP.",
        "So putting aside the crying child and the iPad and phone WITH sound, why did these people think a movie about the development of the atomic bomb was a good idea for an infant and a 5-year-old?\n\nStupid motherfuckers.",
        "I am sorry but Oppenheimer is NOT a movie to bring your kids. It is a rated R, three-hour long biopic, your kids will be bored as hell and you'll be disrupting the experience for everyone in the theatre! I understand parents have a right to enjoy movies as well but leave your kids at home, get a babysitter, ask a family member/friend for help. Your rights end where the rest of ours begin",
        "People who bring infants to the movie theater are douchebags.",
        "I would’ve gotten the theater staff or said something. Get a babysitter. This is an R-Rated movie…",
        "This is exactly why I no longer go to theaters. I’d love to see this movie in a theater but I know there’d be people bothering me and ultimately distracting me.",
        "Had something similar happen to me and my friends when we went to see Wonder Woman.\nAs the trailers are going, a family walks in, mum, dad 7-8 year old kid and a 1-2 year old.\n10 minutes in the baby cries and the dad give it his phone and puts cartoons on LOUD! \nWe were about three rows down and we could hear someone said something as the dad started shouting “your in a kids film for gods sake”.\n\nDuring the entire movie several people went to get staff, who came in, hovered at the stairs and left each time.\nNothing just nothing done\n\nWhen we left there was about 20 people complaining to the manager and this family came out shouting we were all awful humans for complaining about them and being in a kids film, we should expect noise!\n\nThank fully I’ve never had it again, but the level of entitlement was off the chart\n\nEdit: since it came up this happened at a showcase cinema in Leeds, England\n\nWe still use this as an anecdote to this day, “ that was bad, but not kid on a phone watching cartoons bad during a Film”",
        "When me and my GF went to go see Spiderman: Across The Spiderverse, there was this one dad who brought his kids in. There were being a little rambunctious, running in the ailes and stuff. Their dad tells them if they dont calm down they will walk out. They didnt and he just straight up took then out of there.",
        "Whenever I fancy seeing a film at the cinema, I just wait a few weeks for the hype to die down and then go at a weird time on a weird day (I’m lucky enough to not work a regimented Mon-Fri, 9-5) so for example I went to see Indiana Jones last week on a random Tuesday at 11:20am. Practically had the cinema to myself",
        "Why in earth didn’t you say something to them? That is grossly disrespectful to others",
        "Husband and I went to Oppenheimer on Friday. Five minutes in this big older dude behind us falls asleep and starts SNORING LOUDLY. We hate being confrontational, but damn, it was so distracting—I finally had enough and asked him to please stop and go sleep somewhere else. Thankfully he stopped after that. Like, dude, I’m sorry if you struggle with sleep apnea, but stay home if you’re that tired!",
        "Ipad kids are gonna be the cause of some awful shit in the future",
        "We saw the Barbie movie Thursday and baby Stewie sat behind us. All we heard was \"mom, mama,mama, mommy, M-A-M-A, mom, mom, mama!, mama...\" There were four adults with this little two year old. Not a single adult was paying any attention to baby stewie. \n\nTheaters should have rules that children under a certain age cannot be admitted. It's not fair to everyone else trying to enjoy the movie. \n\nOP, you truly have the patience of a saint. You should reach out to the manager. They might give you tickets so you can see the movie again.",
        "It takes a lot to get me to go see a movie these days.  People are just so self-centered.  There's always something that ruins the experience."
    ],
    "Oppenheimer gets surprising R rating": [
        "Probably from that scene where Oppenheimer goes \"yo what the fuuuuuuck\" when the bomb goes off",
        "A $100 million, 3 hour-long, R-rated biopic is going to dominate IMAX screens across the world for two weeks straight.\n\nGod-tier stuff, Nolan.",
        "\"For sexuality, nudity and profanity\" - For anyone wondering, Oppenheimer and Jean Tatlock, being played by Murphy and Florence Pugh in this movie, were actually lovers before Oppenheimer married Katie if I'm not mistaken. Probably involves some sexual content in that regard, outside of that I don't see how there's any sexuality in this story.",
        "The true cinematic innovation is Christopher Nolan's first sex scene",
        "Nolan, the king of PG-13, doing an R-rated movie?\n\nWhat is this, 2002?",
        "Do they show people dying of radiation poisoning? Because that’s pretty graphic.",
        "\"The R-rating will come as a shock to some because of the seemingly tame subject matter,...the creation of the atom bomb. \"\n\n&#x200B;\n\n\"tame subject matter\"",
        "Sexuality?\n\nNudity?\n\nIn my Christopher Nolan movie?",
        "Boy-oh.\n\nThree-hour run time;\nBig black-and-white segment;\nR-rated for sexuality, nudity and language;\n11 miles of IMAX film stock + 600 lbs\n\nNolan: Yippee-Ki-Yay, motherfucker\n\n21-07-2023\nBring the fuck on",
        ">\\- The movie is so long that prints are “11 miles of film stock” that “weigh some 600 pounds.”  \n>  \n>\\- Nolan says \"best possible \\[viewing\\] experience\" is in IMAX 70mm. That's only available at 25 theaters in North America.\n\nI'm gonna watch this on a 2015 Kindle 7\" in 540P just to spite Nolan.",
        "Oppenheimer probably hangs dong in the film",
        "Florence Pugh sex scene in IMAX 70mm!!!!!!",
        "Oppenheimer : I‘m putting together a team. \n\n\nEinstein : you son of bitch, I‘m in.",
        "Good, I was hoping to enjoy Oppenheimer without children running around the theater",
        "Everyone is thinking this thing is going to break the box office , is that based on actual tracking or just Reddit getting excited for Nolan?\n\nA three hour biopic about scientists seems like a rough sell in todays marvel/fast and furious market.",
        "Einstein gonna get nawty"
    ],
    "Saw it live.": [
        "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming)",
        "Christopher Nolan is okay with this. He wants the film to bomb in Japan (for authenticity).",
        "Japan barely teaches their youth about WWII. The average Japanese millenial hardly knows why Japan were the bad guys here. Germany on the other hand, doubled down and shows everything to their youth on full display so they learn from the mistakes of their past. \n\nJapan is honestly doing the world a disservice by banning this movie there.",
        "i heard they already saw the sequel too",
        "It would have bombed there anyway. It is a hot topic with an explosive ending.",
        "As a japanese i find this a bit funny.. japan can be a bit hmm i dont know how to say it they avoid such topics instead of facing it like the germans.. like i heard there's no one that hates the nazis more than the germans.. wish we could actually admit and face facts instead of avoiding it and hardly teaching the new generation? sorry my english sucks so i cant really put what i think in words",
        "The ones who will want to watch it will pirate it.\n\nIt's a good movie btw.",
        "nah they had the ending spoiled and are malding.",
        "Why does that bomb look like Charlie Brown?",
        "Twice",
        "fake news",
        "It is satire.",
        "Experienced it in 5D",
        "Did they really not showing it?",
        "This actually took me like a minute to get.",
        "Damn that is a vicious burn!"
    ],
    "Matt Damon Calls Off ‘Oppenheimer’ vs. ‘Barbie’ Social Media Rivalry: ‘People Are Allowed to Go See Two Movies in a Weekend’": [
        "I was under the impression it was being promoted as a double feature.",
        "I don't think Matt Damon understands the joke.\n\nJust like DOOM x Animal Crossing. It's not a competition, just funny.",
        "Everyone I know is hyped for both anyway. This rivalry is an illusion.",
        "In today's economy?\nNo, Sir, I am sorry, I still need to pay rent!",
        "Ben Affleck Reignites 'Oppenheimer' vs. 'Barbie' Social Media Rivalry: 'Who The Fuck Watches TWO Movies in a Weekend?'",
        "Now if you have a family of 4 or took Mat Damon's investment advice there's no fucking way you can afford that, but he's right. It is possible to see 2 movies In a weekend",
        "Don't tell me what to do matt Damon.",
        "Hah. This motherfucker thinks I can afford to see two movies.",
        "This shouldn't turn into a rivalry, this could and should be a Doom Eternal x Animal Crossing: New Horizons situation. Two movies that will be forever intertwined, Barbenheimer.",
        "Yeah but a lot can’t afford it.",
        "This is Coke and Pepsi hype where fans want both to succeed",
        "This was even more of an issue when Charlie Day and Glenn Howerton released movies Fool’s Paradise and Blackberry respectively, on the same day a week or two ago. They said, “go see both, but I wish it wasn’t on the same day.”",
        "these comments make me feel so validated lol i said “in this economy??”",
        "Apparently he didn’t get the memo, we are no longer allowed to enjoy or hate two different things at the same time. It goes against the extremely adversarial way of 21st century living.",
        "Two movies in a weekend? Who the shit has time and money for that, Matt? Mash them up now and save me 2 hours of life. Have Gosling’s abs be the actual bomb.",
        "2 tickets a popcorn and 2 drink is like 40 bucks , fuck off"
    ],
    "The upcoming movie \"Oppenheimer\" (2023) is projected to do well in the U.S., but bomb in Japan.": [
        ">Nolan tracked down and used actual 1940s-era audio equipment to record dialogue and create sound quality authentic to the time period.\n\n>After doing this for years, he applied it to the production of Oppenheimer.",
        "Hey who let Jimmy Carr on Reddit?",
        "The upcoming movie \"Sunshine\" (2007) Cillian Murphy is looking at a big fireball",
        "Actually its predicted to be a huge hit in select cities.",
        "Can't wait to not hear any of the dialogue in this one, too.",
        "Funny, the first name I see is Cillian Murphy’s and I think, “Is this a Nolan film?”",
        "And like Morbius, they might try re-releasing it so it can bomb a second time.",
        "This is because the film is considered Sci-Fi in Japan as World War 2 history has been completely erased from textbooks and school education in their curriculum.",
        "Is that you dad?",
        "Well done dad",
        "I don't get it\n\nedit: I get it",
        "As a Japanese I’m offended…. But god dam it as a lover of comedy I applaud you sir",
        "I just spit out my coffee lmaoooo",
        "#tromboneslide",
        "i guess they need to relearn a lesson to never wake a sleeping dragon",
        "Dr. Nefario?"
    ],
    "New Image of Cillian Murphy as J. Robert Oppenheimer in 'Oppenheimer'": [
        "A black and white movie with Cillian Murphy!?  But then, how can I get lost in his ocean blue eyes!!??",
        "In Theaters July 21, 2023\n\n[Official Teaser](https://www.youtube.com/watch?v=hflCiNtY6MA)\n\nMain Cast:\r  \n\r\n\n* Cillian Murphy as J. Robert Oppenheimer\r  \n\r\n* Emily Blunt as Katherine \"Kitty\" Oppenheimer\r\n* Matt Damon as Leslie Groves\r\n* Robert Downey Jr. as Lewis Strauss\r\n* Florence Pugh as Jean Tatlock\r\n\nAdditional Cast:\r  \n\r\n\n>Rami Malek, Benny Safdie, Josh Hartnett, Dane DeHaan, Jack Quaid, Matthew Modine, Dylan Arnold, Olli Haaskivi, Alden Ehrenreich, David Krumholtz, Michael Angarano, Kenneth Branagh, David Dastmalchian, Jason Clarke, Louise Lombard, Scott Grimes, Christopher Denham, James D'Arcy, David Rysdahl, Guy Burnet, Danny Deferrari, Josh Peck, Harrison Gilbertson, Emma Dumont, Matthias Schweighöfer, Gustaf Skarsgård, Devon Bostick, Alex Wolff, Tony Goldwyn, Trond Fausa Aurvåg, Gary Oldman, Josh Zuckerman, Olivia Thirlby, Casey Affleck",
        "By order of the Manhattan fookin Project",
        "Not going to lie it would be pretty cool if everything was in black and white until the explosion",
        "My uncle is actually the guy who wrote the book the move is based on. His name is Marty Sherwin and he just died this year from cancer. I can’t stress how awesome it is to see one of my uncles books turn into a film. Plus the movie is supposed to be great, everyone should go see",
        "Peter Bogdonovich would often quote Orson Welles and one of the things Welles would say is that \"every performance is better in black and white\"\n\nChristopher Nolan shooting IMAX in black and white and Cillian Murphy's acting may just be the winning combo",
        "I just saw the production budget for this film is \"only\" $100MM. I feel that's exceptionally light for a Nolan movie.\n\nEdit: It IS exceptionally light, considering 50% of the budget went to procuring several nuclear warheads previously thought to be missing. But no worries! Nolan will sell the remaining nukes at a profit for the studio, similar to how he sold the corn produced for *Interstellar*.",
        "Nolan pushing boundaries once again. First feature to shoot IMAX in black and white. Looks really clean so far",
        "Gotta say. Really interested in seeing how Nolan does a film with little to no action set pieces/spectacle . I think the last one was The Prestige?(even Interstellar had a lot of spectacle). It's been more than 15 years since that.",
        "If I had to guess, this is possibly a snapshot of Oppenheimer before he goes into court because he was accused of being a communist. I hope I’m right, cause that is a huge part of Oppenheimer’s story",
        "I decided to delete TikTok after seeing a comment on a video about Oppenheimer. It said:\n\n*”This movie is clearly for a niche demographic. I’ve never heard of Oppenheimer and doubt I will enjoy this film. 🤡💀👎”*\n\nThat’s when it finally clicked for me how awful TikTok really is.",
        "Peaky Heimer",
        "Take a little walk to the edge of town",
        "I really liked him in Peaky Blinders. Hope he's as good in this too",
        "Producer: so what do you have for me?\n\nNolan: I've got a star studded cast in mind for a movie about Oppenheimer developing an atomic bomb.\n\nProducer:  sounds great! But are you... going to actually drop a ...\n\nNolan:\n\nProducer: ... beats CGI I guess.",
        "Cillian Murphy as main actor for Nolan he really deserves it"
    ],
    "I just wanted to watch wholesome bomb man movie": [
        "I just wanted to watch a wholesome movie about a man experiencing existential dread from inventing the most destructive weapon in history",
        "Just wait for the Paw Patrol movie. I heard it's gonna be extra spicy",
        "Bro I watched The Wolf of Wall Street with my parents...\n\nDo not recommend, longest three hours of my entire life I swear",
        "No cillian banana unfortunately",
        "Watch them anyways. Stare your family directly in the eyes the entire time. Keep chanting “it’s natural it’s natural it’s natural”. Do NOT blink. It’ll help keep thing chill and not awkward so everyone has a good time.",
        "Christopher Nolan (Apparently) said that there was no CG in the movie...",
        "THREE FUCKING SCENES WITH MY NEW GIRLFRIEND. 3!                                                    holy shit this blew up this is my first time on reddit, thanks for the upvotes.",
        "You’re taking your family to R rated movies I think you should accept that risk.",
        "Same I just want to watch a wholesome movie about the invention of a weapon capable of vaporizing small cities 😔",
        "It’s interesting how it’s socially acceptable to watch a movie about nuclear genocide, but the moment there’s sex that’s when it becomes too much.",
        "Never watched the movie. I have no effing idea on where three (3) sex scenes could be part of such story",
        "People from conservative countries: wait there’s sex scene? All Ive seen was only a black dress",
        "If I wanted to see sex I would watch porn",
        "3? I only remember 2",
        "I also think sex scenes can throw off a movie or a show. Don't say that about \"the last of us\" tho. People freak out",
        "Just my opinion but, honestly I dont think that the scenes where pointless. I mean Jean Tatlock was an important part of Oppenheimers life. I saw the movie and those scenes actually contributed to his life, his decisions and his Story. His affair with her contributed to his relation with his later wife, it contributed to his appointment at the Manhatten Project and his later discreditation, his trial and so I dont think it was wrong to include them."
    ],
    "Barbie (2023) is anti-men, or something. Lots of men seem to be upset. I wouldn't know because I haven't watched Barbie, because I am a man, and men don't like Barbie. Men like nuclear war, radiation poisoning and 200,000+ civilian casualties, which is why I watched Oppenheimer instead.": [
        "I don’t live under the tyranny of “Or”. I’ll be seeing Barbie “And” Oppenheimer.\n\nAlso Ryan Gosling just doesn’t make bad movie.",
        "You know, I’ve seen a lot of people dressed up in bright pink to go see the Barbie movie, but nobody wearing a fedora and boxy suit jacket to go see Oppenheimer.",
        "Men don’t like Barbie’s, men like the piercing blue eyes of Cillian Murphy. They make us feel safe but also a little scared, but I’m a good way.",
        "Men like horses",
        "You didn’t watch Barbie because men don’t like Barbies. \n\n\nI didn’t watch Barbie because I’m broke. \n\n\nWe are not the same",
        "Real men suffer existential dread after seeing Oppenheimer!\n\nOH GOD WE’RE ALL GONNA DIE",
        "I watched Barbie and loved it, though I am biased because the movie is about (and stars) literally me",
        "What man goes into watching a Barbie movie expecting it to be not about women",
        "I operate under the assumption that \"and\" is still a viable coordinating conjunction, and thus, I have watched Oppenheimer AND will now watch Barbie. \n\nBTW, Oppenheimer was really fucking good.\n\nEdit: Now I've watched Barbie, and gotta say the movies could not be more different. As for entertainment, Barbie is easily my favorite movie of the year; the attention to detail and humor was WAY beyond what I was expecting. Both Oppenheimer and Barbie are 10/10 in my book. Both crushed it.",
        "Watched Barbie this afternoon. As far as I can tell the message is that horses are an extension of masculinity and honestly I agree.",
        "Thing is, Barbie is for all genders. I can tell because I’m a man and I really enjoyed the Barbie movie.",
        "Just saw Barbie. I’m a middle aged white male and thought it was outstanding. Definitely gonna be a lot of man babies needing their binkies though.",
        "Can confirm. As a nonbinary person who is also both a man and a woman, I'll have to watch Oppenheimer and Barbie at the same time while subway surfers plays on the middle.",
        "feel like I’ve seen more people rant/cry about people crying/ranting about this movie than people actually crying/ranting about this movie",
        "Please don't tell me that guys are expecting a movie about a Barbie doll to cater to a male audience. I'm not saying guys can't go or won't enjoy it, I'm just saying that you guys aren't the primary target audience.\n\nI'm sure the bomb man is a good film as well though",
        "Dude, stop with the negative Kenergy. You are Kenough."
    ],
    "Christopher Nolan Bombshell: Director Talking To Multiple Studios On Film He’ll Direct About J. Robert Oppenheimer & Development Of The A-Bomb In WWII": [
        "This son of a bitch is going to try to detonate a real nuke, isn’t he?",
        "Sounds like it's going less of a high concept big budget action movie and more of a straight forward period drama. It's the smart direction to go for Nolan. Also, going by that photograph surely Mark Rylance will be cast as Oppenheimer",
        "Interesting, especially considering Oppenheimer is directly referenced in TENET",
        "I'm calling it now: Sony is going to pick this up.\n\nThey got QT when he shopped Once Upon a Time in Hollywood around town, and Sony has been very vocal about protecting the theatrical window.",
        "It took me way too long to understand they were just making a pun.. I was like, how is a movie director making a new movie considered a \"bombshell\" lmao....",
        "He'll probably try and use a real nuke instead of CGI.",
        "I’ve read dozens of books on Oppenheimer and the development of the atomic bomb (my favorite being ‘The Making of the Atomic Bomb’ by Richard Rhodes) and put some of my best writing into 70+ pages (thus far) of a script based on this man and this project. Painful to see this announcement today. Almost surreal.",
        "WB: \"You leaving us?\" :'(\n\nNolan: \"Don't talk to me or my brother ever again!\"",
        "I dig it, not sure how you do this in IMAX since it's likely to be more of a straight-up drama than anything he's done in the past decade plus.\n\nBut honestly I'd kind of love to see him do a mid-budget thing a la *Insomnia*, I'm pretty sure he's made quotes along the lines of as long as he gets massive budgets he's going to make big ideas for the big screen and I certainly don't fault him that. \n\nBut would be very curious to see him scale back a bit from what he's been doing of late.\n\nHaving said all this, we'll probably get IMAX footage of nuclear testing, right? Can't wait to see Bikini Atoll in all its IMAX glory, and a POV shot from/of the nuke.",
        "I'd watch that. Anything about the atomic era (especially the dangers of it) it is something that peeks my interest.\n\nAlso, if it weren't for the miniseries that recently came out - Nolan would have been a good filmmaker to make a Chernobyl film",
        "I’ll see anything this man puts out opening weekend from here on out. He hasn’t disappointed me yet.",
        "I wish he would make a small scale film like Memento again.",
        "Anybody who is questioning Nolan's ability to make a good drama should watch The Prestige.",
        "The fact Nolan is considering other studios is wild. WB really needs to be nuked and start over",
        "I’ve wanted this movie forever. Oppenheimer was a fascinatingly complex person. I hope Nolan does this justice.",
        "**It was cheaper to build and detonate a real atomic bomb than pay the special effects artists.**"
    ],
    "Picture of J. Robert Oppenheimer taken as he completed the final design of the atomic bomb. (1944)": [
        "He's really smug about it too.",
        "\"Now I become Death, Destroyer of Worlds.\"",
        "That's what you get when you give the smartest scientists in the world a bunch of funding and resources. ",
        "Herobrine = hitler",
        "u/title2imagebot",
        "More accurate if it was Nobel (he invented dynamite)",
        "Make me understand this meme",
        "That's hot 👌",
        "Penheimer's inventions were OP.\n\nThat's why he changed his name.",
        "Modded minecraft is great because you really can build a nuke but the downside is that you have to learn a minecraft version of nuclear physics and you weren't trying to build a nuke, you were trying to build a nuclear power plant in the middle of your base since transferring power causes massive server lag, and also the nuclear element is extraneous because it's really powered by chickens endlessly giving birth and dying. Then you delete your world and am become death, destroyer of worlds.",
        "\"Vishnu is trying to persuade the prince. And, to impress him, takes on his multi-armed form and says: Now I have become Death, the Destroyer of Worlds.\"",
        "[even better](https://www.reddit.com/r/MinecraftMemes/comments/al3a6j/that_oh_so_terrible_bomb/?st=JRI57MIX&sh=feef126e) ",
        "Harnessing the power of 10000 creepers and dropping it on Hiroshima.",
        "I see what you did there",
        "Salute to the greats 🙌🏻",
        "A true genius"
    ],
    "Power went out 20 minutes into Oppenheimer. Waited about an hour for it to be restored and movie restarted, only for the movie to restart again automatically at the next show time and being kicked out of the theater. Didn’t get to see the last 30 minutes or so.": [
        "Refund!",
        "The bomb dies",
        "I was at the midnight showing of Star Wars Episode II with my dad way back in 2002 (I was in high school) and this happened before the movie started. Power outage and we all had to leave the theatre and go home. It sounds dumb now but these midnight showings were a big deal, I remember my dad had gone days ahead and got the tickets for us. I don’t remember if we got a refund, but 17 year old me was incensed.",
        "Refund and free ticket",
        "hate to ruin it, Hiroshima got the bomb.",
        "Spoiler Alert: the bombs worked",
        "Wait, I thought theater problems only happened to “Sound of Freedom”?  That’s all I’ve heard lately, anyway.",
        "Should we boycott and claim that “they” don’t want us to see this movie?",
        "It was a good movie! I watched it today and *chefs kiss* perfect",
        "This would never have happened to Barbie! \n\n(jk I saw Oppenheimer, and I'm sure Barbie is good too.)",
        "Lubbock? This happened to the showing before me today and they bumped the next showing but started it before everyone was seated. Complete clusterfuck",
        "OP, here is the ending, will do the spoiler thing if anyone chooses not to see\n\n>!basically Oppenheimer's clearance ends up retracted, but he is awarded years later by the govt and meets Truman. he expresses his guilt to Truman, who goes on a spiel abt japn not caring who made the bomb. los alamos' fate is brought up, jro says it will be dismantled but truman's security advisor (?) says it will be used for the H-Bomb project instead. the h bomb is also a point of moral discontent for oppenheimer. movie cuts to the earlier scene meeting with einstein, conversation is revealed, and last line is jro's response to einstein bringing up the fact the world may end cause of the test, whole conversation goes \"Albert, when i brought you those calculations i thought we would start a chain reaction that would destroy the entire world. I believe we did.\"!<",
        "You waited an hour? Refunds should have been given out like 5 min after.....",
        "ThE sTuDioS dOn'T wAnT yOu tO seE tHIs mOviE!!!1111",
        "more than mildly infuriating imo",
        "I missed the last 5 minutes of Boogie Nights due to power outage. If you’ve seen the movie you’ll know the last scene explained the whole movie…"
    ],
    "Steve Buscemi. AMA.": [
        "I use your [name for my Pizza Hut orders](http://i.imgur.com/bE8zdjt.jpg). Is that ok?\n\np.s. I'm a big fan of your work.",
        "What would you say is your element?",
        "I think its absolutely amazing you used to be a firefighter and I love reading about the support you've shown to fire services across America (the photo of you volunteering after 9/11 is one of the best things I've ever seen)\n\nMy question is what made you decide to be an actor?",
        "What is the best advice you can give a young person about life in general?",
        "Hello! Con Air 2, yes or no?",
        "Steve, I'm a huge fan.. I absolutely LOVED you in Boardwalk Empire. So what's your favorite boardwalk food?",
        "Mr. Buscemi, have you seen the FX series Fargo, and if yes, what did you think of it compared to the original movie?",
        "[Rolling out](https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
        "Which pizza topping is better: french fries and oreos or peanut butter and gumballs?",
        "Any good stories from on the set of Big Lebowski?",
        "Who is the better bowler, you or John Turturro?",
        "What is your current favourite on-going TV show?",
        "Thanks for doing this.  What question were you hoping would be asked but wasn't?",
        "[deleted]",
        "Hi Steve! You're in so many great movies that if I'm surfing the channels and one of them is on, I have to stop and watch. (Fargo, Billy Madison, Con Air, etc.) \n\nWhat are some movies that you have to stop and watch every time they're on?",
        "How are you today?"
    ],
    "Anon doesn't like oppenheimer": [
        "He said it was inhumane AFTER he got his paycheck from the government and the bomb was dropped, no conflicting thoughts before hand tho",
        "Lmao nerd with a fat tie lmao",
        "That guy's either the father of world peace or the cause of its distruction. I'm with Op on that",
        "Oppenheimer must be the first human to make a decision and regret it later. \n\n Anon is regarded beyond belief.",
        "Oppenheimer is just the face. The bomb would also have been build without him.",
        "\"I'm building a bomb for the government\"\n\n\n\"NOOOO DON'T USE IT TO BOMB PEOPLE!!!\"",
        "⠀⠀⠘⡀ “Now I am become Death,            : ⠀⠀⠀⠑⡀⠀the destroyer of worlds.”⠀⠀⠀⡔⠁⠀⠀⠀ ⠀⠀⠀⠀⠈⠢⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠴⠊⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⢀⣀⣀⣀⣀⣀⡀⠤⠄⠒⠈⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠘⣀⠄⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡠⠔⠒⠒⠒⠒⠒⠢⠤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⡰⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠑⢄⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⡸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠙⠄⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⢠⠂⠀⠀⠘⡄⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠈⢤⡀⢂⠀⢨⠀⢀⡠⠈⢣⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢀⢀⡖⠒⠶⠤⠭⢽⣟⣗⠲⠖⠺⣖⣴⣆⡤⠤⠤⠼⡄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠘⡈⠃⠀⠀⠀⠘⣺⡟⢻⠻⡆⠀⡏⠀⡸⣿⢿⢞⠄⡇⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢣⡀⠤⡀⡀⡔⠉⣏⡿⠛⠓⠊⠁⠀⢎⠛⡗⡗⢳⡏⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢱⠀⠨⡇⠃⠀⢻⠁⡔⢡⠒⢀⠀⠀⡅⢹⣿⢨⠇⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⠀⠠⢼⠀⠀⡎⡜⠒⢀⠭⡖⡤⢭⣱⢸⢙⠆⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⡸⠀⠀⠸⢁⡀⠿⠈⠂⣿⣿⣿⣿⣿⡏⡍⡏⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⠇⠀⠀⠀⠀⠸⢢⣫⢀⠘⣿⣿⡿⠏⣼⡏⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣀⣠⠊⠀⣀⠎⠁⠀⠀⠀⠙⠳⢴⡦⡴⢶⣞⣁⣀⣀⡀⠀⠀⠀⠀⠀ ⠀⠐⠒⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⢀⠤⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠀⠀⠀",
        "Doesnt beat the \">I have become deatherinooo\" greentext",
        "> If you want peace, prepare for war.\n\nWithout nukes, we would probably be on world war six by now..",
        "Ngl that's a flex",
        "Oppenheimer wanted to make a tactical nuclear weapon that could be used on the battlefield, he was specifically against the \"super bombs\" and the advocates for the \"super bomb\" were so scared of communism that they would accuse Oppenheimer of only wanting tactical nuclear bombs because he had orders from Moscow to do so. The bombs that ended up being made were exactly the ones Oppenheimer didn't want to make.",
        ">Robert Oppenheimer was a fucking idiot.\n\nIdk. Could an idiot build a world destroying weapon?",
        "This is beyond retarded. If he didn’t work on the atom bomb the germans might have built it first. (Not really but at the time when then knew less you could have argued that) Also remember no one even knew how destructive the nuclear bomb would be, they didn’t really know what to expect the first time they tested it and it far exceeded their expectations. \n\nMaking the bomb to end world war 2 was a justified reason, but then seeing its destruction in practice, not to mention its unimaginable destructive power and tragedies that it caused to people. Obviously will change a man. And him taking responsibility for it is honorable. But yeah sure 4chaners are obviously smarter. They would never regret anything in their lives.",
        "dude what the fuck is that font",
        "He was terrified that Germany would build the bomb first, and he felt that America beating them was the only way to secure peace. Of course, we know now that they were nowhere close to making their own, but it was a genuine fear at the time. Anon is an imbecile.",
        "we should have bombed aliens with it instead"
    ],
    "Inside Edition tries to blame video games on the recent New Oxford school shooting, incorrectly attributing the famous J. Robert Oppenheimer quote to Fallout 4": [
        "Wasn’t Oppenheimer quoting a Hindu text?",
        "IT HAS NEVER BEEN, OR EVER WILL BE, VIDEO GAMES FAULT!",
        "Yeah blame violent video games not violent reality",
        "Yeah, it was the video games. And surely not his fucking degenerate parents who bought the gun and ammo for him and treated any fucking warnings given against him like they were an achievement.\n\n\"Journalists\" who continue to push the \"Video Games cause violence\" narrative in 2021 deserve to be arrested for journalistic malpractice.  \n\nIt has been definitively disproven from every possible angle ever since the issue has been studied but these fucking brain trusts refuse to read a fucking study to save their goddamn lives.\n\nSo, Inside Edition, please do this whole world a favor and remove your head from your fucking ass and do some actual goddamn research before you continue to push a narrative that only exists in you atrified brains.",
        "After playing 76 I only wanted to kill myself",
        "Wtf does hikhock45 have to do with this he is cool asf",
        "Yes… the famous quote from… Fallout 4…",
        "these parents just failed in so many ways. now ima have to hear my in-laws tell me its all the video games fault. not the parents who bought him the games and let him play with the guns/ have access to the guns AND ammo. or brushing off the signs he might hate his school and everyone in it.",
        "Of course. It’s another case of an insane piece of shit, whose parents failed him/actively encouraged bad behavior, which then sadly leads to  a horrific tragedy, so of course they’ll try to put the blame anything but",
        "I blame Minecraft",
        "Can’t stand how the media talks.  Like nails on a chalkboard.",
        "It wasn't videogames this time, or the time before, or the time before,or the times before, or last month, or three years ago or at any point in America's proud history of school shootings. It's availability to guns, shit education systems, a completely blazé attitude to mental health and bullying and general apathy to the future of your children.\nIf It ain't making money, they don't give a fuck.",
        "I wish they would just stop with the video game argument sheesh 🙄",
        "1. He didn’t even have the game with the quote.\n\n2. That quote is super famous, like I didn’t even know it was in that game yet I know about the quote.\n\n3. I don’t have any other points this list would just look super short with only 2 points.",
        "I want to strangle the person who decided to blame this on videogames",
        "[deleted]"
    ],
    "‘Drake and Josh’ Star Josh Peck Joins Christopher Nolan’s ‘Oppenheimer’": [
        "“Hug me, Oppenheimer!”",
        "“Oppenheimer.”\n\n“Yeah?”\n\n“Where’s the atom bomb?”",
        "The bomb. It's nuclear! NUCLEAR!!!",
        "They’re gonna NUKE OPRAH!",
        "It's official now: Literally everyone can and will be in this movie.",
        "Great to see him getting his first role in a blockbuster since he hasn’t had a huge role outside of the Ice Age franchise.",
        "He'll be the lead in the [sequel](https://youtu.be/kQeC06SdicI) too.",
        "Oppenheimer, where’s the nuke?",
        "Wow quite the career jump for him.\n\nNice revival roles for him and Josh Hartnett even if their roles are small.",
        "Nolan is employing half the actors in Hollywood with this movie.",
        "At this rate I’m expecting a Elijah wood and Haley joel osment announcement anytime soon",
        "I RAN OVER OPRAHEIMER!",
        "This has nothing to do with this movie but y’all remember that sushi episode of Drake and Josh? Good times.",
        "He better be creating the Game Sphere",
        "Well this is the moment that confirms he has eclipsed Drake in his career. That is huge.\n\nFor some reason I have paid close attention to this. Josh mostly stayed relevant through Vine/TikTok and the rare nostalgia, while Drake was very behind him during the Vine era (Reports of him living in Disneyland) and Drake kind of got an edge when he went full pandering to Mexico and changed his name and started making spanish music. This is where Josh has truly won. The whole pedo scandal with Drake certainly didn't help.",
        "Let's see what Drake has been up to...oh no!"
    ]
}