{
    "Christopher Nolan's 'Oppenheimer' - Review Thread": [
        "From the Washington Post (4 out of 4 stars):\n\n> But the dialogue in “Oppenheimer” is scrupulously comprehensible — a victory for anyone who has found Nolan’s sound mixes to be unintelligible in the past.",
        "Its so satisfying to hear that both of the movies opening this weekend deserve the hype they’ve gotten",
        "From the reviews it sounds like this is 3 hours of men in mid century suits yelling at each other in offices, bunkers, courtrooms, and science labs. *I can't wait*\n\nIn all seriousness, without trying to sound like a Nolan Circlejerker, this is one of my most anticipated movies of the last few years. I feel like the build to this is much bigger than other movies. Both Barbie and this movie have this sort of aura around them that I can't quite pinpoint for some reason.\n\nThis is going to be a good weekend.",
        "For comparison, the Metascores for Nolan’s films:\n\nFollowing - 60\n\nMemento - 83\n\nInsomnia - 78\n\nBatman Begins - 70\n\nThe Prestige - 66\n\nThe Dark Knight - 84\n\nInception - 74\n\nThe Dark Knight Rises - 78\n\nInterstellar - 74\n\nDunkirk - 94\n\nTenet - 69",
        "Filming took 57 days. \n\nWith that cast, hanging out at the airport near the set would have yielded some pretty crazy celeb sightings in a pretty short time period.",
        "> Gary Oldman as Harry S. Truman\n\nOkay I know basically everyone is in this movie, but this one slipped me by for sure. Guessing it's not that big of a role?",
        "Barbenheimer fans eating well this weekend",
        "It's definitely gonna be 90+ on both RT and Metacritic. Hoping it beats Dunkirk 94 on Matacritic.\n\nEdit: These reviews have made me excited for RDJ performance. Looks like it's gonna have a lot of scenes of Washington hearing and moves back and forth between hearing and Oppenheimer view. Also it looks like only Variety didn't like that approach and saying ending didn't land.",
        "These reviews have me unbelievably excited to see RDJ’s performance, I’ve been ready for him to start thriving even more post-Iron Man",
        "So happy for Cillian Murphy — he’s such a gifted actor!  Glad to see him get some recognition of Peaky.\n\nSuper stoked to do a double feature of this and Barbie!",
        "I am glad to see Nolan get a big W after Tenet.\n\nAlso, I hope this gets more leading roles for Cillian and more non MCU roles for Downey.",
        "I watched *The Prestige* for the first time in a while last week in preparation - I’m hoping he outdoes himself with *Oppenheimer*. Can’t wait for tomorrow evening.",
        "Holy shit… Nolan has done it!!",
        "It seems Oppenheimer is quite a heavy movie so will remove the double feature aspect and just see Barbie the next day, will likely need some time to sit with the former",
        "Barbienheimer is a fucking go\n\n\n>!Gary Oldman as Harry S. Truman, did I miss this casting holy fuck!<"
    ],
    "My girlfriend doesn't let me watch movies with sex scenes": [
        "I also remember being 14",
        "🚩🚩🚩🚩🚩🚩🚩🚩🚩",
        "My fiancés ex girlfriend was the same with him. It got to the point where he was looking at his shoes 100% of the time they were out, he secretly rented movies on dvd to watch and would return them before she got home (sex scene insecurities) and he couldn’t shower alone “in case he thought of another woman”.\n\nWhen we got together he was so scared of offending me if he was complimentary to another woman for whatever reason. If I said “oh, I really love that woman’s outfit” he was scared that it was a trap at first, because in his previous relationship he would reply that yeah it was a great look and then eat a shit sandwich for it. \n\nYour girlfriend needs to grow as a person before she can grow in a relationship. Accommodating her insecurities and control issues might seem like the right thing to do but you’ll never get off the downward spiral until you’re out of the relationship with her. She needs help.",
        "Omg.  Vampire diaries doesn’t even have sex scenes. The most I’ve seen is kissing and maybe someone takes their shirt off then they cut the scene. I mean is she forrrreallll?! sorry, I’m going off topic but yeah shes mental, dump her.",
        "Your girlfriend has a neurotic level of insecurity and will become more and more controlling. Little chance of this situation ever improving.",
        "Imagine a big beautiful bouquet of flowers, red flowers. Nice right? Now replace said flowers with red flags.\n\nThat’s what you are dealing with.",
        "I had a girlfriend like this. Run. Run far away if you cannot talk this out like reasonable adults. It got so bad, I'd be \"getting in trouble\" over video game women. Like not even sex scenes, just the person on the other team picked a skin that was \"too slutty\".\n\nEverything that gave me joy would have me feeling like I'm walking on eggshells. What if an attractive woman shows up during this movie? Is this law and order a murder one or a rape one because if she's not dead, I'm going to be.\n\nI couldn't even watch my Old School with Will Ferrell. It was my favorite movie, I bought that shit on Blu ray as a combo pack with anchorman and taledega nights.  It has a scene where two women take their tops off to wrestle an old man.\n\n Do you remember the titties in that film? I didn't but I sure remember getting smacked upside the face out of nowhere.",
        "She’s nuts. That is some major red flags.",
        "Speaking as someone who was like this when I was a kid, it honestly sounds like she has some self esteem and trust issues; something along the lines of her not wanting you to look at other women because she doesn't want to risk you losing interest in her over someone who might look/be better than her, and not trusting you enough to know you won't just blindly dump her for something better. Talk to her about it, let her know you're not just gonna ditch her at the sight of someone else.\n\nBarring all that though, don't give more than you have to to someone who won't give as much back in return. Be supportive, but do what's best for you",
        "I couldn't read anymore after I heard my girlfriend        \" doesn't let me \"....",
        "\"When you're wearing rose colored glasses, all the red flags just look like flags\"",
        ">Is it warning bells? \n\nNo. This is the equivalent of that warning siren that you hear when a tornado or a nuclear attack is approaching.",
        "The hidden message that she probably wouldn't even admit here is either, \"I don't trust you to not be emotionally and sexually exclusive with me.\"\n\nOr, \"I don't want you admiring the beauty other people have, because I either envy their beauty or am insecure about my own beauty.\"\n\nNow these two messages aren't mutually exclusive either, and they can even derive from one another. \n\nWhatever the case might be, sit down with your girlfriend and have a heart to heart discussion about her feelings towards you, herself, and other people. \n\nCommunication is the key here, that is if you actually want to stay and try to work things out. I know alot of people are saying to break up with her, but I get the feeling their spouse would use the wrong kind of milk in their Mac and cheese and they'd break up over it. You'd be surprised how often conflicts and speedbumps can be smoothed out by honesty, trust, and communication.",
        "Run.\n\nNow.\n\nMASSIVE red flags. She's INSANE.",
        "Study to become an OB/GYN to make her head explode, then get a more well-adjusted partner."
    ],
    "[Spoiler Zone] Official Movie Discussion Thread": [
        "Nolan played a reverse uno card on us when instead of detonating the bomb so loud the whole theatre shakes, he left us breathless for 1 minute in anticipation of the incoming sound.\n\nThe whole theatre was packed but quiet as a mouse. That scene will stay with me forever.",
        "God that movie was fantastic. I’m still absorbing it. Cillian Murphy better get an Oscar for that performance.",
        "I don't know what to say, it's not a movie about *the bomb* and it doesn't have some crazy plot twists. It's not forcing gyou to cry or feel proud or whatever. It's just a  really decent period drama. Tense, well acted, beautifully shot. Actors in this are amazing, every one of the main cast deserves all the praise and hype. I feel like a lot of people may find it's 'slow' or lacking 'events' since we're going to a Nolan's movie, duh, but I really enjoyed it. \n\nIt leaves you with this *feeling* of not wanting to go back to the real world and just immerses you completely, I don't feel it that often, if that makes sense. Like when you need 2 hours after the movie to shake it off.",
        "The way Nolan created paranoia in Oppenheimer was breathtaking. The speech to the proud Americans was my favorite. Showed how conflicted he was about celebrating, and the impending doom he may have caused. Blood is on his hands. \nMy favorite part of the scene was how Nolan blurred the lines between celebration and ridicule. It felt like Oppenheimer could have been in a jail cell for committing the worse of crimes (people screaming/dark lights/terror). \nThe sound of the drumming feet was great. We heard thar build up in scenes before and we finally hear where they are coming from. Epic Nolan moment.",
        "The first few scenes Rami Malek was in I was totally like there's no way my dude doesn't have a speaking part lol he dropped the bomb of the movie though so to speak. \n\nI've been very fascinated in the atomic bomb race since I was 14 and this movie was just incredible at showing every aspect of it, through just simple scenes of dialogue. \n\nMy favorite scene has to be when Oppenheimer was viewing the slideshow of the destruction of the bomb in Japan and the camera just stays on him. Such an amazing scene. \n\nGary Oldman was freaking incredible as Truman in just a short scene he filmed in a day. Can't wait to see this again next weekend. Has to be the best movie I've seen this decade.",
        "I loved every scene Einstein was in, for me those were the highlights of the movie along with the detonation scene.",
        "Robert Downey Jr. absolutely killed his role.",
        "The last scene between Einstein and Oppenheimer really hit the feelings. It’s funny how Robert Downey Jr.’s character thinks that Oppenheimer turned every scientist against him and was conspiring with Einstein over there, but in reality just like his assistant said, his career and politics were just too insignificant to those geniuses. The way Einstein talked about the consequences of achievements feels like something only Oppenheimer would truly understand. His works inspired Oppenheimer’s study and the creation of Abomb; Oppenheimer actualize the idea and inspired the creation of Hbomb consequently. Few have reached their heights in the long history of mankind, yet here they are, miraculously alive in the same age, passing down the torch of knowledge and the solitude of not being understood. They’ve been granted the freedom and vision to see the world closest to its true form than anyone else, but ultimately couldn’t stop it being tainted by ignorance.",
        "Just here to give Cillian Murphy his flowers.  His performance really anchors this film while being completely unselfish, letting so many other actors shine, even in brief appearances.  Further, it really lets RDJ shine as Strauss.  While Nolan has his fair share of dectractors, one cannot argue that he doesnt coax great performances from his actors - Pearce, Pacino, Williams, Ledger, McConaughey and now both Murphy and Downey.  \n\nI had a few gripes during the film - maybe with the parallel structure - but the ending buttoned it up for me.  And upon reflecting, would not have preferred a more straight-forward, chronological story.  \n\nIt was also really great to see Nolan employ some techniques he hadnt in a while, namely the vibrating background ala Scarecrow mask sequences among other things.  All in all, I just really enjoyed it.",
        "As someone who studied physics in college and learned and studied the works of people like Bohr, Heisenberg, Fermi, etc this movie was a dream. Loved seeing Richard Feynman and his bongos. Also loved the detail about him not using goggles during the explosion because his car window (made of glass) protects him from UV radiation which he discussed in an interview later in life.",
        "Both Strauss and Oppenheimer losing their court cases is an analogy to mutually assured destruction as they cause each others failures",
        "Was Jean murdered or was that Oppenheimers paranoia?",
        "It felt like a tremendous victory to me. I have to rewatch it soon as I know that Nolan specifically designs his films to be viewed over again so as to reveal more of what you wouldn’t know to notice on first watch. At 3 hours long it felt so quick to finish as I was on the edge of my seat for most of the film. The music and weaving of scenes and timelines became a chaotic blur that kept me in awe and bewilderment as the story continued to shift and I was hanging on the words of nearly every character that was presented. The choices to move in and out of black and white, the scene when he is describing his affair and his wife sees his lover on top of him as he is naked in front of the prosecutor and panel, the immediate aftermath of the test in trinity with their breath and nothing else for sound. All epic moments and stylistically so compelling to me as a viewer. Can’t wait to see it again.",
        "One of the best films of the year, probably will be top 3 of the year for me.\n\n- Cillian Murphy gives an absolutely amazing performance. Easily the frontrunner for Best Actor right now.\n- Florence Pugh was in like 6 scenes but was the standout. Making her death ambiguous, suicide or murder, with quick cuts was a great editing choice.\n- Direction, Score and Cinematography are 10/10.\n\t- The trinity scene is heart palpitating and expertly direct by Christopher Nolan.\n\t- Ludwig Goransson using strings and classical music is phenomenal\n\t- Hoyte Van Hoytema with trinity scene and speech with the stomping was perfect \n- Writing wise, this is Nolan's best work. The non-linear structure with black and white scenes is a interesting narrative choice. \n- The set-ups in first 2 acts to deliver the twists in the 3rd act was honestly mind-blowing. I see why the script was likened to The Social Network.\n- Supporting actors (David Krumholtz, Josh Hartnett, Benny Safdie, Rami Malek, Olivia Thirbly, Alden Herenreich etc.) all had their moments. Jack Quaid with the tiny drums was a fan favorite!\n- RDJ and Emily Blunt killed it in the 3rd act! \n\nCinematically, Oppenheimer will be remembered as best films of the decade. Will deservedly dominate in award shows next year",
        "Pretty metaphysical how Cillian Murphy was displayed as a commie in this movie and then he walked out during the Oppenheimer premier as part of the Hollywood actors’ strike"
    ],
    "Greta Gerwig's 'Barbie' - Review Thread": [
        "Really feeling the Positive Kenergy in here, you guys",
        "“The fear is that Hollywood will learn the wrong message from Barbie, rushing to green light films about every toy gathering dust on a kids playroom floor”\n\nOh, that’s exactly what’s going to happen",
        ">Greta Gerwig’s bubblegum-fun-cum-feminist-thesis indulges Ken but pulls its punches...\n\nTell us more about this bubblegum-fun-cum.",
        "Lady bird 99 on RT, Little women 95 and now Barbie looking for a 90+. Greta Gerwig has been absolutely killing it so far.",
        "So far so good. Anything above 80% on RT after all reviews are out will probably make this a massive summer hit",
        "Sounds like it’s a Ken out of Ken",
        "I would sell my kidney for a “I am kenough” hoodie.",
        "I, for one, welcome our new Barbie overlords.",
        "If i'm honest, was starting to get a little worried about the movie's quality. So glad to be able to eat my words",
        "Barbie was a fine movie but its politics were a bit iffy. wouldve been way better if at the end the Barbie turned to the camera & said \"i am communist now\" & then specified shes the exact kind of communist i am",
        "First movie to make a Barbillion dollars",
        "s(he's) bro(ken)",
        "All this talk about Ryan Gosling maybe getting a best supporting actor nom for his performance certainly has me interested",
        "Damn, it even got the Metacritic Must-See badge, and they rarely dish those out to blockbusters like this. \n\nWhat a glorious time for Barbie fans.",
        "Everybody involved looked like they were having the time of their lives from every clip / interview / behind the scenes footage I've seen. Ryan Gosling's Kenergy alone has me wanting to see it because at this point in his career I don't think he'd be pretending to be this into a role if the movie sucked and wasn't hilarious."
    ],
    "'Oppenheimer' Review Thread": [
        "Oscar nominations here they come!",
        "Yeah this weekend is going to pop the fuck off",
        "RT: 97% with 63 reviews!!",
        "MC is currently at 92 with 37 reviews.",
        "350% RT\n\n7000 metacritic\n\n12/10 IMDB\n\nOmega ++ Cinemascore",
        "97 (!!!!) on MC with the first 7 reviews!",
        "9.1 on RT is fucking insane. That's higher than Killers of the Flower Moon ffs",
        "Jfc this is going to be a modern day classic. Universal positive reception at its best!",
        "Downey wasn't lying when said \"this is the best film I've ever been in\".",
        "[TheHollywood Report: Oppenheimer’ Review: Christopher Nolan’s Epic Is a Scorching Depiction of America’s Ability to Create and Destroy Its Heroes](https://www.hollywoodreporter.com/movies/movie-reviews/oppenheimer-review-christopher-nolan-cillian-murphy-robert-downey-jr-1235539375/)",
        "Man I really am about to watch two masterpieces back to back this weekend",
        "James Woods is an executive producer on this film?\nWild.\n\nHappy to see it’s getting incredible reviews - hope I can see it in theaters soon.",
        " Interesting excerpt from David elrich of IndieWire's review: \n\nIt’s also not to glibly conflate one of the most controversial figures of the 20th century with one of the most controversial figures on the r/Movies subreddit, even if the industry-changing success of “Batman Begins” surely inspired a “now I am become death” moment of Nolan’s very own. ",
        "Rotten Tomatoes score for #Oppenheimer at 97%. Out of 63 reviews, 61 are fresh and 2 are rotten. The initial rating is 9.1 out of 10",
        "For comparison, the Metascores for Nolan’s films:\n\nFollowing - 60\n\nMemento - 83\n\nInsomnia - 78\n\nBatman Begins - 70\n\nThe Prestige - 66\n\nThe Dark Knight - 84\n\nInception - 74\n\nThe Dark Knight Rises - 78\n\nInterstellar - 74\n\nDunkirk - 94\n\nTenet - 69"
    ]
}