{
    "Official Poster for Christopher Nolan's 'Oppenheimer'": [
        "Cillian Murphy on his lead role in Oppenheimer \n\n>\t“I have always said publicly and privately, to Chris, that if I’m available and you want me to be in a movie, I’m there. I don’t really care about the size of the part,” he said. “But deep down, secretly, I was desperate to play a lead for him.”\n\nSo happy for him to finally lead big budget movie, and that too in a Nolan movie. He was outstanding as Thomas Shelby in PB.",
        "New trailer incoming? Hopefully",
        "“It’s exploding right behind me isn’t it?”",
        "After Tenet: \n\n>“I couldn’t hear the movie”\n\nAfter Oppenheimer: \n\n>“….mmmwwap….mmmwwap….oh god…”",
        "\"The power of the sun in the palm of my hand.\" - Doc Opp",
        "movie gonna be fire but this poster is so ass",
        "\"ChatGPT, design a movie poster for me.\"",
        "Looks like a Hunger Games spin off with Cillian Murphy",
        "Thought this was a new inspector gadget at first lol",
        "This poster stinks",
        "Poster could be a little better.",
        "Opp Opp Opp Oppenheimer style!",
        "This movie has some of the worst posters in years. This is such amateur composition and photoshopping.",
        "\"My le bomb... le killed people?\"",
        "Cillian looking like the evil ghost man from Poltergeist II...\"God is in his holy temple...\"",
        "Terrible poster."
    ],
    "Oppenheimer (2023) and Barbie (2023) open the same day. One is about the invention of the atomic bomb. The other is about a plastic doll. Guess which one stoked the most political outrage. Go on, take a wild fuckin' guess": [
        "Margot Robbie vs mass destruction weapons.",
        "Osama Bin Laden and Bratz movies next year please.",
        "Guess which one has full frontal nudity.",
        "Atomic bomb and blonde bombshell. I am become Doll, destroyer of young girls self image.",
        "People have waaaaaay too much time on their hands",
        "“I am become Barbie, destroyer of Ben Shapiro”",
        "Weirdly both of them.",
        "Ah yes, one of the most politcal controversy: plastic",
        "Oppenheimer will stoke even more outrage once the muppets realize it doesn't actually glorify American militarism and nuclear weapons.",
        "Conservatives when a filmmaker that frequently discusses feminism in her films discusses feminism in her films: 🤯🤯",
        "Shouldn't have touched east Vietnam/ west Philippines sea.",
        "I think Greta Gerwig, Noah Baumbach and Margot Robbie would all disagree that it's really about a plastic doll. Haven't seen the film but from what I've heard it does make some social statements about feminism and the patriarchy. Not defending the outrage merchants but it's disingenuous to pretend it's really a film about a doll.",
        "To be fair, plastic is going to have the higher death toll.",
        "Saying Barbie is about a plastic doll is like saying Schindler's list is about a factory.\n\nTotally disingenuous.",
        "“I have become death, destroyer of girls”",
        "To be fair Barbie is way more political than what you'd expect from a movie \"about a plastic doll\""
    ],
    "Real Footage of Robert Oppenheimer testing the atomic bomb": [
        "I think nuclear explosions footage doesn't really put into perspective how big they are. Just for comparison, this first ever test was about 25 to 50 times more powerful than the [Beirut explosion](https://thumbs.gfycat.com/CorruptGorgeousBackswimmer-size_restricted.gif)",
        "I saw Einstein in that fireballs towards the last second of the clip.",
        "The footage of Oppenheimer, himself, was not actual footage from the Trinity Test in 1945 - it is a re-enactment from 1946. The film was called *Atomic Power*.",
        "Documentaries seldom explain that perhaps the hardest part of building the first fission bombs was the timing of the detonations of conventional explosives which forced the fissionable material into a critical mass that would explode rather than just heat up and melt.\n\nElectrical current takes measurable time to travel over wires to \"blasting caps\" and all of the explosions had to happen at exactly the same instant so that the force compressing the fissile material was applied evenly in three dimensions.  Today there are off the shelf timer switches capable of that precision.  The Manhattan Project had to invent them and had nothing more sophisticated than ~~slide rules~~ rudimentary early computers and analog gauges to assess and model their performance.  (Thanks to u/Newme91 for the reminder.)",
        "Big bada boom",
        "It annoys me when people reduce mega-projects like this down to one person.  People constantly pin it on one guy, either a worker who was in a management position or a politician who proposed the project.  The reality is that these are the works of thousands of people, maybe more, all working from various angles.  No one person built the nuclear bomb, and calling a man like Oppenheimer its “mastermind” is unfair both to him and the many others who worked with him.",
        "This footage is way cooler that the explosion from the movie. Idk why they just didn’t use this.",
        "so did anyone die of radiation after this test? was it safe for them ? because it was the first ever nuke so i don't think they know what to expect and what distance was safe for them.",
        "Miles away ,a young girl ,blind from birth ,saw the light 😬🫨",
        "Anyone else see a face at the end?",
        "My grandpa worked at the lab that Oppenheimer worked at. My dad always told me stories of Los Alamos, NM since he grew up there. My dad developed cancer at a young age and was convinced it was because of this happening near where he grew up.",
        "She was blind but saw it?",
        "Fun fact about the people at 0:05! The guy center left (Harry Daghlian) and the guy center right (Louis Slotin) would be killed later by their own hubris when testing another nuclear source, the plutonium core nicknamed \"The Demon Core.\"\n\nEach of them would test how close they could get to a criticality event by (1, Daghlian) slowly lowering tungsten carbide bricks in place around the nuclear source using *his fucking hands* and (2, Slotin) slowly lowering two half spheres of beryllium over the very same nuclear source using a *fucking flathead screwdriver.*\n\nIn Daghlian's case, he dropped one of the bricks on top of the core, causing a criticality event that released a lethal dose of radiation into his body, killing him a few days later.\n\nIn Slotin's case, the flathead screwdriver slipped from its position (Slotin had removed the protective spacers that had been placed there previously to prevent the two halves from fully closing), the spheres closed, and another criticality event occurred, irradiating Slotin and 7 other people around him. Slotin died a horrible death several days later, as well.",
        "Movie was pretty underwhelming with the test lol. In the move they just did a normal explosion\n\nThey should have used CGI to make it look like an atomic bomb explosion, or they could also use this video and a bit of enhancing/CGI-ing to make it look good",
        "It makes me horrified everytime I see stuff like that.",
        "When does Barbie show up??"
    ],
    "First Image of Cillian Murphy as J. Robert Oppenheimer in 'Oppenheimer'": [
        "Do we know if Feynman will feature?",
        "Cool finally seeing Cillian as a lead in a Nolan flick! \n\n He always killed it as a supporting character in his films.",
        "Nukey Bombders",
        "Yep, that's Cillian Murphy in a hat.",
        "Looks great. It's fantastic to see Cillian Murphy get a leading role in a big movie, he's a terrific actor and no doubt he'll knock this role out of the park",
        "Production has officially begun on Christopher Nolan's 'Oppenheimer', set for a July 21, 2023 release:\n\n* Cillian Murphy as J. Robert Oppenheimer\n* Emily Blunt as Katherine Oppenheimer\n* Matt Damon as Leslie Groves\n* Robert Downey Jr. as Lewis Strauss\n* Florence Pugh as Jean Tatlock\n* Rami Malek\n* Benny Safdie as Edward Teller\n* Josh Hartnett\n* Dane DeHaan\n* Jack Quaid\n* Matthew Modine\n* Dylan Arnold as Frank Oppenheimer\n* Olli Haaskivi\n* Alden Ehrenreich\n* David Krumholtz\n* Kenneth Branagh\n\nThe film will be shot on a combination of IMAX 65mm and 65mm large-format film photography including, for the first time ever, sections in IMAX black and white analogue photography.",
        "If the picture is of any indication, this will be the first Nolan film in which people smoke cigarettes.",
        "I’m currently halfway through the Pulitzer Prize winning book “American Prometheus” on which this movie is based.\n\nOne of the most famous traits of all of Nolan’s films continues with Oppenheimer.\nGuess what that is?!",
        "Looks a lot like Cillian Murphey with a hat on.",
        "Black and White? Looks like Nolan's going back to where it all started.",
        "\"Now I am become Death, the Destroyer of Worlds.\"",
        "Cillian Murphy deserves all the praise in the world.  I feel in the mainstream eye, he's always been one role away from making it big.  You look at his fucking credentials though?  Mother fucker should be bigger than 90% of the box office with the work he's done.",
        "This looks great. Universal got a steal when they got Nolan to do this",
        "Looks like ed Harris in a beautiful mind.",
        "Oppenheimer after the bombs drop: I told you my product would take you places. I didn’t say they’d be places you wanted to go.",
        "For reference, this is a pic of the real Oppenheimer: https://content.magnumphotos.com/wp-content/uploads/2019/05/cortex/par196080-teaser-story-big.jpg\n\nThe casting is spot-on it's nuts."
    ],
    "This is the 11-mile long IMAX film print of Christopher Nolan’s ‘OPPENHEIMER’ It weighs about 600 lbs": [
        "Bro, you can’t just show the whole movie. Spoiler alert please",
        "At what point does \"footage\" become \"mileage\"?",
        "so any imax movie screening would require one alike? somehow thought it was some huge raw file",
        "Woah here I was thinking it was all digital now",
        "Sex scene is 4 miles long",
        "Why’s it so big",
        "I miss my first job working in the movie theater when I was a teen seeing this. I have tons and tons of movie posters and still have the mylars and the film teasers for star wars and lord of the rings. Great times we watched lord of the rings and everything else a week before it came out and got to bring the bong along.",
        "I can’t wait to watch it",
        "Watch it noodle to the floor lol",
        "How the hell are these things transported? The film cans must be enormous!\n\n\\*\\*Edit: now that I think about it they probably ship a number of shorter rolls and splice them into one continuous roll. Any IMAX projectionists want to confirm?",
        "Chris Nolan Oppenheimer print! His name is my name too!",
        "Is there a digital imax camera?",
        "The angle is confusing to a film reel noob like myself. Is it as big as a a standard frisbee? A cable satellite dish? A Korean bbq restaurant cooker thing?",
        "If it’s 11 miles long could you run two showings at the same time just with a offset starting him? Movie one start then 30 mins later feed it into another machine?",
        "Is the audio any good or is it like Tenet?",
        "Wow, with nothing comparable next to it for sizing to show just how big it is, nice..."
    ],
    "Cillian Murphy Confirmed to Star As J. Robert Oppenheimer In Christopher Nolan’s Next Film At Universal, Film Will Bow in July 2023": [
        "So when will Michael Caine be confirmed?",
        "Im so happy for Cillian. He’s such a tremendous talent and he finally gets to lead a Nolan film. I have to imagine he’s going to absolutely kill this.",
        "He'll find a way to squeeze Michael Caine in there somehow",
        "Tom Hardy will play the bomb.",
        "Hoyte Van Hoyte as DP and Ludwig Göransson will score it\n\n&#x200B;\n\nhttps://twitter.com/TheInSneider/status/1446536962593144841?t=Fk9b7HpTPDw8aMETl\\_Z1fw&s=19",
        "So nice to see Cillian Murphy not be the side character in a big film",
        "I wonder if there’s a role for Robert Pattinson in this? I hope he becomes a Nolan regular, he was the highlight of Tenet",
        "What does \"film will bow\" mean?",
        "It’s about time he gets the lead role. He’s fantastic in every Nolan movie I’ve seen.",
        "Very interesting, super interested in this type of project. Love how Nolan uses the same actors though, thats real relationship building",
        "Now he becomes Death, the destroyer of worlds",
        "My mans! Even more stoked for this now. Cillian is such a talented, fascinating actor & screen presence. Probably revisit a movie of his at least once a week (Sunshine, Red Eye, 28 Things Later..) Looking forward to this!",
        "\\*Nolan searching for Murphy's lookalikes among history books for his next movie\\*",
        "*drops bomb*\n\nBWWWWAAAAAMMMMMM",
        "This guy played batman.. for like 40 seconds",
        "Tom Hardy casting announcement incoming"
    ],
    "Oppenheimer moment": [
        "“**Mankind invented the atomic bomb, but no mouse would ever construct a mousetrap.**\"\n                      \n                        - **Albert einstein**",
        "\"Fuck\"\n\n                     -Oppenheimer, probably",
        "\"I am become death, destroyer of worlds.\"",
        "Oppenheimer moment",
        "> USA: ATOMIC BOMB IS DANGEROUS!! NO ONE SHOULD HAVE ONE!\n> \n> IRAN: don't you have thousands of it?\n> \n> USA: yeah... BUT NO ONE SHOULD HAVE IT except us.\n\nI hate both",
        "*Laughs in nuclear power*",
        "It means the end of large scale warfare because of mutually assured destruction.",
        "Nolan couldn't have timed his movie better. Let's hope nuclear war won't break out before it gets released",
        "Now I am become death, fuck them kids - J robbie O",
        "The story of Oppenheimer’s life",
        "What was the main reason he made the bomb in the first place?",
        "At least we get an epic Chris Nolan movie about it.",
        "\"Now I am become death, the destroyer of worlds\"\nR. Oppenheimer",
        "This has the same feeling as gatling inventing the first machine gun with the intention of scaring people so there would be no wars but look at us now",
        "Give some love..",
        "Karma"
    ],
    "New images of Cillian Murphy, Emily Blunt, and Robert Downey Jr. in Christopher Nolan's 'Oppenheimer'": [
        "Robert Downey Jr kind of looking like a whitewashed Gus Fring.",
        "Why is Cillian Murphy's bone structure so perfect for playing a early 20th century working man? He looks like he spent his childhood starving in a coal mine, but is still attractive.\n\nDoes anyone know what I'm talking about?",
        "Gary Oldman confirmed in a podcast he’s in the film too.",
        "The cast on this film is bonkers huh\n\nDune and This are my two most anticipated films and they both have Florence in happy days",
        "Spent a full 2 minutes on the first picture saying “ok I didn’t know Mark Rylance was in this but where’s Robert Downey Jr”",
        "Nolan/Murphy is one of my favorite combos",
        "[removed]",
        "Robert Oppenheimer is one of the most fascinating characters of the 1940s and certainly of the early 20th Century. I would recommend the day after trinity on Oppenheimer. He’s extremely complicated individual who ushered in the atomic age but ended WWII. Another individual is Lewis Strauss who fits the mold of a questionable American capitalist businessman. He’s decisions would later transform into the atomic energy department and later form basis of the EPA today.",
        "[deleted]",
        "The second image is Emily blunt telling him he needs to get a hold of himself and get back to building a nuke",
        "Anyone who wants to learn more about this crazy time and genius man, listen to Dan Carlin’s episode of Hardcore History called ‘The Destroyer of Worlds’",
        "I was surprised to see colour. I thought the entire movie would be in black and white",
        "I'll watch anything with Cillian Murphy in it. Dude is so fucking talented, it's ridiculous.",
        "somehow this seems like the perfect movie for Christopher Nolan.  Glad he's working with Cillian again they seem like a good match up.",
        "Cillian Murphy can really transform can’t he? 😯😯😯",
        "I hope this movie does not bomb at the box office."
    ],
    "They have books about this David": [
        "\"The movie hasn't been released\"\n\nDo... Do people think Oppenheimer's a fictional story that's being told for the first time in this movie?\n\nEDIT: So today I learned that people thought the Titanic wasn't real until recently... jfc",
        "Oppenheimer is a spinoff. It actually follows Oppenheimer as he travels to Tokyo to meet with a scientist who claims to have found the secret of the quantum dark matter device. Before they finish their meeting, there is a massive explosion which alters the course of the war. But I don’t want to spoil anymore.",
        "If you're not at war, and someone does war stuff to you, and you do war stuff back, is that a terrorist attack?",
        "Nanking was just as deadly. And involved far worse cruelties.\n\nOppenheimer probably wouldn't have to even develop such a bomb if the Japanese didn't have the need to kill & rape everyone they could find in the first place... You know.",
        "Meh that's not clever at all.",
        "Dude is off his rocker, dropping a bomb isnt a terrorist attack when both countries are at war.",
        "I don't care about anyone still using Twitter. \n\n\nThese hot takes are just ego-hungry micro-celebrities.",
        "Sovereign nations attacking other sovereign nations are not terrorists. He sounds like he doesn't know what words mean.",
        "The Japanese would have suffered far more in a long, drawn out pacific war. The nuclear weapons used in Japan weren’t terrorist attacks.\n\nUnless you want to classify Pearl Harbor as a terrorist stack. But it wasn’t. It was an act of war.\n\nJust like Nagasaki and Hiroshima. Get over it.",
        "News flash when countries go to war 1 is all you can score, like the guy said.\n\nAlso it was not a terrorist attack, they fucking dropped flyers stating they were going to bomb the the shit out of the city. Japan as a country was 100% at war with the United States, as in 100% of their cities supported the war effort. What a gaslighting fuck wad.",
        "People seem to forget the years and years of further war that was avoided by these bombings.",
        "David might be stupid but I do not agree with the bombs being terrorist attacks. With Japan's war model they would have lost so many more lives than the bombs took. It was a mercy killing if anything.",
        "People do realize that the fire bombings killed more people than the atomic bombs right? Granted the atomic bomb killed many at once while there were a lot more fire bombings. But people always talk about the atomic bombs, but never mention the fire bombings and I’ve met some people who never even knew those happened.",
        "He should have read the books, maybe, not just talk about them.",
        "Would people be more accepting of the bombs if they were dropped on their original target (Germany)",
        "Fellas is it terrorism to end a war?"
    ],
    "Went to Oppenheimer today": [
        "I am sorry but Oppenheimer is NOT a movie to bring your kids. It is a rated R, three-hour long biopic, your kids will be bored as hell and you'll be disrupting the experience for everyone in the theatre! I understand parents have a right to enjoy movies as well but leave your kids at home, get a babysitter, ask a family member/friend for help. Your rights end where the rest of ours begin",
        "Zero chance I could have tolerated the iPad games WITH sound. That’s absolutely nuts.",
        "People are weird, I have a 4 year old daughter and would never bring her or any other kid close in age to that movie. I would love to see it but get a babysitter. Sorry that happened to ya OP.",
        "So putting aside the crying child and the iPad and phone WITH sound, why did these people think a movie about the development of the atomic bomb was a good idea for an infant and a 5-year-old?\n\nStupid motherfuckers.",
        "And no one thought to maybe get staff involved?? This is why people think they can do shit like that in movie theaters, because no one says anything about it.",
        "I would’ve gotten the theater staff or said something. Get a babysitter. This is an R-Rated movie…",
        "Had something similar happen to me and my friends when we went to see Wonder Woman.\nAs the trailers are going, a family walks in, mum, dad 7-8 year old kid and a 1-2 year old.\n10 minutes in the baby cries and the dad give it his phone and puts cartoons on LOUD! \nWe were about three rows down and we could hear someone said something as the dad started shouting “your in a kids film for gods sake”.\n\nDuring the entire movie several people went to get staff, who came in, hovered at the stairs and left each time.\nNothing just nothing done\n\nWhen we left there was about 20 people complaining to the manager and this family came out shouting we were all awful humans for complaining about them and being in a kids film, we should expect noise!\n\nThank fully I’ve never had it again, but the level of entitlement was off the chart\n\nEdit: since it came up this happened at a showcase cinema in Leeds, England\n\nWe still use this as an anecdote to this day, “ that was bad, but not kid on a phone watching cartoons bad during a Film”",
        "Whenever I fancy seeing a film at the cinema, I just wait a few weeks for the hype to die down and then go at a weird time on a weird day (I’m lucky enough to not work a regimented Mon-Fri, 9-5) so for example I went to see Indiana Jones last week on a random Tuesday at 11:20am. Practically had the cinema to myself",
        "People who bring infants to the movie theater are douchebags.",
        "We saw the Barbie movie Thursday and baby Stewie sat behind us. All we heard was \"mom, mama,mama, mommy, M-A-M-A, mom, mom, mama!, mama...\" There were four adults with this little two year old. Not a single adult was paying any attention to baby stewie. \n\nTheaters should have rules that children under a certain age cannot be admitted. It's not fair to everyone else trying to enjoy the movie. \n\nOP, you truly have the patience of a saint. You should reach out to the manager. They might give you tickets so you can see the movie again.",
        "Husband and I went to Oppenheimer on Friday. Five minutes in this big older dude behind us falls asleep and starts SNORING LOUDLY. We hate being confrontational, but damn, it was so distracting—I finally had enough and asked him to please stop and go sleep somewhere else. Thankfully he stopped after that. Like, dude, I’m sorry if you struggle with sleep apnea, but stay home if you’re that tired!",
        "When me and my GF went to go see Spiderman: Across The Spiderverse, there was this one dad who brought his kids in. There were being a little rambunctious, running in the ailes and stuff. Their dad tells them if they dont calm down they will walk out. They didnt and he just straight up took then out of there.",
        "This is exactly why I no longer go to theaters. I’d love to see this movie in a theater but I know there’d be people bothering me and ultimately distracting me.",
        "Isn’t that movie R rated!?",
        "people are being way too chill about this. you dont bring children to a 3 hour historical drama. period. i got my tickets 3 months ago and spent $25 you best believe I would have made sure they left the theater immediately.",
        "It takes a lot to get me to go see a movie these days.  People are just so self-centered.  There's always something that ruins the experience."
    ],
    "Oppenheimer gets surprising R rating": [
        "The true cinematic innovation is Christopher Nolan's first sex scene",
        "\"For sexuality, nudity and profanity\" - For anyone wondering, Oppenheimer and Jean Tatlock, being played by Murphy and Florence Pugh in this movie, were actually lovers before Oppenheimer married Katie if I'm not mistaken. Probably involves some sexual content in that regard, outside of that I don't see how there's any sexuality in this story.",
        "Sexuality?\n\nNudity?\n\nIn my Christopher Nolan movie?",
        "Probably from that scene where Oppenheimer goes \"yo what the fuuuuuuck\" when the bomb goes off",
        "Nolan, the king of PG-13, doing an R-rated movie?\n\nWhat is this, 2002?",
        "\"The R-rating will come as a shock to some because of the seemingly tame subject matter,...the creation of the atom bomb. \"\n\n&#x200B;\n\n\"tame subject matter\"",
        "Do they show people dying of radiation poisoning? Because that’s pretty graphic.",
        "Oppenheimer : I‘m putting together a team. \n\n\nEinstein : you son of bitch, I‘m in.",
        "It's probably from when Slim Pickens rides the bomb all the way down.",
        "Oppenheimer probably hangs dong in the film",
        "A $100 million, 3 hour-long, R-rated biopic is going to dominate IMAX screens across the world for two weeks straight.\n\nGod-tier stuff, Nolan.",
        "Boy-oh.\n\nThree-hour run time;\nBig black-and-white segment;\nR-rated for sexuality, nudity and language;\n11 miles of IMAX film stock + 600 lbs\n\nNolan: Yippee-Ki-Yay, motherfucker\n\n21-07-2023\nBring the fuck on",
        "I heard there's a pretty explicit scene where Oppenheimer has sex with the bomb, and Nolan is refusing to cut it.",
        ">\\- The movie is so long that prints are “11 miles of film stock” that “weigh some 600 pounds.”  \n>  \n>\\- Nolan says \"best possible \\[viewing\\] experience\" is in IMAX 70mm. That's only available at 25 theaters in North America.\n\nI'm gonna watch this on a 2015 Kindle 7\" in 540P just to spite Nolan.",
        "The movie gets an R rating because a lot of women in the audience will be thinking about sex every time Cillian Murphy is on screen.",
        "Good, I was hoping to enjoy Oppenheimer without children running around the theater"
    ],
    "Saw it live.": [
        "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming)",
        "Christopher Nolan is okay with this. He wants the film to bomb in Japan (for authenticity).",
        "i heard they already saw the sequel too",
        "As a japanese i find this a bit funny.. japan can be a bit hmm i dont know how to say it they avoid such topics instead of facing it like the germans.. like i heard there's no one that hates the nazis more than the germans.. wish we could actually admit and face facts instead of avoiding it and hardly teaching the new generation? sorry my english sucks so i cant really put what i think in words",
        "Japan barely teaches their youth about WWII. The average Japanese millenial hardly knows why Japan were the bad guys here. Germany on the other hand, doubled down and shows everything to their youth on full display so they learn from the mistakes of their past. \n\nJapan is honestly doing the world a disservice by banning this movie there.",
        "It would have bombed there anyway. It is a hot topic with an explosive ending.",
        "nah they had the ending spoiled and are malding.",
        "Why does that bomb look like Charlie Brown?",
        "The ones who will want to watch it will pirate it.\n\nIt's a good movie btw.",
        "It is satire.",
        "Twice",
        "fake news",
        "Experienced it in 5D",
        "Did they really not showing it?",
        "This actually took me like a minute to get.",
        "Except for Germany, most countries try to hide their war crimes from their newer generation and try not to even mention it. Japan, US , UK are no new to this."
    ],
    "Matt Damon Calls Off ‘Oppenheimer’ vs. ‘Barbie’ Social Media Rivalry: ‘People Are Allowed to Go See Two Movies in a Weekend’": [
        "I was under the impression it was being promoted as a double feature.",
        "In today's economy?\nNo, Sir, I am sorry, I still need to pay rent!",
        "I don't think Matt Damon understands the joke.\n\nJust like DOOM x Animal Crossing. It's not a competition, just funny.",
        "Everyone I know is hyped for both anyway. This rivalry is an illusion.",
        "Ben Affleck Reignites 'Oppenheimer' vs. 'Barbie' Social Media Rivalry: 'Who The Fuck Watches TWO Movies in a Weekend?'",
        "This shouldn't turn into a rivalry, this could and should be a Doom Eternal x Animal Crossing: New Horizons situation. Two movies that will be forever intertwined, Barbenheimer.",
        "Don't tell me what to do matt Damon.",
        "This was even more of an issue when Charlie Day and Glenn Howerton released movies Fool’s Paradise and Blackberry respectively, on the same day a week or two ago. They said, “go see both, but I wish it wasn’t on the same day.”",
        "these comments make me feel so validated lol i said “in this economy??”",
        "Now if you have a family of 4 or took Mat Damon's investment advice there's no fucking way you can afford that, but he's right. It is possible to see 2 movies In a weekend",
        "Apparently he didn’t get the memo, we are no longer allowed to enjoy or hate two different things at the same time. It goes against the extremely adversarial way of 21st century living.",
        "Hah. This motherfucker thinks I can afford to see two movies.",
        "This is Coke and Pepsi hype where fans want both to succeed",
        "2 tickets a popcorn and 2 drink is like 40 bucks , fuck off",
        "Two movies in a weekend? Who the shit has time and money for that, Matt? Mash them up now and save me 2 hours of life. Have Gosling’s abs be the actual bomb.",
        "Yeah but a lot can’t afford it."
    ],
    "The upcoming movie \"Oppenheimer\" (2023) is projected to do well in the U.S., but bomb in Japan.": [
        ">Nolan tracked down and used actual 1940s-era audio equipment to record dialogue and create sound quality authentic to the time period.\n\n>After doing this for years, he applied it to the production of Oppenheimer.",
        "The upcoming movie \"Sunshine\" (2007) Cillian Murphy is looking at a big fireball",
        "Can't wait to not hear any of the dialogue in this one, too.",
        "Hey who let Jimmy Carr on Reddit?",
        "And like Morbius, they might try re-releasing it so it can bomb a second time.",
        "Actually its predicted to be a huge hit in select cities.",
        "Funny, the first name I see is Cillian Murphy’s and I think, “Is this a Nolan film?”",
        "Is that you dad?",
        "Well done dad",
        "I don't get it\n\nedit: I get it",
        "As a Japanese I’m offended…. But god dam it as a lover of comedy I applaud you sir",
        "Dr. Nefario?",
        "I just spit out my coffee lmaoooo",
        "This is because the film is considered Sci-Fi in Japan as World War 2 history has been completely erased from textbooks and school education in their curriculum.",
        "#tromboneslide",
        "Watch the film \"White Light / Black Rain\""
    ],
    "New Image of Cillian Murphy as J. Robert Oppenheimer in 'Oppenheimer'": [
        "A black and white movie with Cillian Murphy!?  But then, how can I get lost in his ocean blue eyes!!??",
        "In Theaters July 21, 2023\n\n[Official Teaser](https://www.youtube.com/watch?v=hflCiNtY6MA)\n\nMain Cast:\r  \n\r\n\n* Cillian Murphy as J. Robert Oppenheimer\r  \n\r\n* Emily Blunt as Katherine \"Kitty\" Oppenheimer\r\n* Matt Damon as Leslie Groves\r\n* Robert Downey Jr. as Lewis Strauss\r\n* Florence Pugh as Jean Tatlock\r\n\nAdditional Cast:\r  \n\r\n\n>Rami Malek, Benny Safdie, Josh Hartnett, Dane DeHaan, Jack Quaid, Matthew Modine, Dylan Arnold, Olli Haaskivi, Alden Ehrenreich, David Krumholtz, Michael Angarano, Kenneth Branagh, David Dastmalchian, Jason Clarke, Louise Lombard, Scott Grimes, Christopher Denham, James D'Arcy, David Rysdahl, Guy Burnet, Danny Deferrari, Josh Peck, Harrison Gilbertson, Emma Dumont, Matthias Schweighöfer, Gustaf Skarsgård, Devon Bostick, Alex Wolff, Tony Goldwyn, Trond Fausa Aurvåg, Gary Oldman, Josh Zuckerman, Olivia Thirlby, Casey Affleck",
        "By order of the Manhattan fookin Project",
        "My uncle is actually the guy who wrote the book the move is based on. His name is Marty Sherwin and he just died this year from cancer. I can’t stress how awesome it is to see one of my uncles books turn into a film. Plus the movie is supposed to be great, everyone should go see",
        "If I had to guess, this is possibly a snapshot of Oppenheimer before he goes into court because he was accused of being a communist. I hope I’m right, cause that is a huge part of Oppenheimer’s story",
        "Peter Bogdonovich would often quote Orson Welles and one of the things Welles would say is that \"every performance is better in black and white\"\n\nChristopher Nolan shooting IMAX in black and white and Cillian Murphy's acting may just be the winning combo",
        "I just saw the production budget for this film is \"only\" $100MM. I feel that's exceptionally light for a Nolan movie.\n\nEdit: It IS exceptionally light, considering 50% of the budget went to procuring several nuclear warheads previously thought to be missing. But no worries! Nolan will sell the remaining nukes at a profit for the studio, similar to how he sold the corn produced for *Interstellar*.",
        "Not going to lie it would be pretty cool if everything was in black and white until the explosion",
        "Gotta say. Really interested in seeing how Nolan does a film with little to no action set pieces/spectacle . I think the last one was The Prestige?(even Interstellar had a lot of spectacle). It's been more than 15 years since that.",
        "Nolan pushing boundaries once again. First feature to shoot IMAX in black and white. Looks really clean so far",
        "Peaky Heimer",
        "Take a little walk to the edge of town",
        "Cillian Murphy as main actor for Nolan he really deserves it",
        "So is this film in black and white or colour?\n\nThe date announcement poster suggests colour but ecery other picture suggests b&w",
        "fun fact: Robert Downey Jr., Matt Damon, and Emily Blunt took pay cuts to work with Nolan, earning $4 million each in lieu of the usual $10–20 million.",
        "I can’t stress enough my excitement for this movie."
    ],
    "I just wanted to watch wholesome bomb man movie": [
        "I just wanted to watch a wholesome movie about a man experiencing existential dread from inventing the most destructive weapon in history",
        "Just wait for the Paw Patrol movie. I heard it's gonna be extra spicy",
        "No cillian banana unfortunately",
        "Bro I watched The Wolf of Wall Street with my parents...\n\nDo not recommend, longest three hours of my entire life I swear",
        "Christopher Nolan (Apparently) said that there was no CG in the movie...",
        "Same I just want to watch a wholesome movie about the invention of a weapon capable of vaporizing small cities 😔",
        "Watch them anyways. Stare your family directly in the eyes the entire time. Keep chanting “it’s natural it’s natural it’s natural”. Do NOT blink. It’ll help keep thing chill and not awkward so everyone has a good time.",
        "THREE FUCKING SCENES WITH MY NEW GIRLFRIEND. 3!                                                    holy shit this blew up this is my first time on reddit, thanks for the upvotes.",
        "3? I only remember 2",
        "Five nights at Freddy’s will have a sex scene with markiplier",
        "You’re taking your family to R rated movies I think you should accept that risk.",
        "My sister wanted to watch that movies with whole family, but couldnt get tickets\n\nI literally Dodged a FUCKING NUKE!!!!!!!!!!!",
        "Never watched the movie. I have no effing idea on where three (3) sex scenes could be part of such story",
        "Bruh that first one hit me so off guard lmao, like I'm just watching some witty banter about political viewpoints and then just BAM- TITTIES.",
        "It’s interesting how it’s socially acceptable to watch a movie about nuclear genocide, but the moment there’s sex that’s when it becomes too much.",
        "People from conservative countries: wait there’s sex scene? All Ive seen was only a black dress"
    ],
    "Barbie (2023) is anti-men, or something. Lots of men seem to be upset. I wouldn't know because I haven't watched Barbie, because I am a man, and men don't like Barbie. Men like nuclear war, radiation poisoning and 200,000+ civilian casualties, which is why I watched Oppenheimer instead.": [
        "You know, I’ve seen a lot of people dressed up in bright pink to go see the Barbie movie, but nobody wearing a fedora and boxy suit jacket to go see Oppenheimer.",
        "Men don’t like Barbie’s, men like the piercing blue eyes of Cillian Murphy. They make us feel safe but also a little scared, but I’m a good way.",
        "You didn’t watch Barbie because men don’t like Barbies. \n\n\nI didn’t watch Barbie because I’m broke. \n\n\nWe are not the same",
        "Men like horses",
        "I don’t live under the tyranny of “Or”. I’ll be seeing Barbie “And” Oppenheimer.\n\nAlso Ryan Gosling just doesn’t make bad movie.",
        "I watched Barbie and loved it, though I am biased because the movie is about (and stars) literally me",
        "Real men suffer existential dread after seeing Oppenheimer!\n\nOH GOD WE’RE ALL GONNA DIE",
        "I operate under the assumption that \"and\" is still a viable coordinating conjunction, and thus, I have watched Oppenheimer AND will now watch Barbie. \n\nBTW, Oppenheimer was really fucking good.\n\nEdit: Now I've watched Barbie, and gotta say the movies could not be more different. As for entertainment, Barbie is easily my favorite movie of the year; the attention to detail and humor was WAY beyond what I was expecting. Both Oppenheimer and Barbie are 10/10 in my book. Both crushed it.",
        "Watched Barbie this afternoon. As far as I can tell the message is that horses are an extension of masculinity and honestly I agree.",
        "What man goes into watching a Barbie movie expecting it to be not about women",
        "Thing is, Barbie is for all genders. I can tell because I’m a man and I really enjoyed the Barbie movie.",
        "Dude, stop with the negative Kenergy. You are Kenough.",
        "So many levels to this one.",
        "Real mean watched Barbie and loved it",
        "No, men like fur coats, horses, the patriarchy, and the beach",
        "I wish being a man was about horses instead of oppressing women"
    ],
    "Christopher Nolan Bombshell: Director Talking To Multiple Studios On Film He’ll Direct About J. Robert Oppenheimer & Development Of The A-Bomb In WWII": [
        "This son of a bitch is going to try to detonate a real nuke, isn’t he?",
        "I'm calling it now: Sony is going to pick this up.\n\nThey got QT when he shopped Once Upon a Time in Hollywood around town, and Sony has been very vocal about protecting the theatrical window.",
        "Interesting, especially considering Oppenheimer is directly referenced in TENET",
        "He'll probably try and use a real nuke instead of CGI.",
        "Sounds like it's going less of a high concept big budget action movie and more of a straight forward period drama. It's the smart direction to go for Nolan. Also, going by that photograph surely Mark Rylance will be cast as Oppenheimer",
        "I dig it, not sure how you do this in IMAX since it's likely to be more of a straight-up drama than anything he's done in the past decade plus.\n\nBut honestly I'd kind of love to see him do a mid-budget thing a la *Insomnia*, I'm pretty sure he's made quotes along the lines of as long as he gets massive budgets he's going to make big ideas for the big screen and I certainly don't fault him that. \n\nBut would be very curious to see him scale back a bit from what he's been doing of late.\n\nHaving said all this, we'll probably get IMAX footage of nuclear testing, right? Can't wait to see Bikini Atoll in all its IMAX glory, and a POV shot from/of the nuke.",
        "It took me way too long to understand they were just making a pun.. I was like, how is a movie director making a new movie considered a \"bombshell\" lmao....",
        "WB: \"You leaving us?\" :'(\n\nNolan: \"Don't talk to me or my brother ever again!\"",
        "I wish he would make a small scale film like Memento again.",
        "I’ve wanted this movie forever. Oppenheimer was a fascinatingly complex person. I hope Nolan does this justice.",
        "I'd watch that. Anything about the atomic era (especially the dangers of it) it is something that peeks my interest.\n\nAlso, if it weren't for the miniseries that recently came out - Nolan would have been a good filmmaker to make a Chernobyl film",
        "So … remake of “Fat Man and Little Boy”  a classic .\nDwight Shultz played a brilliant Oppenheimer",
        "The fact Nolan is considering other studios is wild. WB really needs to be nuked and start over",
        "**It was cheaper to build and detonate a real atomic bomb than pay the special effects artists.**",
        "I’ve read dozens of books on Oppenheimer and the development of the atomic bomb (my favorite being ‘The Making of the Atomic Bomb’ by Richard Rhodes) and put some of my best writing into 70+ pages (thus far) of a script based on this man and this project. Painful to see this announcement today. Almost surreal.",
        "Michael Caine: \"Someone set us up the bomb\" (probably)"
    ],
    "Picture of J. Robert Oppenheimer taken as he completed the final design of the atomic bomb. (1944)": [
        "\"Now I become Death, Destroyer of Worlds.\"",
        "He's really smug about it too.",
        "Herobrine = hitler",
        "u/title2imagebot",
        "That's what you get when you give the smartest scientists in the world a bunch of funding and resources. ",
        "More accurate if it was Nobel (he invented dynamite)",
        "That's hot 👌",
        "Penheimer's inventions were OP.\n\nThat's why he changed his name.",
        "Modded minecraft is great because you really can build a nuke but the downside is that you have to learn a minecraft version of nuclear physics and you weren't trying to build a nuke, you were trying to build a nuclear power plant in the middle of your base since transferring power causes massive server lag, and also the nuclear element is extraneous because it's really powered by chickens endlessly giving birth and dying. Then you delete your world and am become death, destroyer of worlds.",
        "\"Vishnu is trying to persuade the prince. And, to impress him, takes on his multi-armed form and says: Now I have become Death, the Destroyer of Worlds.\"",
        "Make me understand this meme",
        "[even better](https://www.reddit.com/r/MinecraftMemes/comments/al3a6j/that_oh_so_terrible_bomb/?st=JRI57MIX&sh=feef126e) ",
        "Harnessing the power of 10000 creepers and dropping it on Hiroshima.",
        "I see what you did there",
        "Salute to the greats 🙌🏻",
        "A true genius"
    ],
    "Power went out 20 minutes into Oppenheimer. Waited about an hour for it to be restored and movie restarted, only for the movie to restart again automatically at the next show time and being kicked out of the theater. Didn’t get to see the last 30 minutes or so.": [
        "Refund!",
        "I was at the midnight showing of Star Wars Episode II with my dad way back in 2002 (I was in high school) and this happened before the movie started. Power outage and we all had to leave the theatre and go home. It sounds dumb now but these midnight showings were a big deal, I remember my dad had gone days ahead and got the tickets for us. I don’t remember if we got a refund, but 17 year old me was incensed.",
        "The bomb dies",
        "Refund and free ticket",
        "hate to ruin it, Hiroshima got the bomb.",
        "Spoiler Alert: the bombs worked",
        "Lubbock? This happened to the showing before me today and they bumped the next showing but started it before everyone was seated. Complete clusterfuck",
        "You waited an hour? Refunds should have been given out like 5 min after.....",
        "Wait, I thought theater problems only happened to “Sound of Freedom”?  That’s all I’ve heard lately, anyway.",
        "Should we boycott and claim that “they” don’t want us to see this movie?",
        "ThE sTuDioS dOn'T wAnT yOu tO seE tHIs mOviE!!!1111",
        "OP, here is the ending, will do the spoiler thing if anyone chooses not to see\n\n>!basically Oppenheimer's clearance ends up retracted, but he is awarded years later by the govt and meets Truman. he expresses his guilt to Truman, who goes on a spiel abt japn not caring who made the bomb. los alamos' fate is brought up, jro says it will be dismantled but truman's security advisor (?) says it will be used for the H-Bomb project instead. the h bomb is also a point of moral discontent for oppenheimer. movie cuts to the earlier scene meeting with einstein, conversation is revealed, and last line is jro's response to einstein bringing up the fact the world may end cause of the test, whole conversation goes \"Albert, when i brought you those calculations i thought we would start a chain reaction that would destroy the entire world. I believe we did.\"!<",
        "It was a good movie! I watched it today and *chefs kiss* perfect",
        "more than mildly infuriating imo",
        "I missed the last 5 minutes of Boogie Nights due to power outage. If you’ve seen the movie you’ll know the last scene explained the whole movie…",
        "As a guy who works at a theater, believe me when I say that nobody hates those power failures more than us. If the blackout is brief enough that we don't have to close, then there's only so far we can set back those movies once the power comes back on. If it drags on too long, then we have to start canceling shows and eventually close down and have guests leave the building for the sake of safety. This is usually determined by the battery life of our emergency lighting and whether or not we know if the power will come back on before they die. I'm actually kinda surprised you were allowed to stay in the auditorium with the power out for that long.\n\nOftentimes, even a quick flicker or brownout can set us back by a good 20+ minutes, as we have to go to each projector and get them back up, one by one. This doesn't even factor in the occasional technical issues that commonly occur from power failures. Given that most showtimes only have roughly half an hour gap between them, that leaves very little time to clean and set up for the next show. To add to this, the movie schedule on each projector is largely automated. Yes, we have a little room to make adjustments, but we can't allow a movie to run over the next scheduled showtime.\n\nIf the next showing of Oppenheimer was late because the prior show ran too long, then all the guests waiting for the next show would be inconvenienced in addition to those who were already affected by the blackout. You'd basically be causing *more* problems by trying to lessen the severity of the initial problem.\n\nIt's *much* easier and far faster to simply hand out passes (usually *with* refunds) and try to salvage the remaining showtimes, which are likely just as busy as the ones that got interrupted or canceled. It also reduces the spread of how many guests are affected by the issue, which I feel may be the primary factor involved here."
    ],
    "Steve Buscemi. AMA.": [
        "Did you enjoy filming Ghost World? What do you think of the ending, is it open ended or is there a definite answer? P.S. I love you",
        "Mr. Buscemi, have you seen the FX series Fargo, and if yes, what did you think of it compared to the original movie?",
        "[Rolling out](https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
        "When you started work on the Sopranos, were you aware from the start what would happen to your character in the end, or was the storyline an evolving thing?",
        "Who is the better bowler, you or John Turturro?",
        "Thanks for doing this.  What question were you hoping would be asked but wasn't?",
        "Hello, Mr. Buscemi! Huge fan of yours. \nWhat are some of your favorite albums?",
        "What would you say is your element?",
        "What is your current favourite on-going TV show?",
        "What is the best advice you can give a young person about life in general?",
        "Greetings!  Favorite memory working with Tarantino? Thanks!",
        "Any good stories from on the set of Big Lebowski?",
        "I use your [name for my Pizza Hut orders](http://i.imgur.com/bE8zdjt.jpg). Is that ok?\n\np.s. I'm a big fan of your work.",
        "Hi Steve! You're in so many great movies that if I'm surfing the channels and one of them is on, I have to stop and watch. (Fargo, Billy Madison, Con Air, etc.) \n\nWhat are some movies that you have to stop and watch every time they're on?",
        "I loved Trees Lounge! Do you think you'll ever get back into writing? Or maybe especially writing / directing / starring?",
        "Hello! Con Air 2, yes or no?"
    ],
    "Anon doesn't like oppenheimer": [
        "Lmao nerd with a fat tie lmao",
        "He said it was inhumane AFTER he got his paycheck from the government and the bomb was dropped, no conflicting thoughts before hand tho",
        "⠀⠀⠘⡀ “Now I am become Death,            : ⠀⠀⠀⠑⡀⠀the destroyer of worlds.”⠀⠀⠀⡔⠁⠀⠀⠀ ⠀⠀⠀⠀⠈⠢⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠴⠊⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⢀⣀⣀⣀⣀⣀⡀⠤⠄⠒⠈⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠘⣀⠄⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡠⠔⠒⠒⠒⠒⠒⠢⠤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⡰⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠑⢄⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⡸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠙⠄⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⢠⠂⠀⠀⠘⡄⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠈⢤⡀⢂⠀⢨⠀⢀⡠⠈⢣⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢀⢀⡖⠒⠶⠤⠭⢽⣟⣗⠲⠖⠺⣖⣴⣆⡤⠤⠤⠼⡄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠘⡈⠃⠀⠀⠀⠘⣺⡟⢻⠻⡆⠀⡏⠀⡸⣿⢿⢞⠄⡇⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢣⡀⠤⡀⡀⡔⠉⣏⡿⠛⠓⠊⠁⠀⢎⠛⡗⡗⢳⡏⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢱⠀⠨⡇⠃⠀⢻⠁⡔⢡⠒⢀⠀⠀⡅⢹⣿⢨⠇⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⠀⠠⢼⠀⠀⡎⡜⠒⢀⠭⡖⡤⢭⣱⢸⢙⠆⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⡸⠀⠀⠸⢁⡀⠿⠈⠂⣿⣿⣿⣿⣿⡏⡍⡏⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⠇⠀⠀⠀⠀⠸⢢⣫⢀⠘⣿⣿⡿⠏⣼⡏⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣀⣠⠊⠀⣀⠎⠁⠀⠀⠀⠙⠳⢴⡦⡴⢶⣞⣁⣀⣀⡀⠀⠀⠀⠀⠀ ⠀⠐⠒⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⢀⠤⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠀⠀⠀",
        "Oppenheimer is just the face. The bomb would also have been build without him.",
        "That guy's either the father of world peace or the cause of its distruction. I'm with Op on that",
        "\"I'm building a bomb for the government\"\n\n\n\"NOOOO DON'T USE IT TO BOMB PEOPLE!!!\"",
        "Doesnt beat the \">I have become deatherinooo\" greentext",
        "Oppenheimer wanted to make a tactical nuclear weapon that could be used on the battlefield, he was specifically against the \"super bombs\" and the advocates for the \"super bomb\" were so scared of communism that they would accuse Oppenheimer of only wanting tactical nuclear bombs because he had orders from Moscow to do so. The bombs that ended up being made were exactly the ones Oppenheimer didn't want to make.",
        ">Robert Oppenheimer was a fucking idiot.\n\nIdk. Could an idiot build a world destroying weapon?",
        "Ngl that's a flex",
        "Oppenheimer must be the first human to make a decision and regret it later. \n\n Anon is regarded beyond belief.",
        "Why his tie like that",
        "No dont drop the bomb your so sexy ahha",
        "> If you want peace, prepare for war.\n\nWithout nukes, we would probably be on world war six by now..",
        "I mean, before the Trinity test nobody could really imagine the exact power of it. To witness such unimaginable destruction first-hand, would probably change the mind of anyone. \n\nAlso I'm pretty sure that Oppenheimer kicked for the Reds and the government had a close eye on him during the project, so he didn't enjoy making it very much lmao.",
        "we should have bombed aliens with it instead"
    ],
    "Inside Edition tries to blame video games on the recent New Oxford school shooting, incorrectly attributing the famous J. Robert Oppenheimer quote to Fallout 4": [
        "Wasn’t Oppenheimer quoting a Hindu text?",
        "Yeah blame violent video games not violent reality",
        "IT HAS NEVER BEEN, OR EVER WILL BE, VIDEO GAMES FAULT!",
        "Wtf does hikhock45 have to do with this he is cool asf",
        "Yeah, it was the video games. And surely not his fucking degenerate parents who bought the gun and ammo for him and treated any fucking warnings given against him like they were an achievement.\n\n\"Journalists\" who continue to push the \"Video Games cause violence\" narrative in 2021 deserve to be arrested for journalistic malpractice.  \n\nIt has been definitively disproven from every possible angle ever since the issue has been studied but these fucking brain trusts refuse to read a fucking study to save their goddamn lives.\n\nSo, Inside Edition, please do this whole world a favor and remove your head from your fucking ass and do some actual goddamn research before you continue to push a narrative that only exists in you atrified brains.",
        "After playing 76 I only wanted to kill myself",
        "Yes… the famous quote from… Fallout 4…",
        "Of course. It’s another case of an insane piece of shit, whose parents failed him/actively encouraged bad behavior, which then sadly leads to  a horrific tragedy, so of course they’ll try to put the blame anything but",
        "these parents just failed in so many ways. now ima have to hear my in-laws tell me its all the video games fault. not the parents who bought him the games and let him play with the guns/ have access to the guns AND ammo. or brushing off the signs he might hate his school and everyone in it.",
        "I wish they would just stop with the video game argument sheesh 🙄",
        "I want to strangle the person who decided to blame this on videogames",
        "I blame Minecraft",
        "Twenty-two years from Columbine the mainstream media still has *no fucking clue* why kids are doing this.\n\nNo, I don't believe it. This isn't incompetence, it has to be deliberate. Somehow, this kind of spin makes them money. Is it the ratings? Something else?\n\nI feel like there is an intent to misattribute blame in order to *perpetuate* these tragedies.\n\nHere's what's to blame:\n\n1. Not taking children's mental health seriously. Doesn't matter if it's a phase or not--if a child seems depressed, obsessed, or whatever *get them to a counselor* and *find out what is wrong*. Could be bullying no one noticed, could be a bad breakup, could be a genetic disposition to chemical imbalance--*find out*, and help these children deal with it. In this case, it sounds like action was taken far too late; it's a good bet that earlier signs of trouble were ignored.\n\n2. Schools ignoring the social structure students set up for themselves. There should be active efforts to integrate cliques, to ensure that students are not excluded or insulated, and to deescalate interpersonal conflicts so they do not become grudges. I haven't seen any reporting on this boy's social situation yet, but I'll bet it had something to do with his choices.\n\n3. Parents who should not own guns or have children. If you can't keep your gun out of your child's hands you must lose the right to posses guns. If you are unaware that your child is playing with guns, you must lose your right to posses children. Maybe you get a chance to earn both back later, but you need to prove to a court that you are competent to care for the safety of your child and competent to handle a firearm. I think some people are tempted to make this the primary target of blame, because they need a simple thing to blame, but there are a lot of things parents *don't* control or know about their kids, especially after puberty--in this case, however, they need to go to jail as well.",
        "1. He didn’t even have the game with the quote.\n\n2. That quote is super famous, like I didn’t even know it was in that game yet I know about the quote.\n\n3. I don’t have any other points this list would just look super short with only 2 points.",
        "Truly pathetic reporting. They might as well be blaming D&D or Satanism.",
        "It wasn't videogames this time, or the time before, or the time before,or the times before, or last month, or three years ago or at any point in America's proud history of school shootings. It's availability to guns, shit education systems, a completely blazé attitude to mental health and bullying and general apathy to the future of your children.\nIf It ain't making money, they don't give a fuck."
    ],
    "‘Drake and Josh’ Star Josh Peck Joins Christopher Nolan’s ‘Oppenheimer’": [
        "“Hug me, Oppenheimer!”",
        "“Oppenheimer.”\n\n“Yeah?”\n\n“Where’s the atom bomb?”",
        "The bomb. It's nuclear! NUCLEAR!!!",
        "They’re gonna NUKE OPRAH!",
        "It's official now: Literally everyone can and will be in this movie.",
        "Great to see him getting his first role in a blockbuster since he hasn’t had a huge role outside of the Ice Age franchise.",
        "He'll be the lead in the [sequel](https://youtu.be/kQeC06SdicI) too.",
        "Oppenheimer, where’s the nuke?",
        "Wow quite the career jump for him.\n\nNice revival roles for him and Josh Hartnett even if their roles are small.",
        "Nolan is employing half the actors in Hollywood with this movie.",
        "At this rate I’m expecting a Elijah wood and Haley joel osment announcement anytime soon",
        "I RAN OVER OPRAHEIMER!",
        "This has nothing to do with this movie but y’all remember that sushi episode of Drake and Josh? Good times.",
        "He better be creating the Game Sphere",
        "Well this is the moment that confirms he has eclipsed Drake in his career. That is huge.\n\nFor some reason I have paid close attention to this. Josh mostly stayed relevant through Vine/TikTok and the rare nostalgia, while Drake was very behind him during the Vine era (Reports of him living in Disneyland) and Drake kind of got an edge when he went full pandering to Mexico and changed his name and started making spanish music. This is where Josh has truly won. The whole pedo scandal with Drake certainly didn't help.",
        "Let's see what Drake has been up to...oh no!"
    ],
    "\"the nukes weren't real\"": [
        "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
        "Hydrogen bombs being called less lethal...",
        "Congratulations on attaining the level of ignorance where nothing is true and everything is possible.",
        "I once took a walk in Hiroshima along the back alleys and every now and again you can see this concrete fencing with shadows from the blast. If you know where to go, there's shadows in a lot of the standing buildings from the 40s. \n\nYou'll also notice that all the buildings in the center of the city are very new compared to the buildings on the edge. \n\nThe bombing definitely happened.",
        "Yea Japan just decided to surrender as a prank for us to figure out 80 years later",
        "This person watched a movie about Oppenheimer now believe they are an expert on nuclear weaponry. Congrats",
        "That’s where I’d one-up their moon landing conspiracy with, “you’re one of those nut cases who believes in the moon?!”",
        "Japan and USA: *at war with each other*\n\nUSA: hey uhm, the two bombs we just dropped, that killed hundreds of thousands of your civilians and destroyed two cities?\n\nJapan: yea we remember those\n\nUSA: can we both pretend they were atom bombs? Would make us both look cooler IMO\n\nJapan: okay, btw we surrender\n\nUSA: noice",
        "Where did the 200,000 ppl go??",
        "Why would someone think a hydrogen bomb would create less fallout? \n\nWhy would someone think Nagasaki and Hiroshima had 0 fallout? \n\nThe answer here, of course, is the word ‘think’. Not much of that in evidence here at all",
        "Wow! Somebody saw a movie. That’s “research”.",
        "A person who doesn't know how video recording works questions the existence of atom bombs.  \n\n\nColor me surprised...",
        "Big Nuke doesn’t want this truth out there. Watch your back",
        "I had the unfortunate luck of working with a guy who believes nukes are actually huge napalm bombs. No amount of evidence or science could convince him. For weight to his conviction, he also tried to prove it by explaining that the Earth can't be proven to be a globe, dinosaurs never existed and all Governments are secret society tyrants. He was absolutely off his dome.\nOne shift he explained to me that he can \"see them at night on his skin\". I quizzed what he was referring to initially and quickly realised this was a terrible decision after I was shown a photo album worth of 3am forehead pics of \"the butterflies\". \"You can't see them because they don't want you to see them, but they're always there\". Off, his, dome. \nPoint is that people with these beliefs often share tendencies and ideas of those with paranoid schizophrenia and associated mental illness. Man needed help but he was lost. He also got sacked for fighting someone 22 years his junior because of how he emptied a wheelie bin.",
        "So the Cold War and the height of the Cuban Missile Crisis was just a prank bro lol",
        "You know, I would not be suprised if someday, this idiots join the ranks of Holocaust Deniers"
    ],
    "Matt Damon, Robert Downey Jr. Join Christopher Nolan’s ‘Oppenheimer’": [
        "Genuinely excited to see what a Nolan directed RDJ feels like.",
        "Downey in a Nolan movie? Glad to see him in more stuff like this and less stuff like Dolittle…",
        "It's impossible.\n\nRobert Oppenheimer was able to build this in a cave... with a box of scraps!",
        "Now we just need Christian Bale to gain 9700 pounds for the role of \"Little Boy\"",
        "Oceans 14 - This Time It’s Nuclear",
        "Matt Damon is on a nice run I think, neither Stillwater or The Last Duel were big hits but both were really solid films.",
        "This movies cast is so stacked. With Cillian Murphy and Emily Blunt it already looked very promising.",
        "The amazing cast continues to grow, one of Nolan’s best so far:\n>Matt Damon and Robert Downey Jr. have joined Cillian Murphy in Oppenheimer, Christopher Nolan’s biopic on J. Robert Oppenheimer, one of the fathers of the atomic bomb.\n\n>Emily Blunt is already on board the Universal project, and with Damon and Downey now flying in, Oppenheimer has become one of the most stacked feature projects in recent memory.\n\n>**Damon will play Lt. Gen. Leslie Groves, the director of the Manhattan Project that created the atomic bomb.**\n \n>**Downey Jr. will play Lewis Strauss, the infamous Atomic Energy Commissioner who initiated hearings that questioned Oppenheimer’s loyalty to the United States and infamously had the scientist’s security revoked.**",
        "First the HBO mini with Park chan-wook and now working with nolan, really looking forward to rdj career post MCU",
        "I remember in her interview with Howard Stern while promoting A Quiet Place Part II, Emily Blunt talked about she was close to be casted as Black Widow and she wanted to work with Robert Downey Jr. And here we are.\n\nLink:\n\nhttps://youtu.be/QYepmFsi5jE\n\nhttps://youtu.be/kBQmOrmN20k",
        "I'm calling it now, this is going to be the first movie to detonate an actual nuclear bomb as part of its filming. Nolan is going to move mountains for authenticity.",
        "Fucking awesome. Love them both\n\nEdit: holy shit Emily Blunt too? I only heard about cillian",
        "This movie has definitely become more interesting and I'm curious to see what kind of performance Nolan gets out of Robert Downey Jr.",
        ">> Robert Downey Jr cast\n\nOh, so that’s why it has to cost $150 million",
        "Robert Downey Jr in a Nolan movie? Wonder how big of a hit this'll be in India",
        "Yes but what about My Cocaine?"
    ],
    "At the end of \"Oppenheimer\" (2023), the main character comes home at night and a mysterious man steps out of the shadows. \"My name is Albert Einstein\" he says. \"I'm here to talk to you about the Physicists Initiative.\"": [
        "“My name? Albert Einstein.”",
        "And then they reveal the scientist that created Tenet (2020)'s time travel was a member of this group.\n\nIt all comes down to the NCU (Nolan's Cinematic Universe™)",
        "\"Do you think you're the only physicist in the world?\"",
        "\"I'm putting a team together, you in?\"",
        "It’s Einsteinerin Time!!",
        "Physicists assemble.",
        "[deleted]",
        "Oh shit the ww2 cinematic universe. \n\nFinally excited to see all the books turned into movies!",
        "I would watch the fuck out of that",
        "Could there be a crossover where he meets a wheelchair-bound genius with motor neurone disease called \"Professor H\"",
        "“I am Oppenheimer.”",
        "\"This is Barbie,she killed 10 men with her bare hands for this plutonium agent oppenheimer!\"",
        "Hilariously this is almost the plot of a great Jonathan Hickman comic series The Manhattan Project",
        "The King's man actually had a kinda similar joke in it's after credit scene. The whole movie is about the first world war, and the after credit scene shows the villains that got away talking about their next plan and how they've already found the perfect leader for their army, and then Adolf Hitler Walks into the room before the movie Cuts to black.\n\nI find the fact they were never planning on making a sequel but decided to do a very Marvel style set-up is probably the funniest part of the movie.",
        "My mind always pictures Einstein in the 1800s….but the real question is what was he doing during the world war 2…",
        "Oh SHIT, it’s Niels Bohr! Marie Curie! Fuckin’ Werner Heinsenberg! OMG it’s really happening y’all!"
    ],
    "[Colorized] J. Robert Oppenheimer and Albert Einstein, 1947 [678x750]": [
        "Is it just me or does the place where Einstein's forehead and hair meet looks weird.",
        "Making a shopping list for Einstein’s infamous atomic brownies.",
        "\"Oppie, now we're all sons of bitches\"",
        "The average intelligence in that room must be high..",
        "Can't wait for the Nolan directed Oppenheimer movie!",
        "Link to the original B&W : https://learninglab.si.edu/resources/view/2188#more-info\r  \n\r  \nMore of my work : https://yigitcanyontem.wordpress.com/\r  \n\r  \nAlfred Eisenstaedt's photograph brings together two generations of world-renowned physicists at the Institute for Advanced Study in Princeton, New Jersey, where J. Robert Oppenheimer accepted the position of director in 1947. Under Oppenheimer's leadership, the institute became a leading center for theoretical physics. Albert Einstein had been a scholar-in-residence at the institute since 1933, after fleeing Nazi Germany and renouncing his German citizenship. Einstein transformed the world of physics with his theory of relativity and work in quantum mechanics. On the basis of Einstein's recommendation, President Franklin D. Roosevelt convened a board to investigate the possibilities of using a nuclear chain reaction as an atom bomb. Oppenheimer directed the Manhattan Project, which developed and detonated the first atomic bomb in the desert outside of Alamogordo, New Mexico.",
        "\"And this is the last time I'm helping you with the math, Bob. Ask Eddie next time.\"",
        "[https://imgur.com/a/ImFt4vK](https://imgur.com/a/ImFt4vK)\n\nHairline fixed version",
        "Noticed I got the same pullover",
        "Currently reading American Prometheus, great book btw.\n\nI am guessing the picture was taken at IAS?",
        "\"You see Opie, you heat it just enough to vaporize it without using any fire. I call it a dab\"",
        "Both were 25 years old.",
        "Now that I think of it I don't think there are that many publicly common photos of Oppenheimer. You see various pictures of Einstein all over the place but not of Oppenheimer, this is the first I've seen this angle of him. I assume he wasn't a very public figure.",
        "Shout out to The Making if the Atomic Bomb by Richard Rhoades, a fantastic book about the mathematics, physics, politics and ethics of creating and deploying nuclear weapons. Dives pretty deep into the physics dating back to the discovery of the nucleus by Ernst Rutherford and ends with horrifying firsthand accounts of atomic destruction from Japanese citizens who lived through Hiroshima and Nagasaki. It is chilling. The book is great. \n\nMy favorite part is about Leo Szilard, a Hungarian born Jewish physicist who lobbied for the creation of an atomic weapon because he feared the Nazis would get there first. After the weapon was assured he urged the US government to tell the world to prevent a secretive arms race. And he was absolutely correct, the USSR and USA raced to build bigger and more destructive bombs which threatened to end humanity. Dude saw the importance of nuclear weapons before almost anyone else and he predicted the nuclear arms race.",
        "The intelligence in this photo is more than that found in entire photo albums.",
        "Nerds"
    ],
    "Christopher Nolan Chooses Universal Pictures For His Film About J. Robert Oppenheimer & The A-Bomb": [
        "Opening scene: Oppenheimer looks nervously at his pocket watch as he waits for news of the first bomb dropped on Hiroshima. \n\ntick tick tick tick tick tick",
        "Universal will let him detonate a real atom bomb.",
        "Can't wait to see Christian Bale as the atomic bomb!",
        "Details:\n\n>Universal Pictures has landed the right to finance and distribute the next film that Christopher Nolan will direct based on his script about J. Robert Oppenheimer and his role in the development of the atom bomb. A theoretical physicist who became the director of the Los Alamos Laboratory, Oppenheimer headed the research and development of the bomb that ended WWII, under what was covertly called the Manhattan Project. Nolan will produce the film alongside his wife and longtime producing partner Emma Thomas for their Syncopy Inc. banner.  \n>  \n>Sources said that the film is now green lit to begin production in the first quarter of 2022. When Deadline broke the story a few days ago about this film being shopped, I’d heard Nolan’s longtime collaborator Cillian Murphy was in the mix for a key role. That might happen still, but I’m persuaded there are no definitive casting attachments at this point.\n\nNolan is leaving Warner Bros after nearly 20 years working with them.",
        "Interesting. Friendship ended with Warner Brothers, Universal is my best studio now.",
        "I suspect the soundtrack will be LOUD",
        "watch the title of the movie be \"destroyer of worlds\" or something",
        "This fucker is going to assemble and dismantle a real nuclear bomb isnt he",
        "Headlines are either going to be:\n\n\"A-Bomb blows away box office expectations\"\n\nOr\n\n\"A-Bomb self destructs at the box office\"",
        "I'm surprised there aren't more movies about the Manhattan project. It's an absolutely fascinating event in history, but I don't think I've seen a single movie about it.",
        "other directors: \"i have this script. can you please give me money mr studio boss? please? please? please?\"\n\nnolan: \"i have this script. tomorrow i let you know which one of you fuckers i allow to give me money.\"\n\nmust be nice to work at this level lol",
        "I cant wait for Oppenheimer to teach Einstein the theory of relativity after the Trinity test blasts him into the Tesseract.",
        "I wonder if this has anything to do with his annoyance with HBO Max’s same day streaming model",
        "What, how could he turn down Blumhouse?",
        "[deleted]",
        "Shit is there gonna be a press conference with him signing a contract and holding up a numbered jersey?"
    ],
    "Emily Blunt Joins Christopher Nolan’s Oppenheimer (Confirmed)": [
        "Surprising choice to play Richard Feynman, but it could work.",
        ">The studio has set a July 21, 2013 release date for Oppenheimer.",
        "Emily Blunt, Cillian Murphy... really great casting so far!",
        "Details:\n\n>Emily Blunt is stepping into the world of Christopher Nolan. The actor is joining Cillian Murphy in Nolan’s Oppenheimer, The Hollywood Reporter has confirmed. Universal is releasing the biopic of J. Robert Oppenheimer, the theoretical physicists remembered as one of the fathers of the atom bomb.  \n>  \n>This is Blunt’s first project with Nolan, who is known for building relationships with actors over multiple films and tapped Murphy as his lead after including him in supporting roles dating back to 2005’s Batman Begins. Blunt recently appeared in Paramount’s A Quiet Place Part II and Disney’s Jungle Cruise. Deadline first reported the news of her casting.\n\nEmily will reportedly be playing Robert's wife, Katherine ([Deadline](https://deadline.com/2021/10/emily-blunt-christopher-nolans-oppenheimer-universal-1234858556/)) and the movie is set for a July 21, 2023 release in theaters.\n\nIt’s also been confirmed that Universal will honor Nolan’s 100-day release window in theaters before it moves to streaming on Peacock. ([Source](https://deadline.com/2021/10/donna-langley-universal-studios-halloween-christopher-nolan-peacock-1234852240/))",
        "Will Nolan use a real Atom bomb on set?",
        "[deleted]",
        "Oppenheimer is so hot right now. SF author Robert J. Sawyer published a book about him last year. \n\n>On the 75th anniversary of the dropping of the atomic bomb, Hugo and Nebula-winning author Robert J. Sawyer takes us back in time to revisit history…with a twist.\n\n>While J. Robert Oppenheimer and his Manhattan Project team struggle to develop the A-bomb, Edward Teller wants something even more devastating: a bomb based on nuclear fusion—the mechanism that powers the sun.\n\n>Teller’s research leads to a terrifying discovery: by the year 2030, the sun will eject its outermost layer, destroying the entire inner solar system—including Earth.\n\n>As the war ends with the use of fission bombs against Japan, Oppenheimer's team, plus Albert Einstein and Wernher von Braun, stay together—the greatest scientific geniuses from the last century racing against time to save our future.\n\n>Meticulously researched and replete with real-life characters and events, The Oppenheimer Alternative is a breathtaking adventure through both real and alternate history.",
        "[deleted]",
        "Anne Hathaway joins a Nolan film again, sees Emily Blunt, gets flashbacks of getting yelled at by a premiere fashion designer",
        "Cillian Murphy + Emily Blunt + Christopher Nolan \n\nVERY NICE",
        "Did Oppenheimer have a dead wife?",
        "John Krasinski cameo as FDR, pls. (*/s*)",
        "Great casting. Looking forward to this",
        "She is a dynamite 🧨",
        "We can safely assume Michael Caine will have a role",
        "Where the hell have I been? Nolan is doing a movie on Oppenheimer? Lord in heaven -- I've never been more excited about an upcoming Nolan movie."
    ],
    "apparently, we can't use BTS for anything anymore.": [
        "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
        "Speaking of multiple entities using the same acronym, I worked for a forest department before BLM was a thing. So when people were saying the acronym \"BLM\" for Black lives matter, my mind kept jumping to \"Bureau of Land Management\". For a few seconds I was always confused as to why the Bureau was protesting and what for lol.",
        "This is like Kylie Jenner trying to trademark the name Kylie... \n\nPlease fuck off.",
        "There goes my Bacon Tomato Sandwich",
        "I'm 99% sure the reason people hate kpop is because their fans are this insufferable",
        "Think this was edited; that response was under a bts from captain america, which is equally as stupid",
        "My diploma is literally a BTS : Brevet de Technicien Supérieur (excuse my baguette)",
        "Wait until they find all the bts packages at Walmart that we get every year when it's time for school to begin",
        "Fuck, I can't even get google to give me results for bts that aren't that damn band.",
        "You can try BTK.  That one is probably still available…",
        "I was looking for a \"behind the scenes\" video for some movie (can't remember which one), and all this K Pop stuff shows up, and I was like \"wtf is this?!\". Lol!",
        "they will be sorry in France, BTS is for 'Brevet de Technicien Supérieur' for education in a mostly technical field.",
        "Dear BTSbaby102 please remove baby from your Twitter handle to get likes. As a parent to an actual baby, I take offense. Mkay thanks.",
        "Next, Musk fanboys bitching over tweets about Nikola Tesla and Apple fanboys bitching over tweets about apple trees.",
        "\"our BTS kpop name\" when you have to explain the joke",
        "BTS is in Oppenheimer? No wonder it was released with Barbie"
    ],
    "Regarding Oppenheimer": [
        "Hit em with the comebackenheimer",
        "The Emmy bit made me curious. He was the production coordinator for a reality series that won an Emmy for “Outstanding Creative Achievement in Interactive Media — Multiplatform Storytelling”. \n\nNot sure if it’s the comeback that he thinks it is, in this case.",
        "[deleted]",
        "Hardly a clever comeback",
        "The guy is rightthe movie is good, but its far from the greatest. Nolan is starting to get up his own ass with every movie, still good as I said, just overexagerated",
        "Not a clever comeback. Winning an Emmy for “Outstanding Creative Achievement” and then trying to name drop it doesn’t carry the weight he thinks it does. Especially if he’s trying to make it seem like it makes him an authority in deciding the greatest movies of all time.",
        "This is bad. As someone who has a degree in film, anyone who uses their film degree to explain how they're so smart, probably isn't that smart.\n\nAnd dude's emmy was for interactive media, as a production coordinator... Running the production office for an emmy winning bravo reality show isn't exactly indicative of having good taste in film",
        "What exactly is the clever comeback here?",
        "The movie is fantastic but to say it’s one of the best of all time I personally think is an overstatement. I don’t even think it was the best movie this year.",
        "Cringe as fuck. This shits all subjective. Some will consider it masterfully written, others won't. No one cares you have a degree or an Emmy",
        "Not that clever",
        "It's not that great, tbh. I enjoyed it. But it's like a 5 or 6.",
        "An Emmy in not acting though",
        "I loved the movie a lot ^ ^",
        "Gee, it's almost like opinions on art and literature *aren't* quantifiable and objective!      \n\nSome of the most famous, appreciated, and expensive paintings in the world are judged by others to look like paint splashes that anyone can do.       \nTons of people find famous books and authors to be unreadable.     \nThere are people out there who think Michael Bay is a cinematic genius and others that aren't that into boobs, guns, and explosions.      \n\nThere is no wrong opinion when it comes to these kinds of things, only people who are unable to present those opinions or disagree respectfully and have the audacity to believe their impression is objectively correct.",
        "I thought Emmys were for TV"
    ],
    "Anon watches Oppenheimer": [
        "least fake greentext",
        "What Hiroshima scene",
        "Based, but fake and gay.",
        "1. Oppenheimer isn't released in SK yet\n\n2. There's no Hiroshima scene",
        "I really loved the part, where he said, \"It's OPPIE TIME!\" and started throwing neutrons at atoms.\n\nLiteral chills.",
        "Oppenheimer hasn't been released in South Korea yet.",
        "Anon anon? Telling retarded lies?",
        "Op op op Oppenheimer style",
        "We were so ready for the Big Gay to drop the Big A on Hiroshima but they just gave us the radio announcement. One of the bigger disappointments of the year. Good thing we watched Barbie after with Patriarchy Ken.",
        "Fake and enola gay",
        "Fake only Americans are retarded enough to cheer in a theater",
        "Ah yes, Oppenheimer. The Godzilla prequel.",
        "North Korea, meanwhile, shits pants.",
        "As they should",
        ">Japan bans Oppenheimer because they’re still salty\n\n>the rest of Asia “aye this movie is lit🔥”",
        "This has since been delisted by the YouTube algorithm, but I think  [this](https://youtu.be/gTBZSbAaLSk) has become relevant again...."
    ],
    "A rivalry destined by fate": [
        "\n##If you think this post is funny, **UPVOTE** this comment!\n\n\n##If you think this post is unfunny, **DOWNVOTE** this comment!\n\n---\n\n#[DownloadVideo Link](https://www.reddit.watch/r/shitposting/comments/13zkvjn/?utm_source=automod&utm_medium=shitposting)\n\n#[SaveVideo Link](https://rapidsave.com/info?url=/r/shitposting/comments/13zkvjn/)\n\n#[VideoTrim Link](https://reddloader.com/download-post/?url=https%3A%2F%2Fwww.reddit.com%2Fr%2Fshitposting%2Fcomments%2F13zkvjn&id=8968e43c)\n\n\n\n---\n\nWhilst you're here, /u/Gorotheninja, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?",
        "Doom Eternal vs Animal Crossing",
        "Japan during and after WW2",
        "already got my suit for the doublefeature",
        "its like the isabelle and doom slayer crossover bruh",
        "A rivalry fatestined by date",
        "It's all leading up to the point where they announce *Barbie vs Oppenheimer* is the next movie in a new cinematic universe.",
        "Not rivals, but lovers <3",
        "But it’s the same audience",
        "Now I am become Ken, the cummer in barbie",
        "They act like 2 legends cannot coexist",
        "barbenheimer",
        "I’m gonna watch both",
        "BARBIE SWEEP‼️",
        "the new doom eternal vs animal crossing new horizons",
        "Barbie will sell 1 Barbillion tickets!!! #barbiesweep"
    ],
    "Oppenheimer | Official Trailer": [
        "Cillian Murphy is such a great actor and it's nice to see him as the lead in such a huge movie.  This is definitely the biggest role of his career and I think he'll knock it out of the park.",
        "Fun fact. Cillian isn’t allowed to blink in this whole film.",
        "If anyone wants to get ahead of the game, the movie is based on a Pulitzer Prize-winning biography:\n\n* https://en.wikipedia.org/wiki/American_Prometheus\n* https://en.wikipedia.org/wiki/Oppenheimer_(film)\n\nSee also recent news on on the vacating of his clearance revocation:\n\n* https://thehill.com/policy/energy-environment/3778263-energy-dept-vacates-1950s-decision-revoking-security-clearance-for-father-of-the-atomic-bomb-j-robert-oppenheimer/\n* https://www.nytimes.com/2022/12/16/science/j-robert-oppenheimer-energy-department.html?partner=slack&smid=sl-share",
        "Great trailer. There’s a noticeable lack of other cast members in this. It’s a little refreshing, leave them for the theater.\n\nThough marketing-wise it seems pretty odd not to include the likes of RDJ, Gary Oldman, Matt Damon, Florence Pugh etc to attract a larger audience. Glad that the focus is on Cillian Murphy.",
        "Starring Christian Bale as the bomb.",
        "Great sense of vindication finally having a Nolan film centered around Cillian\n\nThere’s other A-listers or popular actors like Damon, Pugh, Blunt and RDJ in this movie but they’re basically not even present in this trailer in any way.",
        "Genuinely did not recognise Murphy's voice until they showed him speaking.\n\nAlso, Christ, does he do that haunted thousand-yard stare well.",
        "Good trailer, but nowhere near as good as the IMAX trailer that played in front of Avatar. That one had a much more intense and sinister vibe than this one.",
        "Releases same day as Barbie. It's over Nolanbros... We lost!",
        "There was a lot more color than I was expecting. Regardless, this is still one of my most anticipated films.",
        "Opens July 21st, 2023 - Same day as of ‘Barbie’.",
        "The IMAX trailer has a noticeably different tone, perhaps more in line it the second half of the trailer, though definitely much more horror. Interesting how the film can be marketed to different audiences and still entice. \n\nI am fairly sure that the IMAX trailer contains hints of Ludwig’s score, and I am too excited about that. The scale reminds me of Interstellar, if Interstellar were to take place entirely on Earth and at the subatomic level.",
        "It shows the tower stay cables vaporizing like in the iconic photo.\n\nhttps://www.reddit.com/r/pics/comments/2efv23/nuclear_bomb_less_than_a_millisecond_after/?sort=top",
        "I know people mostly talk about Michael Caine being a Nolan fave, but Cillian Murphy is definitely the other one. The fact that Cillian is finally the lead as well just makes it feel like the culmination all their work together. I love seeing a good director-actor partnership grow for such a long time. Cillian looks and sounds terrific here. I can't wait.\n\nAs much as I love Hans Zimmer, if Nolan has to replace him as his regular music man, Ludwig Göransson is *THE PERFECT* replacement. I ***ADORE*** the Tenet score.",
        "This doesn’t look like what I was necessarily expecting, but that trailer was fantastic",
        "What a great trailer"
    ],
    "Albert Einstein and J. Robert Oppenheimer in the 1930's.": [
        "Wow, a rare photo of Oppie without a cigarette.",
        "This is them writing the script for an upcoming film!",
        "Just a couple of math addicts looking for kicks",
        "Come on, man! No spoilers.",
        ">Herr Oppenheimer, I'm putting together ein team\n\n> Nah doc, I've left that life behind me\n\n> It's the Nazis, they are back\n\n>*Oppenheimer slowly turns around*\n\n>When do I start?\n\n>First we have to get you back in shape\n\n>*montage music starts*",
        "So you see when you develop the atomic bomb you have to play the “ Oh my god what have I done card” otherwise your going to get all the blame.",
        "December 1947 Life Magazine",
        "When I was in college in a geology class I read a paper written by Einstein about why rivers meander. His thoughts were not just about energy or making bombs. It was an interesting paper.",
        "A master learning from another master",
        "Oppenheimer wasn’t named director of the Institute until 47. We sure about the date on this pic?",
        "This feels like a wizard teaching a young pupil lol",
        "Apparently, Oppenheimer was a genius, but was not constitutionally situated to do the long and complex math required for a lot of the difficult theoretical physics. His talents laid more in administration and leadership.\n\nWhile it is often falsely stated that Einstein failed math or was bad at math, and while not being a \"pure mathematician\", he was actually extremely skilled at applied mathematics.",
        "\"Und you zee, vee divide both zides by the differential operator zat vee introduced on page  one.\"",
        "No way this was is in the 30’s. Oppenheimer wasn’t working with Einstein until his directorship at Princeton in the late 40’s. In fact Oppenheimer and his contemporaries scoffed at Einsteins rejection of Quantum Physics as early as the 1920s. Einstein also didn’t work on the Manhattan project, despite what is popularly believed.",
        "I'm really looking forward to the movie.  \n\nIt seems like there have been so few good movies to look forward to.",
        "Einstein is so Einstein.  I wish I was more Einstein."
    ],
    "They really thought they did something": [
        "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming)",
        "It's ok. Its not like Japanese planes have ever flown into our buildings.",
        "If you can’t joke about everything, you can’t joke about anything. I can always appreciate a good 911 meme. Anyone who gets pissy is just sensitive and needs to get some thicker skin",
        "Should have gone with school shooting memes",
        "Remind me of Arabs making caricature of French president because one random French journal made a caricature of their prophet \n\nI think I don’t need to explain how the French reacted",
        "I haven’t seen the Japanese 9/11 memes, where are they?",
        "9/11 jokes are plane wrong.",
        "3 idiots on twitter dont represent the entire nation of Japan",
        "Stop bullying kuro 😭",
        "I'm sure there is a boomer out there who would be really pissed at seeing 9/11 Barbie jokes. The thing is they don't use the internet",
        "Did they? I didn’t notice",
        "I swear to god I've never seen a Japanese meme ever.",
        "We lost two towers and they had the sun dropped on them twice lmao",
        "\"We challenged Americans to an enjoying violence off\"",
        "A second meme has struck the towers!",
        "Snowflake!!! Commit seppuku nowww!!!"
    ],
    "A rare picture of Oppenheimer working on the Manhattan Project, 1941": [
        "I have become IBS Man, destroyer of porcelain thrones.",
        "Hard to belive a plane could carry this guy all the way to Nagasaki.",
        "boogie2988 comin atcha live from the power of the internet",
        "Stinsonheimer inventing the stinson hangover fixer elixir",
        "No wonder they named the bomb Fat Man",
        "\"Now we're all fat sons of bitches\"",
        "That's not Openheimer, that's Louis Slotin, fucking around with the Demon Core.",
        "Average redditor",
        "Manfatten Project",
        "This picture deserves to be extremely rare, preferably nonexistent 😀",
        "Perfect to warsh down some tendies.",
        "Ted Cruz getting ready to party on sunny beaches.",
        "You're playing with powers beyond your understanding!",
        "So that’s the super soldier serum I’ve heard so much about it on the movies?",
        "America designing the world's first Thermo Nuclear Bomb (1941)",
        "Pro gamer move"
    ],
    "Barbie or Oppenheimer": [
        "I kinda haven’t seen anything about the new Indiana Jones movie, except on its subreddit.\nIs it so bad it didnt even deserve a place ?",
        "The flash looked like it was going to be a bad movie anyway.",
        "Mission impossible was an amazing movie! Can’t wait for part 2",
        "Yeah a movie with Ezra Miller should be left alone.",
        "Pikmin 4",
        "The mission impossible movie was great guys go watch it I wanna see part two",
        "What about that teenage kraken movie. I didn't even know about it until I saw a video on how badly it bombed",
        "Is saw MI7 last weekend, it’s really good! Definitely worth your time",
        "Ezra Miller goes by they/them because their arrest history won't fit in a singular folder anymore.",
        "The Batman- I mean, the Flash was DOA",
        "Fuck the flash movie.",
        "I watch MI7 when It just got release and watching oppenheimer tmr",
        "Mission impossible 7 was fantastic",
        "Mission Impossible ruled",
        "Deserved. Worst Barry Allen",
        "Good, drown The Flash. Fucking drown"
    ],
    "Sugar Ring by Meret Oppenheim": [
        "Do you want hand ants? Because this is how you get hand ants.",
        "Technically good taste, or rather, sweet taste.",
        "They could have at least gotten the stray hairs out of the picture.",
        "[deleted]",
        "Unironically wearing that thing like it's conventional jewelry would be bad taste. But this is pretty clearly supposed to be some sort of artistic statement.",
        "Forbidden Ring Pop",
        "Don't you fucking talk shit about Meret Oppenheim, She was a hugely influential surrealist artist.",
        "I love stuff like this. Sometimes an artist just wants to make something utterly ridiculous.",
        "the little hairs look super classy",
        "Is this related to consumption of absinthe?",
        "That’s so *sweet*",
        "The kinda of ring you would get from a sugar daddy!",
        "*after another brutal dad joke*\nI swear to god, Phil, this coffee could use another sugar",
        "The ring of the future, made by Tiger",
        "The sugar cube is dirty. Covered in lint. I am upset.",
        "not bad taste whatsoever"
    ],
    "Oppenheimer - New Trailer": [
        "This is the trailer that's been exclusive for theaters up until now, right?",
        "The atom bomb on Japan, that was real? I saw that movie, I thought it was bullshit!\n\n- Christopher Moltisanti",
        "Looks seriously dope. Love Cillian in this. So excited to see him lead in a Nolan movie.",
        "Is the person saying \"Until someone builds a bigger bomb\" at 2:27 supposed to be Edward Teller?",
        "Hol up, where tf is Michael Caine?",
        "The Oppenheimer Barbie double feature is about to hit so insanely hard",
        "Just imagine the people in the Barbie theater beside this one hearing the sound of atomic bomb going off…",
        "If this doesn't blow out my ear drums in IMAX I will be disappointed",
        "Looks good. Great cast, crisp visuals.\n\nYou can definitely tell that the trailer, while well edited, doesn't match the tone of the movie though. \n\nThey're definitely trying to market this movie as \"epic\" and \"high energy\" to get the modern theater going audience to see it. It'll probably be more of a slow drama like \"the Post\".",
        "THIS MF CILLIAN NEVER MISS",
        "Albert Einstein at 1:25? Never thought he’d in this movie, but make sense and Looks like Ludwig Göransson is gonna nail the soundtrack.",
        "[deleted]",
        ">Oppenheimer - Only In Theaters 7 21 23\n\n>Written and directed by Christopher Nolan, Oppenheimer is an IMAX®-shot epic thriller that thrusts audiences into the pulse-pounding paradox of the enigmatic man who must risk destroying the world in order to save it. \n \n>The film stars Cillian Murphy as J. Robert Oppenheimer and Emily Blunt as his wife, biologist and botanist Katherine “Kitty” Oppenheimer. Oscar® winner Matt Damon portrays General Leslie Groves Jr., director of the Manhattan Project, and Robert Downey, Jr. plays Lewis Strauss, a founding commissioner of the U.S. Atomic Energy Commission. \n \n>Academy Award® nominee Florence Pugh plays psychiatrist Jean Tatlock, Benny Safdie plays theoretical physicist Edward Teller, Michael Angarano plays Robert Serber and Josh Hartnett plays pioneering American nuclear scientist Ernest Lawrence.\n \n>Oppenheimer also stars Oscar® winner Rami Malek and reunites Nolan with eight-time Oscar® nominated actor, writer and filmmaker Kenneth Branagh. \n\n>The cast includes Dane DeHaan (Valerian and the City of a Thousand Planets), Dylan Arnold (Halloween franchise), David Krumholtz (The Ballad of Buster Scruggs), Alden Ehrenreich (Solo: A Star Wars Story) and Matthew Modine (The Dark Knight Rises). \n \n>The film is based on the Pulitzer Prize-winning book American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer by Kai Bird and the late Martin J. Sherwin. The film is produced by Emma Thomas, Atlas Entertainment’s Charles Roven and Christopher Nolan. \n\n>Oppenheimer is filmed in a combination of IMAX® 65mm and 65mm large-format film photography including, for the first time ever, sections in IMAX® black and white analogue photography. \n\n>Nolan’s films, including Tenet, Dunkirk, Interstellar, Inception and The Dark Knight trilogy, have earned more than $5 billion at the global box office and have been awarded 11 Oscars and 36 nominations, including two Best Picture nominations.",
        "I can’t believe Josh Peck was one of the first people I saw in this trailer",
        "I'm expecting for someone to mix this movie with Dark Knight Rises where Batman flies the bomb away.",
        "[deleted]"
    ],
    "Oppenheimer’s magnum opus was Teller’s spark plug": [
        "Fun fact, during the Cold War, US categorized “low yield” bomb as less than 20kt. \n\nMeaning both Hiroshima and Nagasaki were bombed by low yield nuclear weapons in this categorization.",
        "In the 80's there was a made-for-TV movie or miniseries about the development and use of the atomic bomb. Soon after Japan surrenders, Teller presents to the joint chiefs of staff about his idea for a more powerful weapon. High on their recent success and their monopoly on the greatest weapon in history, the joint chiefs don't take him seriously.\n\nThey say jokingly \"what, how much more powerful? Like *double Hiroshima?\"* as if such a thing was unimaginable. They proceed \"*Five times Hiroshima?\"* and begin laughing openly. In the laughter someone says \"TEN TIMES Hiroshima!\" and it's treated by the room like a punchline.\n\nTeller answers stone-faced: \"One thousand times Hiroshima.\" and the room goes silent.\n\nGreat moment. Now I kinda want to find it and rewatch.\n\n**EDIT:** Many thanks to u/Whynotapryo and u/SpacingIsMyGame who came up with The Race for the Bomb. Here's [the scene in question](https://youtu.be/RyJvSf8fqx0?t=2760s).\n\nIt's not 100% as I remembered it, but for something I saw once 36 years ago, I think I did alright. :)",
        "[deleted]",
        "Everyone forgets Ulam :(",
        "lol, good job with the signature",
        "Its always funny how people love the stonetoss line but will still milk the hell out of the comics",
        "I like that this meme points out that Stonetoss is, in fact, a Nazi.",
        "~ Obligatory \"Pebble-throw is a Nazi\" comment ~",
        "Isn't this comic from the Nazi guy?",
        "Teller: Go big or go home.",
        "Hiroshima is today’s “tactical” nukes",
        "Man was well on his way to trying to make, and test, a Neutron bomb and blowing a chunk out of the earth",
        "Why a stone toss though?",
        "\"Kilotons? More like 27.9 billlion Big Macs. This is America! Are you a commie spy or what lol\"",
        "Stonetoss is a piece of shit and [Comment removed by Reddit]",
        "Is this Stonetoss?\n\nEdit: it is. Fucking gross"
    ],
    "I'm gonna tell my kids that this is Oppenheimer (2023)": [
        "I love Oppenheimer's character development where he goes from thinking nuclear weapons are aladeen to realizing they are actually aladeen.",
        "Oppenheimer should have made the bombs pointy so they could stick in the ground before exploding",
        "you are HIV aladeen.",
        "My bomb killed le Jews?",
        "But the bomb wasn't pointy",
        "\"This will put a smile on the face of the enemy. They'll think it's a giant robot dildo\"",
        "“Are you saying that there's a chance that when we push that button, we destroy the world?”\n\n\n“The chances are near Aladeen”",
        "The torture scene gets me every time \"did you get the splash guard\"?",
        "God I love this movie",
        "My le aladeen... it... le aladeened people?",
        "Legendary method actor Jeffrey Characterwheaties.",
        "911 is the best!",
        "*tries to explain missile trajectories in a heavy wadiyyan accent and that it is totally possible to have your beak rotate around your head*",
        "Thats not aladeen.  Thats allison burgers",
        "Aladeen motherfucker",
        "Indulge me. For one second, pretend that I’m an idiot."
    ],
    "Great film, but...": [
        "There’s *tits????*",
        "Laugh in Germany\n\n(Openheimer here is Approved for 12)",
        "I saw em in IMAX with the full aspect ratio lol",
        "I'm still confused, is Oppenheimer R-rated because of explicit stuff or is it cause they feature the bombing in Japan?",
        "Just out of curiosity which country is this?",
        "Yeah this are the real Problems in the World!",
        " My country’s version didn’t even crop it out. They edited her wearing a black skin tight dress",
        "Just Google them",
        "How does *this fucking film*, out of all of them, benefit from any nudity anyway?",
        "How did they deal with Cillian Murphy’s…*everything else*?",
        "mom was there so i turned my face :(",
        "Saw it yesterday, as a woman, it just felt a bit out of place to show them fully. I liked that they are naked, style wise but her boobs didn't add anything important to the story and the Szene. \n\nI mean to everyone there own.. but it just felt like a way to entertain boob liking people or something, I don't know why else this was done",
        "Watched it uncropped with my father in IMAX. Those do be high quality boobs.",
        "They are meh. The movie really didnt need sex",
        "TIL her boobs are in the movie. Excuse me while I go purchase a ticket.",
        "Is their really nudity in a documentary about the making of the Atomic bomb?"
    ],
    "Christopher Nolan has announced that the cast of ‘OPPENHEIMER’ has left the premiere to ‘go and write their pickets’ and join the strike.": [
        "Welcome to  r/Fauxmoi (previously r/Deuxmoi) ! For further information on the sub's name-change, please click [here](https://www.reddit.com/r/Fauxmoi/comments/112mh62/deuxmoi_threatened_to_sue_us_lol/?utm_source=share&utm_medium=web2x&context=3). \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
        "https://i.redd.it/3tx6vkxc9sbb1.gif\n\nLet’s go! 👏",
        "Matt Damon is vociferously pro-union across several different industries so I’ll give him a pass for being allergic to serving",
        "Lets fucking go",
        "Okay Cillian, I see you with your sheer shirt.",
        "Cillian is such a unique looking person. Sometimes I’m not attracted to him at all, and then other times he’s like the sexiest man I’ve ever seen in my life. Like him as Tommy Shelby, oh boy…the voice/accent, the walk, the swag, the 1920s fashion, his intensity, the fact that he’s kind of an evil genius and also tough as nails…he makes me feel things hahaha 🥵\n\n![gif](giphy|l0HlL96SusHggSo6s|downsized)",
        "the color palette of this premiere is serving as much as Barbie. shoutout to all stylists - they _understood_ the assignment🤌",
        "There’s something about this photo alongside the caption that makes this shot Nolan-esque\n\nhttps://preview.redd.it/0mj5mior6sbb1.jpeg?width=824&format=pjpg&auto=webp&s=fa42acb8adaa53ae8da4aa941282650bba0f07a8",
        "Hot Strike Summer 🙌🏼",
        "So is the strike official now? I thought we would know this morning.\n\nEdit: Never mind. They're doing the press conference right now. I hope they make these studios bend.",
        "I feel like everyone usually dislikes Florence Pugh’s red carpet looks and I love them. Finally, one I don’t like and everyone else seems to love it",
        "Miss Flo picking up her aperol spritz and going for it. Love this.",
        "The vibes in this photo are sick as hell. And then you know, there’s Matt Damon,",
        "Ok but Cillian is hella serving",
        "FYI it’s not celebrity news but UPS is on the verge of a major strike that looks all but certain. So if/when all three happen at the same time it’s going to be a scorching hot strike summer and I cannot wait",
        "I know Cillian was happy to get tf outta there too 🤣"
    ],
    "‘Oppenheimer’ Extends Imax 70mm Run to August 31 Due to Popular Demand": [
        "Nice.\n\nSome of those full 1.43:1 shots are so gorgeous. I want a feature length film entriely like that.",
        "I'm not surprised, this movie is absolutely killing it in the IMAX 70mm near me. Completely sold out every showing since release, multiple weeks (though now only about 4-5 days) in advance.",
        "Such an exciting time for movies right now. The box office hasn't been this stacked with quality in ages.",
        "every showing (11am-11pm) where i live has been sold out days in advance since the day it premiered. i bought my ticket on august 2nd for the next available showing that wasn’t sold out. cant wait until august 11th to see it finally!",
        "Finally made it out to Harkins AZ Mills yesterday for a sold out 6:30 PM IMAX 70MM screening. Everything went smoothly. The film was already a 10 for me when I saw it the first time in regular 70MM, but it goes up to a 12/13 when the 1.43:1 ratio kicks in, esp. for the Trinity test, the nightmare sequence, and the ending. Definitely was worth the drive.",
        "I saw it in IMAX, and loved it, but I don't think it's particularly a movie that has to be seen in IMAX. It's really a movie about people, and those people are mostly indoors, and in meetings. It's not special effects driven at all, and even the explosion itself is rather understated, and is arguably not even the dramatic climax of the movie. The biggest benefit of seeing it in IMAX for me was zero previews or ads.",
        "When do Tickets become available. I've been trying to get some for a week",
        "I really wish they would do a Nolan re-run at IMAX 70mm for his older movies. Sad I missed out on so many to experience it the way Nolan intended.\n\nInterstellar is so visually stunning to me that I would've loved to sit at Lincoln Square for it.\n\nPlease re-run!",
        "Only 30 IMAX screens in the world 🤡",
        "Tom Cruise punching the air rn",
        "I was able to see this just last week at one of the few theatres in Southern Ontario that can support the 70mm IMAX film format. It was a remarkably immersive experience. I’ve experienced standard IMAX (or LieMAX) before but nothing compares to experiencing Oppenheimer in the format that Nolan intended.",
        "What do they do with the miles of film after the theatrical run finishes?",
        "Indiana State Museum, every single showing is *still* sold out.",
        "I'm still waiting to see if they even show this in Japan.",
        "I was just in New York for five days and tried to find a ticket to any screening of 70mm IMAX at all, and they were all sold out.",
        "I VEHEMENTLY disagree with anyone saying this was movie was too boring visually to be worth seeing in Imax 70mm. That’s just an insane take. This movie is breathtakingly beautiful and deserves to be presented in its ideal format. What did you want shown that wasn’t? The shots that people are calling “boring” are anything but when presented properly. I could watch 3 hours of Murphys face projected 70 some feet high on this gorgeous film stock. The black and white footage was all in government buildings and was more visually striking than any CGI driven banality I’ve seen in countless other recent movies. That’s the benefit of shooting in this huge, ridiculous format. A shot of someone’s face becomes a landscape full of emotion, a chance to really focus on what is happening with these characters when they’re shown this way. Having my eyes constantly bounce around the screen as it takes up almost all of my peripheral vision was an absolute treat and a delight. I can’t imagine seeing it on a smaller, wider screen."
    ],
    "It's not all bad news": [
        "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming)",
        "oppenheimer after he realizes his invention led to millions of people with crippling hentai addiction- 🙁",
        "It's worse than death of 200k people",
        "Maybe Oppenheimer was the hero after all",
        "Man fuck you Oppenheimer. You gave me crippling hentai addiction\n\nAlso, love ya for doing so.",
        "Redditors when pornography",
        "I am become hard, cummer of penis",
        "Oppenheimer after he realizes that his invention prevented a major war between world's superpowers, because of MAD",
        "_“B-B- but Japanese erotica had been a thing for centuries, The Dream Of The Fisherman’s Wife from the 1800s can be considered the world’s first tentacle hentai”_ 🤓🤓",
        "Reject Oppenheimei, Embrace Oppai",
        "If you use that logic the invention of sandwiches are also the reason for hentai",
        "Hell ya, look at the bright side U know",
        "I'm assuming because the radiation poisoning caused mosaic syndrome.",
        "I have become weeb, destroyer of porn",
        "Could somebody please explain this to me?",
        "Eh. It’s a slippery slope from “wanna come over to my place?” To “Oni-Chan did you put something in my drink?”"
    ],
    "Cursed_WalkingOut": [
        "The fact people are still talking about that video even after it's been around 4 years shows how much logan has fucked up",
        "Who’s Logan Paul again?\n\nOh yeah, he’s that guy who filmed the dead body in the woods\n\nAnd the guy who stole money from his fans and has yet to give it back",
        "Jake Paul has the attention span of a turnip.",
        "That's a lot of talking for a boy of his IQ",
        "God forbid something is not happening every 2 seconds and we actually have to analyze dialogue to get into the story.",
        "first of all, we need to stop making the opinion of all the dumb celebrities public and treat them like theirs matters more just because they are famous in an unrelated field.\nsecond, we need to stop treating logan paul as if he is a celebrity and start treating him like the criminal he is.",
        "Idk what he expected",
        "Why does anyone care what a dude with 2 grapes for braincells thinks.",
        "Ofc it’s Logan who walks out on something intellectual and full of expertly created dialogue, he’d rather watch Airplane Mode or smt",
        "Does he mean audiences were talking and he's annoyed?",
        "They should play for him subway surfer in the corner.",
        "I feel like these \"digital news\" are paid to kept Logan Paul existence floating around the internet",
        "He has an experience of dead Japanese people",
        "He is not known for being smart.",
        "Bro watched Oppenheimer and expecting Call of Duty 💀",
        "That is just another proof how simple-minded he really is."
    ],
    "Perfectionism": [
        "Aw hell no",
        "Big thanks to the Japanese government for letting Nolan commit to his vision of cinema 🙏",
        "I just want to see the \"Demon Core\" experiments scenes.",
        "Nolan: We won’t use CGI nuke\n\nProp master: Okay dude, get your guy at Libya to send me the stuff.",
        "For the record most of the explosion we associate with a nuclear bomb isn't specific to the nuclear bit. Nukes were designed to irradiate asc much area as possible as well as the immediate vaporisation zone. You can make a bomb with a mushroom cloud esque explosion without it being radioactive. You can't replicate the blinding light or vaporisation though as those are directly caused by the nuclear reaction",
        "I don't why but I get vision of Nolan building a miniature version of Tokyo and dropping a little nuke on it",
        "Nolan's commitment to keep CGI to a minimum is neat, but especially in Dunkirk, the petty number of extras sprinkled on the beach really toon away from what reality must've looked like.\n\nThose beach scenes would have benefited greatly from some CGI extras to fill the ranks",
        "Practical effects are awesome but I wish Nolan would focus a little less on the spectacle aspect of filmmaking  and focus more on the writing aspect.",
        "The bomb they used was prolly real but it was prolly not a nuke there are multiple bombs that cause big enough explosions to create a mushroom cloud",
        "ummm wtf, spoilers???",
        "[That part is a little dramatic](https://imgflip.com/i/7oj8tp)",
        "dude just wants to know the extent of what he can get away with",
        "A more extreme version of Rust?",
        "Film crew: Sir, tens of millions died, and millions will soon die from radiation poisoning \n\nFilm director: But we got the perfect shot",
        "Unrelated to the bomb, Cillian Murphy looks so good in this role",
        "The greatest threat to humanities existence? Not fascism, not climate change, not even the specter of nuclear war, but Christoper Nolan’s obsession with making movies…"
    ],
    "In Oppenheimer (2023) Oppenheimer looks miserable in every poster and Screen-cap he’s in. This is probably due to the fact he built fucking bombs that killed thousands of people": [
        "No he actually was a depressed chainsmoker outside of the building of those bombs. Apparently, many of his friends said he had self destructive tendencies. He suffered from periods of depression throughout his life, and once told his brother: \"I need physics more than friends.\"\n\nhttps://en.wikipedia.org/wiki/J.\\_Robert\\_Oppenheimer",
        "“Le bomb… killed le people?”",
        "“Mr. Oppenheimer, I regret to inform you that Project Japkiller Megadeath 3,000 has been used in a very…unexpected manner.”",
        "Oppenheimer when the bomb, he specifically designed to kill thousands of people, kills thousands of people",
        "> thousands of people\n\nHundreds too! At least 10.",
        "New sigma male image template just dropped",
        "Hasn't he ever played CoD? Killing people is badass",
        "Oppenheimer when the bomb he built exploded",
        "Every time I see that pic, I keep thinking of how much it reminds me of Peter Weller in Naked Lunch",
        "Mr. Oppenheimer, I’m afraid to inform you that your creation, “Japmelter 3000 Explosion Murder Ultrakill”, has been used in… an unexpected manner.",
        "That's a misconception, this is actually Cillian Murphy's happy face.",
        "Please no spoilers",
        "it's his emo phase, you don't understand him!!",
        "Man built the people killer building eraser 3000 and was shocked that it killed people and erased buildings",
        "How am I supposed to watch him wearing old timey clothes and smoking cigarettes and not see Tommy Shelby",
        "😨 \"bombs kill people?\" Oppenheimer shortly after finishing the life obliterator 9000."
    ],
    "TIL that Edward Teller, the physicist who advocated for Oppenheimer to lose his security clearance suggested using nukes to create artifical harbours, fracking oil and preventing hurricanes": [
        "He also named some H-bombs based on their delivery method, such as Airplane or Railroad.\n\nHe named one “Backyard” because it would be so explosive that it wouldn’t need any other delivery method as it would simply kill the world.",
        "Teller was a bit of a nutjob. He was, however, an undeniable genius in his field of nuclear physics. He is credited, along with [Stanislaw Ulam](https://en.wikipedia.org/wiki/Stanis%C5%82aw_Ulam) with designing the modern thermonuclear bomb. As far as I can tell, however, he is the real-life inspiration for [Dr. Strangelove](https://www.youtube.com/watch?v=jPU1AYTxwg4).",
        "It's weird that the nuking hurricanes idea came up again decades later.",
        "This guy seemed to be the living embodiment of \"if all you have is a hammer, everything looks like a nail\" but with nukes. He also suggested the USA to built a 10 gigaton hydrogen bomb, enough to end all life on earth as a deterrent to the Soviets.\n\nhttps://blog.nuclearsecrecy.com/2012/09/12/in-search-of-a-bigger-boom/",
        "\"hey, the enemy is attacking.\"\n\n\"just nuke em\"\n\n\"hey, i heard there's a disease in town.\"\n\n\"just nuke it\"\n\n\"hey, there's a cockroach in the cottage!\"\n\n\"nuke it.\"\n\n\"hey, you're in my way.\"\n\n\"just n-\"",
        "He wasn’t the only one who wanted to nuke the oil out of the ground \n\nhttps://en.m.wikipedia.org/wiki/Project_Oilsand#:~:text=Project%20Oilsand%2C%20also%20known%20as,detonation%20would%20boil%20the%20bitumen\n\nThe 50s must of been like the bacon crazy of the ‘10s but with nukes. Everything gets a little taste of nuke mixed in",
        "Not defending this guy but I expect he wasn't alone at the time. Nuclear weapons must have felt like discovering free energy. \n\nI mean you can build devices that produce *billions* of man-hours worth of energy from a relatively small amount of material. It could be a revolution for humanity, like the industrial Revolution. \n\nPerhaps he felt the radiation was a temporary issue which could be engineered out of the devices. Or perhaps he didn't care. Collateral damage.",
        "Fun fact: in 1966 the Soviets tried nuking a burning oil well to put out the fire, and it actually worked. The underground explosion sealed the opening and the oil fire stopped.",
        "Well if the harbour was in Alaska then perhaps nukes were the only feasible way of even completing the project.\n\nAlso considering he helped invent the H bomb he was basically being a salesman for the project he helped devise.\n\nKind of the opposite to Oppenheimer.",
        "I doubt that he was only one, there are only many ‘ideas’ people for whom the answer is more power and never ever thinking about problems with their solutions.",
        "USSR we need to put out a fire, a really problematic one.\n\nSo they nuked it.\n\nhttps://en.wikipedia.org/wiki/Urtabulak\\_gas\\_field",
        "I highly recommend that people interested in the history of nuclear physics read *Atomic Awakening* and *Atomic Adventures* by James Mahaffey. \n\nThere is a huge amount of crazy shit that Teller, et al wanted to do with nuclear bombs and nuclear reactors. \n\nTeller was actually the main architect behind the Star Wars SDI project. His idea was to use x-ray lasers to shoot down ballistic missiles. It's a great idea as x-ray lasers would be extremely powerful. But was a terrible idea because the only source of hard x-rays was exploding nuclear bombs.",
        "It's amazing how much the actor in the movie resembles the real deal",
        "Everyone acting like the genius who created H-bombs is stupid because they watched a 3 hour movie.",
        "No wonder Penn doesn't let him talk.",
        "The original Dr. Strangelove"
    ],
    "I didn't see any of these movies": [
        "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming)",
        "Oppenheimer $100M budget- grossed $550M globally\n\nBarbie $295M Budget(production/marketing)-\nGrossed $1 Barbillion(<—-Edit) globally\n\nSound of Freedom $14M budget- grossed $155M on only  a North American release(South American and European release this month)",
        "Me who went to mission impossible instead",
        "Oppenheimer was so freaking good, didn't catch the 3 hours go by, somehow wish it had been longer.",
        "Same, I haven’t seen any of those but I do want to see Oppenheimer some time",
        "I'm still confused sound of freedom sounds good, not in an entertaining but an important way. But I don't want to watch it because all the advertising is \"Hollywood dosent want you to see this\" and it mentions religion on every add I've seen, which has nothing to do with thr movie as far as I know. It's just getting annoying at this point",
        "Meanwhile, the drums of liberation.",
        "Sound of Freedom was good",
        "Asteroid city though ?",
        "I thought sound of freedom is a reference to one piece lol",
        "Sound of Freedom was really good, very moving",
        "I work in a movie theater and before Oppenheimer and barbie came out, sound of freedom was doing numbers and people really liked it. It was our #1 movie for a while.",
        "Jim Caviezal on Trump:\n\n“This is the new Moses,” Caviezel said. “I mean, I’m still Jesus, but he’s the new Moses. Pharaoh, let my children go free.”\n\nBased on that alone, I wouldn’t watch that movie if it were free + won Best Picture.",
        "It’s really weird to see people trying to hate on Sound of Freedom for its message while also trying to be on the moral high ground.",
        "I imagining Mission Impossible: Dead Reckoning Part 1 instead of Sound of Freedom.\n\nConsidering Sound of Freedom's tiny budget (compared with the three other movies), it has become a sleeper hit and has turned a profit.\n\nIs almost sure that, due to Mission Impossible's budget, it will NOT turn a profit.",
        "Everyone go watch Oppenheimer, Mission Impossible and Ninja Turtles. Haven’t seen the others but these ones are bangers"
    ],
    "Stinks, doesn't it ?": [
        "This, like any story worth telling, is all about a girl. That girl. Barbie. The woman I've loved since before I even liked girls.",
        "Oppenheimer: Hello my dear.",
        "It fits so well good joke",
        "This meme is *impeccable* \n\n\n\nYou RUINED that quote tho",
        "\"Now I become death, destroyer of Barbie\" - Oppenheimer",
        "Now all we need is to detonate an actual nuke and capture it on screen",
        "Barbie has had so many professions over the years, maybe nuclear physicist is one of them",
        "I like how the internet is turning Barbie x Oppenheimer into the new Animal Crossing x Doom just because they share the same release window",
        "This was unironically what happened when i saw Banshees of Innersheren and they were playing a bollywood movie in the adjacent theater",
        "Nolan: FINISH IT!!!",
        "Oh man I can't wait to watch both. Maybe I'll do a double header or something",
        "Barbie: \"You know, I'm something of a scientist myself.\"",
        "The what",
        "I have a feeling the Barbie movie is gonna be a lot louder than the Oppenheimer movie",
        "Is the explosion from Oppenheimer or Ryan Gosling being explosive? 🗿",
        "This is gold"
    ],
    "Gary Oldman, one of those actors who so effortlessly disappears into a role, making every performance of his different.": [
        "Jean-Baptiste Emanuel Zorg",
        "He was 3 of my favorite actors in the 90s before I realized they were the same person.",
        "I absolutely loved him in Leon.\n\n“I always like these calm little moments before the storm. It reminds me of Beethoven.”",
        "Don't forget that one movie where he plays a dwarf by walking around on his knees.",
        "The first role I saw him in...and my perpetual favorite...was in Rosencrantz and Guildenstern are Dead, where he played the titular Rosencrantz.\n\nOr was it Guildenstern?",
        "No mention of his role as Sirius Black in the Harry Potter movies.",
        "“Zero stones..Zero crates!”",
        "[removed]",
        "In which role is Gary Oldman awesome in?\n\nEVERYONE!!!!!",
        "Um, Sid Vicious?\n\nBut yes, great and well deserved post.",
        "Don’t forget Mason Verger in Hannibal.",
        "[https://youtu.be/CIaWo-BlBjs?t=51](https://youtu.be/CIaWo-BlBjs?t=51)\n\n&#x200B;\n\nAlso, I thought he was a solid Sirius Black",
        "Him and Denzel are my two favorite actors. Was amazing to see them together in The Book of Eli. Which subsequently is one of my favorite films",
        "I thought I was on /r/MoviesCircleJerk for a second",
        " In Kung-Fu Panda 2, his voice acting blends in so well that it took me years to realize it was him and not an actual professional VA.",
        "Sam Rockwell is basically Gary Oldman Jr."
    ],
    "OPPENHEIMER (2023) includes a 3 hours scene of Albert Einstein and Joe Oppenheimer kissing.": [
        "Rated M for ~~Manhattan~~ Manly Sex",
        "I was on the fence about this but now I'm definitely sold",
        "who's joe oppenheimer",
        "Gay bomb made Japan gay, damnit.",
        "Unfortunately, we know that relationship won't have a happy ending because Einstein prefers black holes.",
        "Can't wait to see Oppenheimer shove his fat man into Alber Einstein's Enola Gay.",
        "\"Are you uranium-235? Because I can't seem to split from you.\"",
        "kid named three hours",
        "I’ll probably tolerate films longer than 2 hours in theatres better if there is an intermission in between.",
        "Question: will there be anal sex between Oppenheimer and Einstein, or between Cillian Murphy and Matt Damon?\n\nI’d much rather just watch Cillian Murphy and Matt Damon ass ram each other for 3 hours out of character, but we the people just need to see some dong for once",
        ">That is just a little of the background to the meeting in the Oval Office back there in October 1945.  Truman had very little use for Oppenheimer then--little use for his \"hand wringing\", for his high moral acceptance of question in the use of the bomb, for his second-guessing the decision.  Cold must have descended in the meeting, as Truman later told David Lillenthal of Oppenheimer that he \"never wanted to see that son of a bitch in this office again\".  Truman would retell the story in different ways, but with generally the same result, waxing about how he dismissed the \"cry-baby scientist\".  \n\n[Source](https://longstreet.typepad.com/thesciencebookstore/2012/08/truman-and-the-cry-baby-scientist-oppenheimer-in-the-oval-office-october-1945.html#:~:text=It%20was%20then%20that%20Oppenheimer,hands%2C%20it%20was%20the%20president.)",
        "We live in a twilight world.",
        "Do you think we'll be able to hear anything?",
        "Who is Albert Einstein? Is he Oppenheimer's assistant or something?",
        "Oppen Gangnam Style",
        "I love how the trailer shows Albert Einstein like he is a cameo from a marvel movie. Honestly they should make WW2 Cinematic Universe, Hitler's origin story movie would go hard"
    ],
    "Oh you can’t do this to me…": [
        "Universal: \"You only get 1 take on this Nuclear Bomb\"\n\nNolan:  \"But the contract said 3000\"",
        "\"It's only a spike! It'll soon stabilize!\"",
        "For anyone wondering how Nolan hasn't killed us all yet, [it's actually surprisingly easy to make a mushroom cloud if you know what you're doing](https://www.popsci.com/mushroom-cloud-made-coffee-creamer/). The explosion pictured in the article might not look very nuclear, but with the budget of a Nolan film and some good camerawork, it'll probably look impressive in theatres.\n\nErrr- I mean- \"Coffee creamer? But the ad said nuclear!\" \"Well check it again. The ad said nuclear for a billion-dollar budget. You gave me 200 million, and for that I give you coffee creamer.\"",
        "Bingo. Me, your greatest creation",
        "Gotta respect going practical over CGI. No matter the cost.",
        "How come he didn’t get real wormholes or black holes for interstellar?",
        "I actually am looking forward to this movie! The history around making the bomb, the base, the facilities around the country, and trying to keep it all secret is amazing. There are a few books out there on this that are pretty great!",
        "\"The power of the Sun, in the palm of my hand!\"",
        "Rosie, I love this boy!",
        "If that’s true, I’m assuming it’s a microcosm of a real nuclear explosion?",
        "Is he gonna build a city for the movie too or what?",
        "He always go the extra mile and I am here for it💝",
        "Japan: \"Oh...\"",
        "The power of the sun, in the palm of Nolan's hand.",
        "Our new friend here thinks I'm going to blow up the movie set.",
        "This is how the stalker franchise started. I don’t wanna see bloodsuckers for real."
    ],
    "Harry S. Truman got very tilted when Oppenheimer complained to him about the guilt he feels": [
        "There’s actually a pretty big misconception on how the bomb was perceived before it was dropped and afterwards. For example, after tests, Oppenheimer and Leslie would stand at ground zero. They didn’t even understand the problems with radiation. Even when the bomb went out, Truman did not even think about it nor was he waiting for minute by minute update on the bomb. He okayed the plan, but the order was given by the person who was normally in charge of bombing raids in the Asian theatre. \n\nIn the aftermath of the bombs landing, there’s been a massive revision of who knew what when. There was a film that came out about the bombs, and in that film there’s a scene where Truman is seen contemplating deeply about dropping the nukes on Japan. This is fiction, there wasn’t much contemplating. There may have been a debate about which cities to drop the bomb on by a committee, which involved the team developing the nukes, but that’s about it. Once the decision was made, and Truman co-signed their decision like a million other decisions during the war. That’s about it, and it was treated like any other bombing raid.",
        "Thing is, Oppenheimer died without knowing whether or not nuclear weapons would cause a very literal, very real Apocalypse in the future. If you stop and think about it, thinking your actions might potentially doom all mankind is simply a horrible prospect.\n\nHell, we still don't know. We can only hope it isn't the case.",
        "To be fair, you can't give the order to drop something before that something is created.",
        "Using the logic of “someone had it harder than you” there would be only one person on earth allowed to complain about anything",
        "Probably controversial oppinion, but i dont think we should treat someones feelings as lesser in comparison to someone else, even if they went through more. Not all people can handle the same amount of mental strain. And i do think we should respect that he had guilt about it. I know its a meme, but still wanted to say that.",
        "I don’t really get this, Oppenheimer is still allowed to feel bad about something that he directly participated in happening",
        "Truman had 0 guilt about dropping it.",
        "The guy who dropped it",
        "Truman ordered two bombs to be dropped and though nuclear bombs individually have been the most destructive they were nearly not the most destructive bombing campaigns in WWII done by the Allies.\n\nOppenheimer changed the concept of war as we know it.",
        "But Truman \"only\" gave the order to use two nuclear weapons. Oppenheimer created them and died knowing that his creation could be the end of humanity",
        "Fun fact:\n\nOppenheimer tried to murder his tutor in college with poison.",
        "I would argue that oppenheimer have the right to feel worse though. Because he would be the reason of every nuke dropped while truman only was responsible for the ones during his presidency",
        "My le bomb... Le killed people?? 😲😲",
        "Actually Truman was very happy that he could order that.",
        "Doodoo take.",
        "I don't think Truman cared one bit to be honest. History would prove time and time again that he wasn't the nicest person to Labor unions, favored nepotism and  was seen as a angry and irritable man at the time."
    ],
    "Anything worth seeing other than Barbie and Oppenheimer?": [
        "Mission Impossible is pretty good but it's also part of a longer story with the last 2 or 3 movies",
        "Spiderman was great, even more so since I got to watch it in an almost empty theater",
        "Bro what the hell 💀💀💀💀 he put across the spider verse on the bottom 💀💀💀💀💀",
        "Mission Impossible 7 and Spider-Man are very good",
        "Oppenheimer did super well for an R rated 3h biopic. Many of the bottom movies haven’t come out yet, plus Spider-Man, Insidious, and Sound of Freedom did really well for themselves. Also, Elemental had a slow start but then caught on fire later and should be a hit once it hits VOD.",
        "is Oppenheimer rlly that good? i haven't seen it and everyone keep hyping it up",
        "Spiderverse was fucking amazing and makes the first one boring in comparison\n\nAlso if you're one of those people, it's on the top 15 highest rated movies on imdb",
        "Oppenheimer, while it is three hours the time flies by and it was mesmerizing! Do not recommend to sleep alone afterwards if you are very empathic.",
        "Across the Spider-Verse came into theatres almost 2 months before Barbenheimer. And the movie did better than expected it is till running and fucking amazing. Why is this post getting any likes?",
        "Spiderverse is good",
        "Barbie - haven’t seen\n\nOppenheimer- fantastic movie\n\nElemental - actually good movie not amazing \n\nSpider-man across the spiderverse - also fantastic lives up to the expectations of the first movie\n\nIndiana Jones - alright movie better than crystal skull imo\n\nMeg 2 - a bit happy a sequel is being made\n\nSound of Freedom - mediocre at best. Can’t take the line “I don’t know what it was but its annoying big and black.” Serious \n\nInsidious- never been a fan.",
        "OP sees anything animated and thinks \"THAT'S FOR BABIES. IM A BIG KID. I PLAY CALL OF DUTY AND WATCH SCARY MOVIES\"",
        "I feel like Indiana Jones gets a bad rap. I liked it a lot",
        "Mission impossible is amazing too",
        "BTW the Spiderman movie did extremely well. This is kind of shitmeme",
        "Elemental surpassed Encanto and people LOVED Encanto. Elemental was a good movie.\n\nIt dared talk about racism in a unique way too. Something that media hasn't done in ages due to getting too soft.\n\nSaw People complain there are non binary characters. Literally where? Literally who? There is no mention of non binary in the slightest."
    ],
    "oppenheimerule": [
        "Short clip at the end of the trailer:\n\n\"I am become death... destroyer of worlds.\"\n\n...\n\n\"That sounded better in my head 😅😣\"",
        "![gif](giphy|3oxHQk6QrBhANSBBo4)",
        "https://youtu.be/8VgSyKl9vg0",
        "I am actually quite excited for Oppenheimer",
        "Truly, we have hit a ceiling in terms of the bounds of human literary accomplishments",
        "Oppenheimer after his bomb specifically made to level cities levels cities",
        "20! oscars",
        "Reminds me of how The Kingsman [did a marvel tease for a certain Austrian painter](https://m.youtube.com/watch?v=2jNV39iFrWs)",
        "I willingly created the most destructive weapon in the history of humanity and now i feel bad about it AAAAAA I have become deatherino",
        "[Trailer (real)](https://m.youtube.com/watch?v=8VgSyKl9vg0)",
        "The death of cinema…",
        "I really fucking hate this, thx op",
        "Oh no I am become chuck sneeder of feed 🙊",
        "https://www.reddit.com/r/196/comments/12p8gi9/oppenheimer_rule/?utm_source=share&utm_medium=web2x&context=3\n\nBruh",
        "I hate it here",
        "After your raps I am become deaf"
    ],
    "Photo of J. Robert Oppenheimer celebrating after the first nuclear bomb test. The second photo is moments later after the realization of the destruction that his weapon might cause to humanity (1945).": [
        "\"No Truman! Dat was so not right!\"",
        "\"Enola, we know the bomb is bad please drive the plane\"",
        "NGL, you had me in the first half.",
        "Now I am become Death, the destroyer of tabels",
        "No Truman no no, that was so not right",
        "So hyped for the Mercedes-AMG PETRONAS F1 Team W15 Fission reactor engine",
        "Totoheimer",
        "Now I have become Toto. The destroyer of Headphones",
        "I thought I was in the wrong sub at first haha",
        "Bono, my Geiger counter is gone. The lead shielding is dead",
        "Hahahahaha. Excellent dank.",
        "Okay, I had to checked what sub I'm on and then spent a few moments wondering why Prof wearing Petronas shirt , and I concluded either I'm too sleepy or my reddit app is acting up. That's how good this meme is, OP.  Great job.",
        "No Harry no! that was so not right!",
        "“The bomb is bad, we know, please drop it.”",
        "Now I have become oversteer, destroyer of the rears.",
        "I literally thought this was an actual photo. Well done OP"
    ],
    "In 'Barbie,' 'Oppenheimer' smash success, audiences send message to Hollywood: Give us something new": [
        "I have no interest in watching transformers 17 -",
        "Something new.  Lets start a $750 million Barbie cinematic universe followed up by Oppenheimer 2",
        "So tired of live action remakes and sequels!!!",
        "That is not the takeaway Hollywood will get from this. Be prepared for a Cabbage patch Dolls live action movie and Oppenheimer 2: Oppenheimer takes Long Island.",
        "And the third Guardians of the Galaxy movie made $800 million. The frigging tenth Fast and the Furious made $700 million. \n\nPeople have no problem going to see sequels and superhero movies, they just want to go and see good and entertaining ones. Barbie and Oppenheimer were both good and entertaining, so people went to see them. They’ve made some garbage superhero and sequel movies lately, so people didn’t go and see those. \n\nWhat happened with these is the same with superhero movies. If the new Captain Marvel is good, people will go and see it just like they did the Guardians one. If the new Aquaman sucks ass, people will skip it just like they did the Flash one. \n\nThe lesson is to make good and entertaining movies which people want to see.",
        "I'm just glad that non superhero movies are making boxoffice news.",
        "Films need to be good to do good now.\n\nKraken girl, elemental and strange world were all originals and still flopped \n\nBuzz light year, the little mermaid, the flash were all reboots/sequels/spin-offs form stablished franchises and still failed.",
        "Fingers crossed between this and the WGA/SAG strike ending in favorable circumstances, new life, talent and opportunity will breathe into a stifled, stagnant industry.",
        "Hollywood's response: \"We hear you loud and clear. You want doll movies and nuclear physicist biopics, expect ten more of each two years from now.\"",
        "I am tired of 3rd act cgi big bad destroying the world, and I am also tired of every blockbuster featuring 5 chase scenes.",
        "Give us something new!... As long as it's from one of the most well known filmmakers in the world or about an internationally recognizable 75 year old toy brand.",
        " \"Here are two movies that are neither sequels nor reboots\"\n\nI get what the article is saying and I'm glad, but still – one movie is base on a popular toy, the other one is a biopic, they're not fully original screenplays. I hardly remember the last time I went to see a Hollywood movie that was based on completely original characters and stories.\n\nAlso, imho in the past few years this biopic Hollywood trend is getting a bit tired. (No shade intended on Oppenheimer in particular ofc, I can't wait to see it)",
        "First Super Mario Bros and now Barbie. I'd say the audience doesn't want something new. They want something fun and iconic from their childhood adapted to film.",
        "And A24 is proving that you can pay artists and workers well AND make successful movies.",
        "Give us something new ...like a 60+ year-old franchise ?\n\nLooking at Dungeons and Dragons too and wondering if studios are now compromising on novelty and an obvious boredom of sequels by making new movies but with an established IP?",
        "Ok sounds good! Barbie 2 it is!"
    ],
    "They thought we wouldn’t notice": [
        "What do you mean? They weren't being secretive. They sent out an email AND had a popup when you opened the app, telling you that the price was increasing",
        "How did they think we wouldn’t notice?  They sent an email saying they were increasing prices. It wasn’t as surprising as you think.",
        "As far as I'm aware, Spotify has (until now) been the same price for like 10 years in the UK",
        "Wait, that's real? I thought we were just joking about that?",
        "Really?",
        "If the money actually went to the musician’s I wouldn’t care",
        "How much do you pay in your country?, Here in Argentina we pay like 2usd now (1000 Argentine pesos + fee)",
        "Lots of people in here complaining about the $12 increase for the entire year, but also repeatedly paying more than that for just one DoorDash/UberEats platform fee for their pad thai delivery.\n\n(And yes, I’m in this bucket).",
        "Still my cheapest bill \n\nThe moment the landlord ups my rent is the moment I take a shit on his ugly ass rat dog",
        "Download songs",
        "I listen to enough music that Spotify makes a loss on my subscription so I still got no issue. I think it’s like 70,000 minutes for Spotify to break even. My 200,000 minutes should be fine for the next 10 years of inflation",
        "It’s the best money I spend every month. Sucks the price went up but I’ll still gladly pay it.",
        "Something wrong, ,I cn feel it",
        "Student payment plan users:",
        "wow, a business is doing business! who would've thought.\n\nsorry about your unquestionable right to stream music being obstructed by these greedy capitalists",
        "Really?"
    ],
    "[Fader] Giannis sat on the sideline with Oppenheimer. They watched Charlotte’s Nicolas Batum warm up.“You see Batum?” Oppenheimer said. “If you work really hard, you might be able to be a Nic Batum type of player.” “Coach,” Giannis said, “if I become Nic Batum, I’m going back to Greece.”": [
        "I was not expecting Batum getting roasted on a Wednesday morning",
        "Batum catching strays on a balmy Wednesday morning out of nowhere lmao",
        "Batum's mentions are blowing up on twitter. Can't imagine waking up to something so random",
        "I think all role players should aspire to be Nic Batum if it means absolutely fleecing a team for a fat bag",
        ">”Bro,” Brandon Knight told him, “you still don’t have any muscles. Relaaaaax.”\n\nAndItookthatpersonally.jpeg",
        ">Afterward, his teammates asked him, “What is that? Where’d you get that from?” They assumed he’d learned the scowl from YouTube—where he learned everything in those days.\n\n>Giannis laughed. “Oh,” Giannis said casually in a “this old thing?” kind of tone, “I took it from Westbrook.”\n\nshout out to westbrook",
        "Young Giannis was cocky lol, otherwise he won't be where he's today",
        "Dawg this was an incredible read and Mirin is an incredible person and amazing mentor. Also kidd comes off as huge asshole after this shit",
        "This was more interesting (although less funny) to me. I had no idea Jason Kidd was the reason Giannis developed his ball handling and point guard skills more.\n\n>Kidd was sure that there was something special about Giannis. It was the way Giannis saw plays ahead of plays. The way he could push the ball up the floor like a natural ball handler. And given that he had miraculously sprouted two inches, to 6-foot-11, since arriving in the NBA, Giannis, **Kidd felt, could morph into one of the most versatile players in the league.**\n\n>Still, that was a ways away. “We knew at the time that Giannis had the ability to handle the ball,” says Joe Prunty, Bucks assistant coach from 2014 to 2018, “but being able to handle the ball and being able to run the team are different things.”\n\n>**Kidd flirted with having Giannis at point guard beginning in 2014 summer league**, though Giannis’s official position was listed as center in two of four of the games. Kidd knew Giannis could play all positions; he could become a hybrid point forward, like Scottie Pippen was. **Privately, Kidd told his coaches that Giannis might never morph into a point guard, but he could turn into the next-generation big man**, because, truly, what five-man could guard him?",
        "Batum stray shot lol",
        "Bruh why did Nic Batum catch a stray lmaooo",
        "Lmao that's funny af",
        "Giannis' story is amazing. He saw a way to his current legacy when others wouldn't. All these stories are very cinematic, like the things unfolding the way they did was just supposed to happen. Giannis always had the hunger and work acumen, that shit is seriously inspiring.",
        "Batum waking up and expecting to have a nice day with his family only to get roasted for no reason lol",
        "Damn",
        "LMAO"
    ],
    "i mean seriously": [
        "I will also see Oppenheimer before Barbie in case anyone was curious",
        "No, this is important",
        "Ayy I got the barbie Corvette in forza",
        "Barbie superiority",
        "The point is that he has a movie coming out this month and they’ve had a minor dispute about how many theaters they can reserve for each of the blockbusters coming out this month.\n\nCruise has had his identity revolve around ‘the man who saved the movies’ when Top Gun sent people back to theaters so I guess this is a publicity thing to show he will not be petty and instead vigorously participate in the ‘magic of the movies.’",
        "[deleted]",
        "It's in the culture section, not the front page. That's what the culture section is about, movies, art, music, celebrities, etc. People really do be hating just to hate.",
        "I'm seeing Barbie before Oppenheimer but only because my fiance insists on seeing Oppenheimer in IMAX and the nearest theater is only doing 1 showing on Saturday",
        "I’m so tired of snobs who make fun of people who enjoy pop culture. This isn’t world news, this is celebrity news.",
        "Coward ain’t viewing back-to-back showings? For shame, Thomas.",
        "We're only _now_ realizing this is not normal? The media has been doing this as far back as I can remember.\n\n\"OMG guys, (insert celebrity here) was spotted at (insert location here) today! This is totally not an invasion of privacy.\"",
        "Fuck Scientology",
        "Two movies in theatre on one weekend? Must be nice to have so much money.",
        "it's just as bad to post it here.",
        "So you mean.. half of the entertainment journalism industry?..\n\nHow is the idea of this being news *news itself*?..\n\nThis isn't news. It's olds.",
        "You know what he's not going to do? Watch Barbie with his daughter Suri, because his church said he can't hang out with her."
    ],
    "He is Albert Einstein": [
        "Hello, /u/ItsYaBoyBananaBoi. Thank you for posting on r/antimeme!\n\n/u/ItsYaBoyBananaBoi, please make sure your post doesn't break any of our rules. If it does, please delete it before it gets removed.\n\nTo all other users,\n\nIf this post breaks any rules, please report it, or contact us via modmail so we can check it.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/antimeme) if you have any questions or concerns.*",
        "Oh my God its Albert Einstein",
        "Post-credits: “Albert Einstein will return.” 😎",
        "Einstein means \"one stone\"",
        "That character’s name? Albert Einstein",
        "[deleted]",
        "He's recruiting Oppenheimer for the nuclear initiative.",
        "Einstein has puppet jaw syndrome",
        "I'd like to start this talk off with a parable, a story if you will. I was at a college, a second-tier - not an Ivy League school - a second choice school and I was in a class, and there a student in that class. The teacher, he was spouting some horrible nonsense about how women’s rights were illegitimate, something that everybody knew was false. But if anybody had spoken up, he would have taken extreme joy in failing them, so nobody spoke up. One person raised his voice, one person started talking. The teacher couldn’t believe it, the classroom couldn’t believe it either. But in the end, he had logic on his side. And at the end of the day, he proved his point. And that student was Albert Einstein. And that same sense of childlike play and innocence that we know from Albert Einstein, I can sense in this room today.",
        "Albert Einstein is my favorite actor",
        "It's a damn shame they didn't cast Albert Brooks for that role.",
        "hi im Albert Einstein",
        "More like a r/Technicallythetruth meme",
        "Google Albert Einstein",
        "The Wernher von Braun post credits cameo is gonna be insane",
        "His name?.."
    ],
    "Oppenheimer real?": [
        "”I am become fun, the joybringer of world”",
        "Poopenheimer if he invented something fun like a nuclear powered dildo",
        "Oppenheimer actually thought he invented something fun when he invented fucking ur mom but ur mom is so fat and ugly that it was never fun",
        "\"Let it rip\" he spoke as he launched his Beyblade on Hiroshima. In an instant, flames engulfed the entire city. The cries of the innocent were the last thing he heard as he walked off into the horizon, on his way to his next target.",
        "Me if I had invented weapons of mass destruction",
        "I have become fun, enjoyer of worlds",
        "In Beyblade lore some of them are even more powerful than atomic bombs (not a joke)",
        "poopen slimer",
        "Did he know that bombs kkll ppl????????💣💣💣💀💀💀",
        "My le trampoline... Is le fun???",
        "oppenheimer if he was epic: i am become gaming the awesome of world",
        "He coulda invented the fusion reactor like in Spider-Man 2 Toby McGuire",
        "Why do you people keep spelling Barbenheimer wrong",
        "Oppen if he gangnam style",
        "Oppenheimer if he learned to stop worrying and love the bomb",
        "Oppenheimer if he played video games: “I am become gamer”"
    ],
    "Oppenheimer: I have blood on my hands. Truman: After removing a handkerchief from his pocket “Well, here, would you like to wipe your hands?”": [
        "The story about Truman being the person firing MacArthur for wanting to use 50 nukes in Korea is even better when you realize MacArthur was sacked for being nuke-happy by the only President to ever authorize the use of nuclear weapons in war. If MacArthur had a chance with anyone, it was him!",
        "As Oppenheimer watched in horror what he created, with a large mushroom cloud tearing the sky apart and making mankind one step closer to extinction, president Barbie came behind him, gently put her arm on his shoulder and said :\"Robert, the Bratz deserved it.\"",
        "Edward Teller meanwhile: **This really jingles my jangle!**",
        "I mean, for the average human in the 1940s, there really wasn’t ever a weapon detonated that was as strong as an atomic bomb. So, the idea of the atom bomb was obviously there but the scale of it was practically impossible to know. I understand where Oppenheimer got his guilt from. A weapon that scale being tested and brought into development for our nuclear arsenals and your the project leader of the first nuke, yeah, I would kinda be scarred for life and paranoid when a nuclear close call happens.",
        "I remember LPOTL doing their Manhattan project series and they read that a scientist said that Oppenheimer after the Trinity test was walking around the lab with a swagger strut or something man didn’t care until after he just was happy he got it done",
        "Mikhail Kalashnikov suffered the same guilt when he saw what his wepon was doing around the world nobody knew how powerful nuke would turn out and when they realized that this wepon had potential to wipe out humanity once the bombs were invented it was just a matter of time that other countries will have their own and eventually everyone will have it and it will only take a madman with God complex to end humanity for good l. Truman may have wiped out 2 cities but Oppenheimer may be the doom of humanity one day and that is a fact hard to swallow. People feel guilty when they accidentally step on their dogs paw and our boy here just invented genocidenator 9000 give him some slack",
        "Bruh they actually included that moment in the film that just came out and I was laughing my ass off the whole time",
        "Accidentally killing someone is already traumatizing for an average person. Founding out a weapon you made instantly evaporated tens of thousands of people would be soul crushing for someone who isn't a military man.",
        "Virgin Nuclear Weapons Scientists: I have created a better version of a weapon that is highly dangerous and easy to use. What have I done?\n\nChad Chemical Weapons Scientists: I have created a new type of weapon completely unheard which is incredibly painful to die to, that requires lots of practice to use. I will now go defend this weapon until I die",
        "r/historymemes out here acting like killing/being responsible for death doesn’t traumatize you and remorse doesn’t exist\n\nIf you kill people and you don’t have a shocked/traumatic reaction, you’re a psycho. Even if it was for the “greater good” killing someone isn’t something that many can simply wipe away. Look at WW2 allied veterans. Undoubtably doing the “right thing” but most aren’t not gonna brag about killing people, most aren’t even gonna want to talk about it\n\nHell, I know people who still beat themselves up over the death of someone even though they didn’t really have any way to stop it. Just the simple concept of “if they stayed a few minutes longer they wouldn’t have had that crash”, fucks them up mentally.",
        "Imagine how much blood Oppenheimer would have had on his hands if Operation Downfall had happened instead\n\nhttps://en.m.wikipedia.org/wiki/Operation_Downfall\n\nThe man was living the trolley car problem",
        "Give a gun to a kid, he fires twice, he feels a grown up, he even calls you a pussy.  \nStill, you're the one that gave him the gun, you are responsible, without you he would still be just a child stomping his feet around.",
        "Can you imagine though!?! Basically being responsible for creating a weapon that could potentially wipe out all life on earth!",
        "Wow. That's like, the bazillionth time I see this boring \"chad Vs soyboy\" pseudo meme.",
        "To be fair with oppenheimer. He created something than can potentially end humanity if this thing was held in the wrong hands which unironically it did (Vladimir putin, north korea, iran)\n\n\n\nIts not really about the two cities anymore but about our future, rn we're sitting near midnight.",
        "I need to find a book a solid and in-depth biography of Truman. He strikes me as fascinating."
    ],
    "Barbie or Oppenheimer: What was more searched in Google in Europe in the last 24 hours (July 20-21)?": [
        "In Italy Oppenheimer doesn't come out until next month so it should be taken into account.",
        "The Oppenheimer belt",
        "Next world war factions.",
        "B in Balkan stands for Barbie",
        "Russia Projecting the repressed love.",
        "Oppenheimer won’t be available in Greece until the end of August. Barbie is the default option since it’s the only one available between the two…",
        "I'm seeing posts about these movies everywhere since a couple of days. Is this some sort ot crazy marketing campaign?",
        "And this how WWlll began..",
        "[deleted]",
        "Glad to live in an Oppenheimer country. Saw the movie yesterday and it was amazing.",
        "Oppenheimer was really good imo definitely worth a watch",
        "Reddit is eating up this marketing campaign",
        "In Greece Oppenheimer comes out 24 August.",
        "Makes sense to me. Good as Oppenheimer is, literally everyone has some sort of barbie related childhood memory.\n\nThat is very hard to beat.",
        "Scandinavia hanging dong there.",
        "Barbie is not just a movie, but also one of the biggest toy line ever made, so not surprising here..."
    ],
    "absolute madman": [
        "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[join our discord server and play minecraft (and other games) with us!](https://discord.gg/dankmemesgaming)",
        "I am become death, the destroyer of movies",
        "There has never been a better use of Elmo and nukes",
        "I watched Top Gun: Maverick in IMAX in the first row and I can honestly recommend the experience. It's still stuck in my memory how a life-size Darkstar takes off directly in front of me and literally makes my seat shake with its sound.\n\nThe image does get slightly warped by perspective and on-screen text becomes a neck workout, though.",
        "I have become deaf.",
        "That has to be Nolan himself!",
        "This made me laugh way more than it should have",
        "How much you wanna bet he thought it was a seat in the back",
        "Peter, please explain",
        "The seat could be broken and therefor not available",
        "I'm with that guy, that's my favorite seat in the theater. I like technically being the first to see it.",
        "That mad lad’s name?\n\nHarry Truman.",
        "This is me watching Godzilla, both at a theater and at home.",
        "This is the perfect use case for this template.",
        "That's Nolan himself",
        "My man gonna see the pixel's atoms and its fision"
    ],
    "TIFU by accidentally liking an Instagram photo and now my life is probably over": [
        "My friend's dad is your age and he literally just posts filtered pictures that border on gen Z shitposts (think the \"B\" meme but of himself or his office), follows 12 people, and likes everything on his feed. \n\nHis daughter has a close friend who just uses Insta for thirst pics and when Dad initially downloaded Insta this friend was over and followed him.\n\nSo he followed her back. \n\nSo his daughter would hop on Instagram and just see her Dad posting these esoteric shitposts and liking every single thirst pic her friend posted. \n\nThe man genuinely saw 0 wrong with any of this and was operating in 100% good faith. \n\nIt's one of the funniest things we've ever laughed about.",
        "Don't stress. I'm sure Sally's dad had liked a bunch of your daughters bikini pics.",
        "Chances are she didn't see the notification. Instagram says the notification will disappear after you unlike a post.",
        "When she visits you can say something like \"I like your eyes, they are the same color as your bikini at Miami 2020 vacations\"",
        "Now just like an old lady to cancel it out.",
        "Thirst world problems",
        "Send out links and messages from your account saying stuff like \"Hi buy really cheap bitcoin at this address!!! Insert link\" then say you got hacked. Ez",
        "blocking her immediately after liking/unliking a picture should remove your name from notifications? 🤔",
        "Twist, Sally has notifications turned off but does see Reddit tifu post with information that lets her know friends dad has been creeping on her Instagram.",
        "Marry her to really soften the blow",
        "If anyone calls you out, just say you didn't like *her*, you just like her tits.",
        "Did dad also accidentally sub to Sally's OnlyFans?\n\nAsking for a friend...",
        "I feel your pain!\n\nI'm 52 and my eyesight isn't good so I normally enlarge pictures to see them better by double tapping.  My teenage daughter had gone way way back on some boy's Instagram to show me who she was talking about (that she didn't like) and when she handed me her phone to see,  I instinctively double tapped. SHE FREAKED and began screaming at me that he was going to get notified and she would be busted that she had gone that far back in his IG history and her life was over. \n\nHard lesson learned.  I am no longer allowed to touch her phone to this day 🤣🤣🤣🤣",
        "As someone who has a social media account with 10k followers, most of these services stop showing \"like\" notifications when you start getting enough likes. If you made a comment, that would be different. \n\nI am 99.99% sure you have nothing to worry about. \n\nImagine if your phone buzzed every time a person \"liked\" a viral post. One video of mine has 1.5 million views and thousands of likes and comments. As a content creator I'd go insane.",
        "This is why you don’t browse Instagram with your dick in your hand\n\n\nSeriously though, my condolences OP",
        "OP: No, I'm not into girls my daughters age. I'm not some perv.\n\nAlso OP: Anyways, I start pervin'"
    ],
    "Did you know, if you go to the cinema at around 22nd of July, and watch Asteroid city(2023), Oppenheimer(2023), and Barbie(2023), you can watch all the Hollywood actors in a single day. Yup, not even exaggerating. Literally all of them are in these 3 movies.": [
        "It’s jawdropping that they had to film all those movies on one location",
        "No Kevin Bacon?",
        "Even Jared Leto?",
        "the pic is actually in canonical chronological order",
        "If mcluvin isn’t there, I don’t want it",
        "I don’t think I’ll watch these movies, but you know what? I believe you.",
        "Asteroid City doing all the heavily lifting there…\n\nThat cast is **stacked**",
        "Wtf how am I just now learning about Asteroid City",
        "And you're just going to Oppenheimer for Cillian Murphy.",
        "The juxtaposition on the bottom makes “Basteroid city” I dunno what it means but it’s fun to say.",
        "They're gonna have to drop a movie about a Boston cop so Mark Wahlberg doesn't feel left out",
        "Ryan Gosling looks tortured in the barbie poster",
        "Studios: we really need to get people back in the theatres!\n\nAlso studios: let's release Oppenheimer and Barbie - two movies that will likely have massive audience crossover - at the same time so that we all cannibalize each others' box office haul.",
        "Danny Devito?",
        "-What do you mean every actor in Hollyw...\n\n-EVERYOOOOONE!!!",
        "Is Asteroid City being released on the same day? Three movies in one day if so."
    ],
    "Cillian Murphy ‘Was Desperate’ to Be Christopher Nolan’s Lead in ‘Oppenheimer’ After Five Movies as a Supporting Actor: ‘It’s a Huge Responsibility’": [
        "Cillian Murphy is one of the most underrated actors out there. Super talented, always wanted him to be a Bond Villain.",
        "[deleted]",
        "He was so good in Sunshine",
        "Murphy was outstanding in Peaky Blinders.",
        "He definitely deserves it. Really looking forward to this film.",
        "All yall praising him, don't forget he was top notch in 28 Days Later too!",
        ">\t“I have always said publicly and privately, to Chris, that if I’m available and you want me to be in a movie, I’m there. I don’t really care about the size of the part,” Murphy said. “But deep down, secretly, I was desperate to play a lead for him.”\n\nAfter loving him as Thomas Shleby in Peaky Blinders, i wanted him to lead a big budget movie. And I’m glad it’s a Nolan movie. He deserves more success, happy for him.",
        "Working with Nolan has been great for him, I'm glad he got a lead.",
        "I have a huge amount of respect for Cillian Murphy. If I'm not mistaken, he purposefully stays out of the lime light so that he can have something that resembles a normal life.",
        "I'm really looking forward to this film. I admire CM and I'm curious about the story.  Oppenheimer quietly lived down the street from our family in the Berkeley hills.",
        "If You’re a fan of cillian Murphy yous should watch intermission. Small little Irish film he’s in absolute gem of a movie.",
        "He was great in Red Eye",
        "Desperate seems too strong a word for Murphy, he’s long since earned a spot as a leading man and it’s nice to see him finally headlining something of this magnitude.",
        "He deserves it so much. It's about time!",
        "Loved him since The Wind that Shakes the Barley",
        "He’s never been anything less than brilliant in everything I’ve seen him in"
    ],
    "Is Galen Erso technically the Oppenheimer of the Star Wars universe": [
        "Mads has talked about him being an inspiration for Galen, yes.\n\nThere are a few other nuke references in the movie and the title of an earlier version of the project was Destroyer of Worlds.",
        "Now I am become Death Star, the destroyer of worlds.",
        "Ok but then who is the Star Wars universe's Barbie?",
        "I'm gonna copy-paste my answer from [the last time](https://www.reddit.com/r/StarWars/comments/15690vf/is_galen_ersos_arc_in_rouge_one_a_simplistic_and/jsyg5va/?context=3) this was asked.\n\n[Mads Mikkelsen thinks so:](https://gizmodo.com/mads-mikkelsen-cant-complain-about-his-super-iconic-dea-1793613666)\n\n>**What is it like to have a big death scene in Star Wars?**  \n>  \n>Mikkelsen: It's fantastic. If you can't survive and be in the next film, the second best to that is to have a wonderful death scene, of course. And I've had quite a few of those in my life as an actor, but there's a good reason for that. It's drama.  \n>  \n>But that's iconic. It's super-iconic to die in a Star Wars film. And it's obviously super-iconic to be the man who invented the Death Star. So I can't complain.  \n>  \n>**Not just the Death Star, but the mechanism in it that led to the Rebels destroying it. What was it like when you found that out?**  \n>  \n>Mikkelsen: I knew that from the beginning. Galen is both, he is our Oppenheimer. The scientist who can't stop himself. He's too curious to stop, while at the same time he knows this is going the wrong way. There's a certain amount of him that's too curious that he simply puts a world's life on a knife's edge. I think that's interesting because we've seen that throughout history before, with Oppenheimer, with people who invent fantastic things that can be used as lethal weapons as well.",
        "Oppenheimer: \"Now I am become death, **Destroyer of worlds**...\"\n\nErso: \"Oh, I'll show you what's what....\"",
        "I think Galen Erso is more like Werner Heisenberg.\n\nMuch like Oppenheimer, Heisenberg was the head of a nuclear program but for the Nazis. There's are many parallels to the Empire and the Nazis. Thankfully, the nazi party failed. Be it bad physics or an internal saboteur, the Nazis nuclear program failed. Many people have speculated that Heisenberg intentionally sabotaged the program which lead to it's failure and paint him as as more of a hero and less... You know... A nazi.\n\nWith that in mind, I feel like Galen Erso was perhaps inspired by Heisenberg. Galen allowed a flaw into the design of the Death Star so that the good guys could win.\n\nI don't know, maybe I'm just tired.\n\nEdit: I was tired. Not tied.",
        "Not sure, Oppenheimer didn't deliberately put a design flaw in the bomb like Erso did in the Death Star.  But the comparison I think is still appropriate, both created super weapons that can destroy a planet.",
        "He's just Oppenheimer of the era.    They got thousands of those buggers I. Star wars",
        "“Is X the Oppenheimer of this universe” is that a new meme",
        "I’d say he’s closer to Heisenberg, but neither of them really match if you look close enough.",
        "Technically, Star Wars happened a long time ago in a galaxy far away, so Oppenheimer would be this galaxy's Erso.",
        "The fictional movie Oppenheimer was based off the real-life events of engineer, father, genius, Galen Erso.",
        "No. Planet killing superweapons have existed for millennia.",
        "No Bevel Lemelisk is",
        "Well no, Oppenheimer knew what he was doing from the get go and didn’t try to sabotage his work",
        "Nah, the plans were already made by the geonosians. He was just one of the scientists who assisted in puffing up the schematicsto be ready for imperial use, but eventually rebelled and added the means to it's destruction."
    ],
    "My girlfriend doesn't let me watch movies with sex scenes": [
        "My fiancés ex girlfriend was the same with him. It got to the point where he was looking at his shoes 100% of the time they were out, he secretly rented movies on dvd to watch and would return them before she got home (sex scene insecurities) and he couldn’t shower alone “in case he thought of another woman”.\n\nWhen we got together he was so scared of offending me if he was complimentary to another woman for whatever reason. If I said “oh, I really love that woman’s outfit” he was scared that it was a trap at first, because in his previous relationship he would reply that yeah it was a great look and then eat a shit sandwich for it. \n\nYour girlfriend needs to grow as a person before she can grow in a relationship. Accommodating her insecurities and control issues might seem like the right thing to do but you’ll never get off the downward spiral until you’re out of the relationship with her. She needs help.",
        "I also remember being 14",
        "Omg.  Vampire diaries doesn’t even have sex scenes. The most I’ve seen is kissing and maybe someone takes their shirt off then they cut the scene. I mean is she forrrreallll?! sorry, I’m going off topic but yeah shes mental, dump her.",
        "🚩🚩🚩🚩🚩🚩🚩🚩🚩",
        "Your girlfriend has a neurotic level of insecurity and will become more and more controlling. Little chance of this situation ever improving.",
        "Imagine a big beautiful bouquet of flowers, red flowers. Nice right? Now replace said flowers with red flags.\n\nThat’s what you are dealing with.",
        "I had a girlfriend like this. Run. Run far away if you cannot talk this out like reasonable adults. It got so bad, I'd be \"getting in trouble\" over video game women. Like not even sex scenes, just the person on the other team picked a skin that was \"too slutty\".\n\nEverything that gave me joy would have me feeling like I'm walking on eggshells. What if an attractive woman shows up during this movie? Is this law and order a murder one or a rape one because if she's not dead, I'm going to be.\n\nI couldn't even watch my Old School with Will Ferrell. It was my favorite movie, I bought that shit on Blu ray as a combo pack with anchorman and taledega nights.  It has a scene where two women take their tops off to wrestle an old man.\n\n Do you remember the titties in that film? I didn't but I sure remember getting smacked upside the face out of nowhere.",
        "\"When you're wearing rose colored glasses, all the red flags just look like flags\"",
        "Speaking as someone who was like this when I was a kid, it honestly sounds like she has some self esteem and trust issues; something along the lines of her not wanting you to look at other women because she doesn't want to risk you losing interest in her over someone who might look/be better than her, and not trusting you enough to know you won't just blindly dump her for something better. Talk to her about it, let her know you're not just gonna ditch her at the sight of someone else.\n\nBarring all that though, don't give more than you have to to someone who won't give as much back in return. Be supportive, but do what's best for you",
        "I couldn't read anymore after I heard my girlfriend        \" doesn't let me \"....",
        "She’s nuts. That is some major red flags.",
        ">Is it warning bells? \n\nNo. This is the equivalent of that warning siren that you hear when a tornado or a nuclear attack is approaching.",
        "The hidden message that she probably wouldn't even admit here is either, \"I don't trust you to not be emotionally and sexually exclusive with me.\"\n\nOr, \"I don't want you admiring the beauty other people have, because I either envy their beauty or am insecure about my own beauty.\"\n\nNow these two messages aren't mutually exclusive either, and they can even derive from one another. \n\nWhatever the case might be, sit down with your girlfriend and have a heart to heart discussion about her feelings towards you, herself, and other people. \n\nCommunication is the key here, that is if you actually want to stay and try to work things out. I know alot of people are saying to break up with her, but I get the feeling their spouse would use the wrong kind of milk in their Mac and cheese and they'd break up over it. You'd be surprised how often conflicts and speedbumps can be smoothed out by honesty, trust, and communication.",
        "Study to become an OB/GYN to make her head explode, then get a more well-adjusted partner.",
        "It’s warning bells for sure, I’d flip the script and tell her I don’t want her watching sex scenes either just to see what her mindset is.",
        "Yes, that is abnormal. \n\nShe has some deep seated insecurities.    \n\nTherapy would probably help, but brining it up to her would cause an issue most likely.   \n\nIt's normal for partners to watch sex scenes together and often spurs an evening of in person sex scenes.\n\nBut *disallowing* your partner from  watching sex in a mainstream movie  is controlling, insecure, and wrong."
    ],
    "Oppenheimer to feature ‘prolonged full nudity’ by Florence Pugh and Cillian Murphy": [
        "Your move Barbie",
        "Can't believe [The Onion](https://www.theonion.com/oppenheimer-given-surprise-r-rating-for-title-charact-1850501249) called it...",
        "I HEAR CILLIAN MURPHY HANGS DONG!",
        "[removed]",
        "This isn't necessary. I was already going.",
        "That's probably why Nolan came out and said there was no CGI shots in the movie. So we, the audience, know that Murphy's Dong is 100% natural.",
        "Will it be Fat Man or Little Boy?",
        "Is this the movie industry’s attempt to get people back into theaters? The promise of full frontal nudity?",
        "Oh yes!! Nudes and nuclear weapons, what a combo!!",
        "Didn’t he show his dick in the beginning of 28 days later? Haven’t seen that movie in a while though could be wrong",
        "I think Florence Pugh stipulates in her contracts that the film must allow her to be nude for a minimum of 15 seconds.",
        "Now we understand why Nolan felt the need to shoot it in IMAX.",
        "![gif](giphy|m2YdDabHoa3PLmhLwj)\n\n🤘",
        "Stupid sexy Oppenheimer…",
        "Like Dr Manhattan hang dong or Ben Affleck in Gona Girl.",
        "Prescreen audience: “Are you sure all this full nudity is necessary to help convey the terror and seriousness of the first atomic bomb?”\n\nOppenheimer execs: “Atomic bomb?”"
    ],
    "in honour of Oppenheimer and all the WW2 bombardiers": [
        "\n#Thank you for your contribution, Defense Expert™. \n\nDid you know? You can also find us on [Lemmy](https://lemmy.world/c/noncredibledefense)!\n\nBut while you're still here, how about you participate in our [Coin wasting contest?](https://www.reddit.com/r/NonCredibleDefense/comments/1517hjn/coin_wasting_contest_2023/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NonCredibleDefense) if you have any questions or concerns.*",
        "ww2 bombardiering like: \n\n\\> day 1: 1000 bombers dropped a bazillion tons of TNT. 0 hits.\n\n\\> day 2: 1000 bombers repeat the journey. 0 hits.\n\n\\> day 3: 1000 bombers raid again. 1 bomb hits but fails to detonate.\n\n\\> repeat for a month",
        "Russians try not to bomb kindergardens challenge (impossible)",
        "Carpet bombs? My goodness, what an idea. Why didn't I think of that? Carpet bombs! There's four places. There's the Carpet Bombs Away, that's on third. There's Carpet-Bombs-R-Us, that's on third too. You got Put-Your-Bomb-There. That's on third. Dive Low, Sweet Chariot... Matter of fact, they're all in the same complex; it's the Carpet Bomb Military Industrial complex on third.",
        "Everyone knows that military infrastructure is always entirely separate from civilian infrastructure. In no possible way could these things overlap.\n\nMilitary always has it's own special roads, trains, ports, factories, storage, bases, and amenities to serve those bases, as far away from anything related to civilians as possible. It's why the most militarized places in the world are places like the very top of Mount Everest, the bottom of the Grand Canyon, and on the moon.\n\ntldr we should bomb the moon.",
        "Y’all should watch the documentary biography/movie, “Fog of War”.  Bob McNamara was the Secy. Of Defense during Vietnam, but more to the topic here, he was on the Army Air Force Gen. Curtis LeMay’s senior staff. Curtis LeMay is QUITE a piece of work. Ever see George C. Scott and Peter Sellers in Dr. Strangelove? George C. Scott’s character is based on LeMay. Complete psychopath, but …in the military, is that “strange”?\n\nHe explains why they “fire bombed” Japan and their cities. It’s not a “nice” answer, but it’s “an” answer. Just FYI, it’s not like they “didn’t” bomb military sites. The issue was, and still is a problem for Japan, that there are very little open spaces or “new” land to develop in Japan for new military sites. Have you visited Nellis AFB?  The only reason Vegas exists is because it was built “after” Nellis. Most US sites were built in WWII were made in wide open spaces. So…Since, they knew there would be collateral damage, no matter how hard they would try to avoid population centers near military targets, the US AAF would still kill civilians. So…, they adopted fire bombing. \n\nCan it be argued as war crimes? You bet, especially with today’s lenses. The A-Bomb however, kind of made the argument a side show compared to the shock of an atomic bomb being used (on pop. centers as well). In total, the firebombing killed ~350,000 over a much longer course of time, whereas the two atom bombs killed ~250-300,000, but in only two separate days. Likely, the predictions said by ending the war with the atomic bombs, the US military likely saved 400,000 (a low estimate by some, but we’ll never know). \n\nThese are just numbers. I’m not arguing the morale argument of killing hundreds of thousands of your enemy’s humans, to save hundreds of thousands of your own military’s lives. In war, it should be obvious to anyone, by now, the latter are always more valued by those in power, than the former\n\nhttps://en.m.wikipedia.org/wiki/The_Fog_of_War",
        "Arthur \"Bomber\" Harris: no, I don't think I will",
        "Note to all statesmen: If you don't want civilian casualties, never mix civilian and military infrastructure. Simple as that.\n\n\n\n\n\nP.S. I swear if China ever bitches about Chinese civilian casualties happening in a *hypothetical* Indo-Pacific War, I will point out their 'civilian-military fusion' shtick as to why that happened.",
        "If Sherman had thought of that, we would still be fighting the civil war.",
        "Japan basically made virtually every bit of civilian infrastructure also military infrastructure and spread it out within cities. This made it really hard to tell what was what. So the US said \"Fuck it. Destroy it all then\".\n\nHiroshima and Nagasaki were also very much military targets via the same production logic.",
        "They chose Hiroshima because it had military infrastructure....\n\nIt was just a really big bomb.",
        "Nagasaki was a huge port city and a rail center, it definitely was a valid target. Infrastructure is usually integrated with major cities.",
        "Enola Gay crew absolute chads\n\nThe Japanese didn't even want to surrender after two cities got wiped out. Nation was a death cult at that point. They didn't know the Americans had used up their two bombs, so they were actually weighing \"should we functionally end the Japanese people over the concept of honor?\" \n\nAnd even after all that the Americans let them keep their dog shit war criminal emperor. \n\nPeople who get worked up about the nukes don't have perspective on the realities of the Pacific War, and/or are 50 IQ tankies. Millions of purple hearts minted and all that, estimated millions of civilian deaths. Okinawa on crack.\n\nJapan became based after the war once they realized cartoons, baseball, jazz, wrestling, and fried chicken are sick as hell, so it had a happy ending.",
        "God I fuckin hate when people that have no idea what they’re talking about, then have the gall to morally grandstand about it.",
        "Tbf, given the circumstances with all the genociding, it was justified, but Harris was very clear that hitting civilian infrastructure wasnt \"UwU sorry its just inaccurate\", it was the entire point.",
        "Because it did?\n\nThe firebombing of Japan was only done because unlike every other country, the Japanese didnt have industrial zoning. Therefore it was hard to target their industry. The firebombing actually only tried to target the areas of the city where the greatest concentration was, not destroy the entire city. \n\nThe American part of the CBO in Europe was probably the most precise attempt by anyone. It was hugely successful and basicalyl obliterated the luftwaffe, substantially hindered German industry in general, and utterly annhilated Germanies oil supply in the second half of 1944. \n\nRegarding the nukes, they were simply the best way to to induce a sort of \"shock effect\" to get the Japanese to surrender. Otherwise the only way forward was to invade the island and let them throw their entire 31 million person population at the invasion. \n\nAnd lastly, but I need to address the entire pretentious nature of the logic from the OP. \n\n\\-World War Two was a total war. This is pretty much always the case in varying degrees once two nation states totally mobilize for war. What nobody seems to consider when they get upset over civilian deaths in pursuit of military objectives is what the cost was of every day the war continued. Using the United States as an example, which was hardly the most casualty laden combatant, the average US Infantry company after D-Day took ONE HUNDRED PERCENT casualties every 3 months. This doesnt mean the entire original cadre died, but it gives some idea of what you are asking of your troops, which are are necessarily DRAFTING to fight the war. EVERY DAY that the war goes on, you are essentially getting one step closer to genociding your entire population as you feed them to the meat grinder. INTENTIONAL civilian deaths in pursuit of proportional military aims are ENTIRELY JUSTIFIED under these circumstances. \n\nAnd one more thing. This is legal under the law of war. Its call proportionality and falls under the \"doctrine of double effect\". FORSEEN AND DELIBERATE killing of civilians is LEGAL AND MORAL when it is done in pursuit of destroying a proportional military objective."
    ],
    "Christopher Nolan's movies \"Oppenheimer\" (2023) and \"Dunkirk\" (2017) are actually set in the same fictional universe.": [
        "Must be very shitty universe if human always fighting each other, imagine living in that kind of universe.",
        "It's great to see that one shell-shocked British soldier rescued in Dunkirk finally overcome his fear and went into nuclear physics, eventually giving the Allies the ultimate weapon that could finally bring World War 2 to an end.\n\nAlso, I didn't know Commander Bolton of the Royal Navy is also living a double life as the famous physicist Niels Bohr. That's a mindblowing reveal.",
        "They should make a made for TV movie called “Doppenheimer” where the characters from both movies get to meet up and do some wacky stuff.",
        "Bring on the Nolanverse.",
        "remiehneppo - tenet - kriknud\n\nIts something like this.",
        "The World War 2 Cinematic Universe",
        "I didn’t know Niels Bohr fought for the British?",
        "The next installment will about JFK. That name drop and post credit scene where it said JFK will return was lit",
        "this actually is a shitty movie detail",
        "His Batman movies are as well",
        "This fucking sub, you guys got me today… invested time into this theory and your comments till about the 3rd comment.",
        "i dont like the 20th Century Cinematic Unverse. Way too dark.",
        "The universe where the background music is so loud you can’t hear the dialogue?",
        "Considering the historical accuracy of Oppenheimer, it really might be set in a fictional universe.",
        "Reminds me of the Ken Burns cinematic universe",
        "All non fiction films are in the same cinematic universe."
    ],
    "Rule too": [
        "From [Wikiquote](https://en.wikiquote.org/wiki/Robert_Oppenheimer):\n\n>\"We waited until the blast had passed, walked out of the shelter and then it was extremely solemn. We knew the world would not be the same. A few people laughed, a few people cried. Most people were silent. I remembered the line from the Hindu scripture, the Bhagavad-Gita: Vishnu is trying to persuade the Prince that he should do his duty and, to impress him, he takes on his multi-armed form and says, \"Now I am become Death, the destroyer of worlds.\" I suppose we all thought that, one way or another.\"\n\nThis was after the Trinity explosion. Regarding the reference to the Bhagavad-Gita, Wikiquote continues:\n\n>The \"Now I am become Death, the destroyer of worlds\" line, spoken to the prince Arjuna by Krishna (not Vishnu, although Krishna is an avatar of Vishnu), is usually translated differently. Oppenheimer's Sanskrit teacher, Arthur Ryder, translated it as \"Death am I, and my present task. / Destruction.\" Most translations tend to translate it as \"time\" or \"terrible time.\"   \n>  \n>Either way, the point is the same: Arjuna is reluctant to go to war, and Krishna has been exhorting him to fulfill his duties as a prince despite his misgivings. Ultimately, Krishna is saying, Arjuna is just an instrument of death acting on his behalf, unable to stop the fate of death that comes to all eventually. Arjuna, suitably humbled, agrees to engage in battle.",
        "I wonder if there were scientists that joined for the sole reason of making a bomb that will go boom real big",
        "I bet the other scientists cringed.",
        "(some weird interpretation of) Hinduism was actually super popular among US scientists at the time. It was like what budism was for stock-brokers a while ago. \n\nThat's why he said it. The passage he was quoting was about a warrior being compelled to do his duty despite personal concerns, though that might have been a post-hoc explanation.",
        "#\"I suppose we all thought that, one way or another.\"",
        ">We knew the world would not be the same. A few people laughed, a few people cried. Most people were silent. I remembered the line from the Hindu scripture, the Bhagavad Gita; Vishnu is trying to persuade the Prince that he should do his duty and, to impress him, takes on his multi-armed form and says, \"Now I am become Death, the destroyer of worlds.\" I suppose we all thought that, one way or another.\n\nY'all understand that he's comparing himself to the Prince and not Vishnu, right? We get that he's saying that he was humbled and awed by witnessing the nuclear explosion and not that he, personally, felt like the God of Destruction because he'd helped make a big bomb, right?",
        "I feel like a lot of you would benefit from the whole quote. \n\n\"We knew the world would not be the same. A few people laughed, a few people cried. Most people were silent. I remembered the line from the Hindu scripture, the Bhagavad Gita; Vishnu is trying to persuade the Prince that he should do his duty and, to impress him, takes on his multi-armed form and says, \"Now I am become Death, the destroyer of worlds.\" I suppose we all thought that, one way or another\"",
        "Oppenheimer isn't describing himself as death but the bomb it's self. The story shows Vishnu showing his prince a monstrous form to impress him and proclaiming that he is death. The monstrous form in this case is incomprehensible magnitude of the explosion with Oppenheimer and the other scientists as the prince.",
        "Dr. Krieger from Archer",
        "Damn I deleted Twitter but I miss Beany Tuesday",
        "\"Hey do you want to help make a giant bomb to blow people up?\"\n\n\"Yeah okay\"\n\n*the bomb works*\n\n\"OH NO THE BOMB BLEW PEOPLE UP I AM BECOME SNEED THE FEEDER OF SEED\"",
        "A few years later a buddy of my grandfather in Mars Bluff SC. \" Yeah? Well fuck you, asshole!\"\n\nhttps://en.m.wikipedia.org/wiki/1958_Mars_Bluff_B-47_nuclear_weapon_loss_incident\n\nI think there was another lost nuke in North Carolina. *googles* ok that was two.\n\n The US has accidentally dropped a total of 3 nuclear bombs on the Carolinas.\n\nhttps://spectrumlocalnews.com/nc/charlotte/weather/2023/01/24/a-look-back-at-north-carolina-s-1961-nuclear-mishap\n\nNot saying we didn't have *one* coming but goddamn. Japan got one less.\n\nMyrtle Beach a'int *that* bad guys.",
        "How it's like being the Et;al in a paper with 6+ authors",
        "\"same\"",
        "Pwease don't fowget  me 👉👈",
        "\"Ratio\""
    ],
    "TIL: Robert Oppenheimer, father of the atom bomb, famously said \"Now I am become Death, the destroyer of worlds.\" after witnessing his creations power. That quote is actually from the Hindu Epic Bhagavad-Gita, and Oppenheimer turned to Hinduism after seeing nuclear weapons capabilities years later.": [
        "A brief discussion of what [the quote means](https://np.reddit.com/r/todayilearned/comments/4ye0gf/til_the_hindu_god_shiva_has_long_been_linked_to/d6nsnem/?context=3) in the Bhagavad Gita \n\n**The background** \n\nArjuna, the mighty warrior prince, and his brothers [are going to war](https://np.reddit.com/r/AskHistorians/comments/2ij6t5/can_anyone_give_me_a_bit_of_a_backstory_on_the/) against his cousins, to fight for their rights and avenge injustices. But on seeing his cousins, uncles, family ranged against him, Arjuna breaks down and asks Krishna, the avatar of God, \"How can you justify war, the killing, and even slaying your own relatives\". Krishna's response is the [Gita](https://en.wikipedia.org/wiki/Bhagavad_Gita), the most famous of Hindu scriptures\n\n**The Line** \n\n> I am Time (Kaal), the destroyer of all worlds.\n\n> ([Ch 11 Verse 32](https://www.holy-bhagavad-gita.org/chapter/11/verse/32)) \"kalo'smi loka-ksaya-krt pravrddho\" meaning \"He is all powerful time (kaal as in kalo), destroyer of all the worlds.\"\n\nThe argument is that Time has already seen/consumed/accomplished the death of all Arjuna's opponents on the battlefield without Arjuna having picked up a single weapon. So you (Arjuna) might as well fight these opponents, as they are already slain by Me (God/Time)\n\n**The inferences/discussion** courtesy also /u/Tifud\n\n1. Krishna is telling Arjuna not wuss out, to do his job, his duty, but *whether he does or not*, all those assembled are already dead. And he will be judged accordingly. He is just Krishna's instrument, wonderfully skilled.\n\nIt's a bit of mindf** touching upon free will, the hindu concept of karma and dharma (duty, right/good, merit) etc\n\n2. At the same time, at the end of the entire bhagavad gita, after Krishna has literally pulled God on Arjuna, he says \"Do as you will\"\n\n3. So one interpretation is do as you judge best, act not for your [gain](https://www.holy-bhagavad-gita.org/chapter/2/verse/47) alone and I will decide and judge you..\n\n4. Another interpretation is that God pulls a thousand strings to effect his goal, yet stands by the side as companion leaving it to man (Arjuna) to actually do the deeds.\n\nThe paradox of evil in a world with an all powerful and good god is neatly sidestepped\n\n**A brief discussion of what it might have meant for Oppenheimer** - from [Alex Wellerstein](http://blog.nuclearsecrecy.com/2014/05/23/oppenheimer-gita) /u/restricteddata. Credit also Prof Hijiya\n\n> Rather, it is him being awed by what is being displayed in front of him, confronted with the spectacle of death itself unveiled in front of him, .... and realizing how little and inconsequential he is as a result. *Compelled by something cosmic and terrifying, Oppenheimer then reconciles himself to his duty as a prince of physics, and that duty is war.*\n\nBonus Edit : Oppenheimer also [thought](https://en.wikipedia.org/wiki/J._Robert_Oppenheimer#Trinity) of [another line](http://www.bhagavad-gita.org/Gita/verse-11-11.html) from the Gita when he saw the Trinity fireball\n\n> If the **radiance of a thousand suns** were to burst at once into the sky, that would be like the splendor of the mighty one\n\n------\n\nLate Bonus Edit 2: **a good discussion of the grammar of 'I am become' vs 'I have become'** via  /u/mercurialohearn, /u/yakrider07,  and other excellent folks at  [Askhistorians](https://www.reddit.com/r/AskHistorians/comments/1ny2sl/what_is_the_significance_of_the_use_of_i_am/)   - as a correct, if archaic form of English also encountered elsewhere such as in the bible, in carols, in other phrases . It is due to English's Germanic influence/roots. It also could be simply a poetic translation.\n\n/u/koine_lingua also provides examples of more modern translations of the Gita eg\n>\"I am time grown old, creating world destruction” (Miller) or “time . . . grown mature” (Radhakrishnan). These are superficially similar to Oppenheimer's \"become death\" (in the sense that they seem to both be verbs usually used for a process). ...[Similarly] \"I am time, mighty wreaker of the world's destruction\"",
        "It is an ancient Hindu text, quoted by an American.  \n\nHe invented the atomic bomb. He was later accused of being a Communist.",
        "First learned this from Linkin Park's A Thousand Suns. Great concept album if you like it a bit more experimental.",
        "He first said that in 1965. That's a long time to come up with something to say....",
        "Not to split hairs but he didn’t turn to Hinduism in his later years. Oppenheimer was a well read student and had made his way through Indian and Hindu texts in earlier college studies. He was quite the intellectual through all of his life and did not “turn” to Hinduism in his later years. \n\nSource: the book “American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer”",
        "[Here's the video of that soeech.](https://youtu.be/lb13ynu3Iac)",
        "The guy must have had a hell of a CV.\n\n1942-1945: Became Death, Destroyer of Worlds",
        "> It isn’t a case of the “father” of the bomb declaring himself “death, the destroyer of worlds” in a fit of grandiosity or hubris. Rather, it is him being awed by what is being displayed in front of him, confronted with the spectacle of death itself unveiled in front of him, .... and realizing how little and inconsequential he is as a result. *Compelled by something cosmic and terrifying, Oppenheimer then reconciles himself to his duty as a prince of physics, and that duty is war.*\n\n\\-  [Alex Wellerstein](http://blog.nuclearsecrecy.com/2014/05/23/oppenheimer-gita/)  featuring a [video](https://youtu.be/n8H7Jibx-c0) of old oppenheimer saying it in 1965.\n\n> Oppenheimer was not a Hindu. He was not much of anything, religiously — he was born into a fairly secular Jewish family, embraced the Ethical Culture of Felix Adler and [saw philosophy as a boon to his soul; enjoying the ideas of the Gita but was not religious about it]",
        "[deleted]",
        "He also tried to poison a teacher he didn’t like.  Really bright people are often a little obviously unbalanced and no more morally wise than actors or athletes.   There has never been such a peaceful transfer of power as the second half of the twentieth century to when the old colonial powers withdrew and the new ones took over.  The cold war was bloody, but nothing compared to the rest of human history.  The overwhelming slaughter was from states killing directly or through neglect, their own citizens.  One of things that gets missed in popular history is the reality of demographics.  There are now five times as many people sharing the planet as when Oppenheimer was born.   The fact that there aren’t wars involving billions of people, is pretty amazing.  I’m not saying it won’t happen, Russia and China both seem to currently have expansionist colonial ambitions and there are vast population pressures in places without the agriculture to support them, but so far so good.  Oppenheimer died in 1967.  I think he would be overall very pleasantly surprised by the state of the world today.",
        "Enough time passes and the TILs make ya feel old ... in that some younger people find this a TIL.\n\n......soooooo when do we get the TIL on that Max Headroom thing. Or maybe that pencils used to be used to rewind tapes. Or that the guy that played Xavier was once in Dune.\n\n*ages a decade in 1 minute*\n\nI am Grups!",
        "People who are not familiar with this quote would miss the reference in the Epic Rap Battle [Oppenheimer vs. Thanos](https://www.youtube.com/watch?v=v1vXC-vKgKg), when he said \"after your raps, I am become deaf\". That burn alone won the battle.",
        "I believe he slightly misquoted the sentence he was talking about and \"I am become time, destroyer of worlds.\" is a closer translation",
        "I'm not a native English speaker. This old Oppenheimer quote has been bothering me for like... 15 years or something and I can't take it anymore. **Isn't \"Now I am become Death, the destroyer of worlds\" grammatically incorrect?**  \n  \nIt should read \"Now I have become Death...\". The words being \"Now I am become Death\". Sounds as stupid as saying \"Now I am become a doctor\" or \"Now I am arrived on time\" or \"Now I am come home\".  \n  \nIt just sounds wrong but since English isn't my native tongue I can't really call it out as such. So please - some English grammar lord out there - please tell me what the fuck is up with this sentence :(",
        "Reminds me of the Feynman interviews on his work in the Manhattan project, talking about how he would just picture everything around him in ruins and feel like all life was pointless knowing that such incredibly destructive weapons existed.",
        "What? He says that it's a quote right before saying the quote. There is no \"actually\".\n\n\"We knew the world would not be the same. A few people laughed, a few people cried, most people were silent. I remembered the line from the Hindu scripture, the Bhagavad-Gita. Vishnu is trying to persuade the Prince that he should do his duty and to impress him takes on his multi-armed form and says, 'I am become Death, the destroyer of worlds.' I suppose we all thought that one way or another.\""
    ],
    "he created the funny moment": [
        "if this post fits /r/okbuddyretard than FR*ACKING SMACK THAT LIKE BUTTON!!!!!!!!!!!!!!!\nif not then thumbs down lol........ epic fai.l.......\n[vidoe dowload](https://redditsave.com/info?url=https://www.reddit.com/r/okbuddyretard/comments/zpm7qf/he_created_the_funny_moment/)",
        "\"PETAAAAAH\" - lois",
        "Why is everybody posting about him today",
        "Also creator of the vine boom",
        "I am become gay, sucker of pee pees",
        "the Family Guy bombed Nagasaki",
        "Repost",
        "Teller based, Oppenheimer cringe.",
        "Sovereign Nation Nuclear ANNIHILATION Try Not To Laugh Compilation CHALLENGE!",
        "Peetah I need ten bad bitches and they all need to be emo",
        "Holy shit Christopher Nolan reference \n\nCum",
        "CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM CUM haha male ejelacution funi",
        "Now I became the FUN. The CREATOR of the MEMES",
        "He be watching Family Guy Season 12 Episode 4 Full Episode 1080p HD Nocuts",
        "https://youtu.be/H8K4rl2uvuA",
        "I’m simple I upvote family guy"
    ],
    "Just when Anon thought he was out": [
        "It's Oppenheimering time",
        "[deleted]",
        "i need a hero starts playing over a montage of oppenheimer doing mental exercises",
        "You son of a bitch I’m in.",
        "\"Insert these cockshaped atoms into my ass right now, Albert\" Oppenheimer said forcefully. \"B-b-but its exceeding critical mass.\" Albert blushed slightly, but continued with the force of a 1000 suns.",
        "Super Atom Bros 2\n\n\"First we eat the mushrooms, then we build the bombs, and then we get the women\"",
        "“oh noo, they are using my bombs to bomb peouple again noooo”\n\n-openhuimur",
        "What MCU does to a mf",
        "Le nazis? Are le back? \n\nMy le expertize is le needed?",
        "[deleted]",
        "Op-op-op-Oppenheimer Style",
        "Some guy: Your calculations can't be correct, you end up with infinite gravity.\n\n\nAlbert: stfu, you can kiss my big blagk hole!",
        "I was so irritated by the image I read \"moustache music starts\"",
        "Push it to the limit",
        "Oppenheimer: Zis time, vee don’t kill zee Jews, right?",
        "https://www.youtube.com/watch?v=8VgSyKl9vg0"
    ],
    "Double agent.": [
        "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming)",
        "Two of the movies of all time",
        "I like this [movie](https://youtu.be/HSB4hxsohdM) and the spray tanned abs and green screen jokes were great.",
        "Meet the Spartans. Love that movie",
        "Man I loved Meet the Spartans.",
        "Me illegally downloading pikmin 4",
        "THIS IS SPARTA",
        "Fuck i love meet the spartans. Its been forever since i last watched it.",
        "Me trying to play Pikmin 4 in the cinema at the Barbie premiere without being caught",
        "No lie as a guy I really like barbie so im gonna watch it first then Oppenheimer",
        "I cant",
        "My le bomb",
        "How he know im gonna do it just like that",
        "Imagination.....that is your creation.  🚀💥",
        "I shit you not, me and some friends are going out for a movie, and the movie list isn't out yet completely,  and the two movies already there, are Barbie, and Oppenheimer, anyone curious, or for proof, dm me",
        "Yo mama so dumb she thought 2pac shakure was a Jewish holiday"
    ],
    "I read Bhagwat Geeta in preparation of my role in Oppenheimer. Absolutely beautiful text- Lead actor Cillian Murphy": [
        "Namaskaram /u/thwitter, Thank you for your submission. Please provide a source for the image / video (if not a direct link submission). We would really appreciate it if you could mention the source as a reply to this comment! If you have already provided the source or if it is an OC post, please ignore this message.  Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndiaSpeaks) if you have any questions or concerns.*",
        "Any other actor if were there, I would have brushed it off as mere movie marketing gimmick, but having followed Cillian through years, I am inclined to believe he certainly did",
        "Love this guy - one of the very good actors!\n\nBut Indians need to stop getting validation from goras. Who the fuck cares if Oppenheimer quoted from Gita or not - irrespective Gita will be the holy text for us Hindus!",
        "Question: Does Bhagwat Gita holds true in our relentless pursuit of life? \nCillian Murphy: Good question. It’s a beautiful text. Don’t grill me on it. \n\nCillian is catholic from Ireland. He’s an actor and has to maintain an image and understands that the film has a wide market base in India. \nHe wants to respect Bhagwat Gita (and that’s enough) and the Hindu Faith. \nNothing more in the video. Don’t get overwhelmed by his validation.",
        "And how many of the so called kattar hindus have read Geeta in our country, probably zero. I am pretty sure  a good chuck of our people won't even able to recite gayatri mantra",
        "Ab keh do Cillian andh bhakt hai",
        "Just hope it was not \"As it is\"...",
        "A lot of Anti hindu subreddits but its rare to see any post without hinduphobia",
        "He never read it period..",
        "And? So what… is he willing to live by it.",
        "What do you have to forcefully roll your tongue to make that weird faux accent? Just be natural!",
        "I feel like it's some kind of a pr tactic to attract Indian audience",
        "Usne to padh liya. Tum kab padhoge...",
        "Am I the only one who thinks she died for a moment when he said it’s beautiful?",
        "I think the Oppenheimer team has been paying media houses in india to publish stories about how mr.oppenheimer read gita...i am seeing these articles daily now..this is all just marketing nothing else",
        "Yayyyy, White Validation mil gaya."
    ],
    "To promote the release of Oppenheimer (2023), a movie about the creation of the atomic bomb, Universal decided to release a bomb just a month before.": [
        "I’ve seen two trailers for this and both told completely different stories that I thought it was two different movies",
        "Wait... this movie already came out? Didn't even realize.",
        "35 million dollars international gross on a 70 million dollar budget",
        "I haven’t even heard about this",
        "Warner Bros and Disney did this same strategy too with the Flash and Indiana Jones 5",
        "Jeez has there been even one successful movie this year?",
        "Just saw this movie yesterday and I recommend it if your looking to kill some time with friends and fam",
        "How many times is this sub gonna post this same exact joke",
        "From the 2 trailers I saw, this movie looked like it had so much potential to be a success. If it was marketed better, maybe it could’ve done ok?",
        "Can it even be called a bomb if it didn't go off? It's a dud.",
        "I feel like we've gotten like 3 renditions of this exact post in like a couple of days.",
        "Can we all just stop with the posts that just go “lol x movie did badly at the box office”? It feels like this sub has made this joke over a thousand times this year with no clever variations (although to be fair, that is par for the course for this sub)",
        "The one point I will give this movie is that, since Ruby has no bones, she can be animated in some pretty intriguing and goofy ways. That's it tho. That- that's literally all I can say that's positive about this movie.",
        "I'll say it: I watched the movie and liked it.\n\nOf course it had problems, but it was enjoyable to me and that's what matters.",
        "It’s not even out in Australia yet so I didn’t even realise it already came out for America",
        "Everyone was so hyped to see this movie cause lol redhead mermaid and then it came out and everyone's like lol I'm so happy it's bombing. What the hell happened?"
    ],
    "Recreating the effects from Oppenheimer without CGI": [
        "Step 1. Acquire a thermonuclear warhead",
        "The soundtrack of the movie is just fantastic, i get goosebumps everytime i hear it",
        "Movie studios hate them for this one simple trick!",
        "I want to know how he did the shot of the world getting engulfed with a chain reaction of nukes without CGI",
        "It wasn't 1000 db tho.  My ears need to bleed to get the theater experience.",
        "Oppenheimer budget: 100 million\n\nThese guys: 100 bucks\n\nOppenheimer studio execs: 😮",
        "Dude's IG [Link](https://www.instagram.com/reel/Cv-zJDJpgX_/?igshid=MzRlODBiNWFlZA==)\n\nYouTube https://youtu.be/o2FqU2f6DRc",
        "Off topic, but where else would a butt monkey live?",
        "did Oppenheimer use CGI?",
        "I did watch the entire video last week. Got to appreciate their creativity and patience",
        "Dude this is amazing",
        "The effects in Oppenheimer were mainly practical and not CGI. They worked for 7 months before filming began to perfect the techniques needed for the movie. Corridor Crew has a good video of it.",
        "But Oppenheimers effects weren’t cg in the first place?",
        "Does he know the difference between CGI and VFX?\n\nThere wasn't any CGI used in Oppenheimer, IIRC Nolan isn't fond of it.",
        "That kind of sucked… I hope the movie wasn’t like that lol",
        "Christopher Nolan didn't use CGI in oppenheimer though..."
    ],
    "Oppnheimer be like, \"Told ya so\"": [
        "Yeah, the official line IS not \"crybaby\" but \"son of a bitch\"",
        "Wouldn’t they develop it even if the US would engage in talks to limit their proliferation? I’m not educated enough to say this, but I think Oppenheimer was a little bit naive to think other countries would stop or limit their development of nukes after the US just created it and used it. That ship sailed the moment the US developed it.",
        "Officially, Oppenheimer's stance on nukes was \"Build them, they make a great deterrent\".\n\nHe only really got upset when nukes started getting *bigger* and when anyone *except* the US started building them.",
        "If Truman really said that the Soviet Union would never make a nuclear weapon, it’s the stupidest remark he made in his entire life. I mean, this is so crazy that I really have no words for it.\n\nThis should be used as a thorough underlining of a dictum by, I believe, Lord Acton: “It is better to keep your mouth shut and let people think you’re a fool, than to open it and remove all doubt.” Especially politicians should take note.",
        "And then said \"you gave them the secrets dirty communist!\" Lmao",
        "I wonder what kind of deranged American exceptionalism led Truman to believe that the Soviets or the Chinese couldn't figure out how to make the bomb",
        "Basing my knowledge purely on the movie …. Yeah but that was bc oppendopper had a v lax approach to national security",
        "I believe the crybaby thing was over oppenheimer feeling like he had blood on his hands when truman was the one that ordered it be dropped on japan.",
        "The movie made Truman sound like a Cajun-sounding, warmongering cretin. Can't say it was wrong.",
        "The nuclear stalemate was good actually. It never led to the apocalypse Oppenheimer feared and definitely prevented a direct conflict between the US and Soviet Union which would have killed who knows how many.",
        "And I will call all of humanity dead meat",
        "Balance as all thing show have.",
        "> Oppenheimer: poisons his professor\n> Public: we should glorify this guy",
        "The Soviets knew about the possibility of creating a nuke one year before the American nuclear program itself started  thanks to Soviet spies in America. In fact, the Soviets knew more about the nuke than Roosevelt",
        "I don't think he liked being right",
        "Oppenheimer was wrong, he thought nukes would create more death however deaths from wars have fallen incredibly dramatically since the invention of nukes and hydrogen bombs. As time goes on Oppenheimer’s critics are being proven wrong."
    ],
    "John F Kennedy and his gay “best friend”, Lem Billings": [
        "**Related subreddit:** /r/LGBTHistory\n\n**Discord:** https://discord.gg/E2XabTSdEG\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SapphoAndHerFriend) if you have any questions or concerns.*",
        "Y’all remember when Pete Buttigieg said something to the effect of “statistically, I would probably not be the first gay president”",
        "\"Please don't write to me on toilet paper any more, I'm not that kind of boy\" has two ways to see it, and I really like the \"I deserve love written to me on proper stationery.\"",
        "Lol, his oral history",
        "*Their arrangement, Quirk says, “enabled John to sustain his self-delusion that straight men who received oral sex from other males were really only straights looking for sexual release,” and, “John was in love with Lem being in love with him and considered him the ideal follower adorer.”*\n\nHonestly even still this is a fairly common dynamic",
        "…his name was LEMMINGS BILLINGS?",
        "Ah yes I love these two. I literally did a whole power point for my friends about them",
        "I remember seeing these pictures before and still being a little skeptic of a relationship, but then I saw [this picture.](https://alphahistory.com/pastpeculiar/wp-content/uploads/2013/07/jfkbillings.jpg)\n\nYeah, I'm very convinced.",
        "Wow, crazy how much queer erasure is in history. I had never heard about this and this seems huge",
        "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.irishcentral.com/roots/history/jfk-gay-experiences-friend](https://www.irishcentral.com/roots/history/jfk-gay-experiences-friend)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
        "Per \"Secret City: The Hidden History of Gay Washington\" [https://www.amazon.com/Secret-City-Hidden-History-Washington/dp/1627792325](https://www.amazon.com/Secret-City-Hidden-History-Washington/dp/1627792325), JFK's closest friend was indeed this gay man. Billings was in love with JFK, but respected that JFK was heterosexual. That said, I highly recommend Secret City. Great book!",
        "The first Irish-catholic and first gay president? Thats an odd mix.",
        "Chums",
        "Kennedy like \"nah dude. I'm not gay for getting my dick sucked. YOU'RE gay for sucking a dudes dick!\" And they'd go get root beer floats after",
        "That JFK was killed by his own government as part of the Lavender Scare is the only conspiracy theory I believe. JFK was killed at the height of the Lavender scare; which was initiated and/or led by at least three self hating gay/bi men - Roy Cohn, McCarthy, and one of the Dulles brothers. Lem Billings had no official role in the White House (later promoted to \"Friend of the President\" as his official title) and had a bedroom RIGHT NEXT to JFK's. \n\n- There are a few great episodes of the Behind the Bastards podcast on Cohn and the Dulles brothers. \n- Lem Billings has an entire wing of the JFK museum, and like... Jackie doesn't....\n- Lem remained close with JFK's kids until his death\n- Growing up, JFK's family knew Lem was gay since his teen years and he was still practically adopted into the family. He and JFK were rarely seen without the other before JFK ran for office.\n- I always found it weird that JFK and Robert Kennedy, who were very close and told each other everything, would somehow or for some reason have the same mistress (Monroe). I posit it was more likely that Robert planted the rumors about Monroe and the allegations of JFK sneaking parades of women into the white house, as cover for JFK's relations with Lem Billings.",
        "I, ere, thought his gay best friend was Ponce deLion!"
    ],
    "AMC Theaters Says More Than 20,000 Moviegoers Have Already Booked ‘Barbie’-‘Oppenheimer’ Double Features": [
        "Honestly kinda a good idea to go from bleak and existential to hot pink everything",
        "Now I am become a Barbie Girl. Destroyer of Barbie worlds.",
        "The era of Barbenheimer is here.",
        "I'm double billing but at different cinemas. IMAX then a walk across town to a normal cinema.",
        "Maybe Oppenheimer is Ken's last name, tricking people into thinking that they are paying to see two movies when they're really only getting one.",
        "It’s like when the goth and the cheerleader are best friends.",
        "This is the cinema equivalent of the Animal Crossing/Doom Eternal launch.",
        "I love this healthy competition between two films that are complete opposites.",
        "This has been the weirdest marketing mashup I’ve seen since Marvel branded Crock Pots",
        "Me and 8 friends are among the 20,000!!! So so excited for Barbenheimer! 👠💣",
        "11am opppenheimer, 4pm Barbie for me. Need that Kenergy going into the evening",
        "A great pairing actually: one film’s about the deadliest weapon mankind ever created, and the other’s called Oppenheimer",
        "From what I’m hearing, I’m getting the impression that after you watch Oppenheimer, you kind of NEED to watch the Barbie movie after in order to get your spirits back up.",
        "My God! That’s almost as many people as went to see the Flash!",
        "Math is hard!  Let's go ~~shopping~~ blow shit up",
        "Framing device: Experiencing immense guilt over the weapon that he has created, Oppenheimer retreats from the world and plays with Barbie dolls all day, every day."
    ],
    "I've made a list of WW2 movies and put them in chronological order.": [
        "This is absolutely amazing",
        "you need to make this into a website or something. or at least a letterboxd list",
        "I don’t really have much to add but I just wanna saw that this list is amazing, thanks for taking the time to put it together",
        "Very impressive. Darkest Hour should be around the time of the Dunkirk evacuation, though.",
        "Missing: \n\n+ [Grave of the Fireflies](https://en.wikipedia.org/wiki/Grave_of_the_Fireflies)\n\n+ [Merry Christmas Mr. Lawerence](https://en.wikipedia.org/wiki/Merry_Christmas,_Mr._Lawrence)",
        "Is this all set in the same cinematic universe?",
        "That's a very good list. I feel this needs to be a permanent Wikipedia page.\n\nAnyway, I have additions:\n\nThe Heroes of Telemark, a story based on Operation Gunnerside where in 1943, Allied and Norwegian commandos destroyed heavy water production.\n\nThe Dambusters. Based on Operation Chastise where German Dams were destroyed in May 1943.\n\nThe Cockelshell Heroes. Based on Operation Frankton. In 1942, British marines sailed in Kayaks to Bordeaux and destroyed cargo shipping with limpet mines.\n\nAlso, would the capture of Eichmann count for this list? It was many years later, so up to you.",
        "Your list is missing The unknown soldier",
        "[Operation Finale](https://www.imdb.com/title/tt5208252/) is another good movie that takes place post WW2, about tracking down Adolph Eichmann",
        "Okay. Now edit them all together in a massive “This is WWII” series.",
        "I spent a relatively long time trying to figure out how someone made a movie about Hitler in 1899...\n\nThen I read a little further and realized how the list was formatted and it made a lot more sense, lol",
        "Excellent list OP, fantastic - saved!\n\nJust to throw a few suggestions in:\n\n* [Ill Met By Moonlight](https://en.wikipedia.org/wiki/Ill_Met_by_Moonlight_(film)) (Crete)\n* [The Heroes Of Telemark](https://en.wikipedia.org/wiki/The_Heroes_of_Telemark) (Norwegian heavy water)\n* [Above us The Waves](https://en.wikipedia.org/wiki/Above_Us_the_Waves) (attempting to sink the Tirpitz)\n* [Battle of The V1](https://en.wikipedia.org/wiki/Battle_of_the_V-1) / Missiles From Hell / Unseen Heroes\n* [Triple Cross](https://en.wikipedia.org/wiki/Triple_Cross_(1966_film)) \\- The story of British safe-cracker turned double-agent\n\nI don't know if you're doing pure fiction (Guns Of Navarone is semi-fictional and it's in there) but *Where Eagles Dare* is pretty great, and *Escape To Victory* is an odd one which may have a degree of basis in real events even if it's not directly true.",
        "Missing: [https://en.wikipedia.org/wiki/Into\\_the\\_Storm\\_(2009\\_film)](https://en.wikipedia.org/wiki/Into_the_Storm_(2009_film)) was award winning",
        "Where would Come and See fit in to this ?",
        "Damn. Nice work. Is it missing when trumpets fade? I’m using a phone so apologies if I can’t see it\n\nCross of iron too",
        "I’d like to suggest Stalag 17 (1953), Army of Shadows (1969), and A Man Escaped (1956)"
    ],
    "Eagle-eyed viewers of the so-called Barbenheimer (2023) double feature noticed a small detail: spending $80 and 5 hours in a movie theater isn't as much fun as they thought it would be": [
        "Is it $80 with the tie in meals, the barbie burger and the Whoppenheimer?",
        "Interesting companion fact that I’ve noticed about Barbenheimer (2023): at around the 3hr 17 minute mark, small 10 month old infant sitting 3 rows behind me began crying louder than normal. This was ultimately due to their need of a diaper changing, which is silly since I was able to change mine inbetween films 🤷🏾‍♂️",
        "I only spent like 24 dollars. All y'all are going to the wrong theaters if tickets cost more than 15 dollars.",
        "80 dollars? My Barbie ticket was 10.50 USD…",
        "How much of that was for the tickets themselves?",
        "This Sunday for me baby, can’t fucking WAIT",
        "Where is OP going for 80 dollar tickets",
        "Dang bro, who's paying $80 for two movies? Tuesday sales go brrr",
        "It was more fun than I thought, maybe if you know you can't sit for 5 hours you shouldn't, or should take a 1hr break in between movies for eating and clearing your mind, or should get better company",
        "Yeah, no, here in Croatia, even with inflation, the most expensive ticket possible costs no more than €10.",
        "I went to a $5 theater. I only payed $12 total for one okay film and one amazing film.",
        "Discount Tuesdays at my local cinemark are the only days I go to movies anymore. $6.50 tickets all day.",
        "The trick is heading straight to the next movie without buying a ticket",
        "I have a solution to that but i will probably be banned for mentioning it",
        "Wtf, it's £4.99 a ticket over here. I might spend like £50 including dinner and a generous amount of popcorn with a drink",
        "It actually is if you want to take a break from work. Both are well-made, one is dumb-fun for the younger generation that delivers a good message, and the other one is Barbie."
    ],
    "My favorite part of Oppenheimer (2023) was the post credits scene when Oppenheimer had a rap battle with Thanos": [
        "\"You wanna talk about death? How about the one that looked at you and swiped left?\"",
        "'listening to you took everything i had left. after your raps, i am become deaf'\n\n🔥✍️🔥",
        "He's got that fissile material",
        "...but between us, who's the worst emcee? You!",
        "He and Barbie deserve an marvel movie, where Super Barbie tries to save the world from Oppenheimer, Destroyer of The Worlds.",
        "It was truly sad he had no answer for Fortnite’s dopest dancer",
        "You were born to Eternals. But came out looking so scary. That your own mother. Tried to make you a temporary. Meanwhile I've mastered the atom more than any man alive. Now I'm here to split you like 2 and 3 from 5.",
        "''You just got no answer!\n\n....\n\nto Fortnite's Dopest dancer!''\n\nOne of the few times an ERB character committed verbal suicide",
        "Yo is this ERB episode real",
        "\"This guy's an Avenger? His middle name's Robert...\"",
        "I am become deaf",
        "Damn ERB keeps on getting better",
        "That U235 bar was excellent! \n\nI remember the first time I heard it, going back and double checking that I'd heard it right, then googling to make sure that I was remembering correctly that U235 is fissile. Absolutely top-tier writing.",
        "Such a weird rap because thanos kinda sucked but Oppenheimer was so good that the whole thing felt like a metaphor for the atomic bomb",
        "Oppenheimer's half was so good, and Thanos's was so mediocre, I've always considered this video a lost opportunity. Having real historical figures battle fictional characters never really worked. It should have been Oppenheimer vs von Braun.",
        "Oppai heimer closing verse in that rap battle was so explosive"
    ],
    "The true split of the UK": [
        "Did anyone do a 'Barbenheimer' feature over the weekend?",
        "Incredible idea to make a map which says last 24 hours and not include a date",
        "Scotland and Wales be 💅",
        "And this is the true reason why Scotland (and Estonia) can't into Nordic :(\n\nPlease ignore Iceland.",
        "For the first time ever is England and Ireland Vs Scotland and Wales",
        "What is to be discerned from this information 🤔",
        "We Scots, we’re somethin else! Were Barbie girls in a Barbie world!",
        "If you told me a year ago that movie theatre attendance was going to get revitalized through a meme, I wouldn't have believed you, but here we are. The union of two competing blockbusters became one of the most wholesome and fun things of the past couple years.",
        "As a grown man and confirmed nihilist who's favourite film of all time is The Thing and enjoyed the fuck out of Oppenheimer, is Barbie any good? I scoffed when the first publicity stills were released but the weirdly adult vibe of the trailer intrigued me. My niece keeps nipping my head to take her to see it and I'm wondering if I should just cave and go.",
        "English still healing from WWII",
        "Nice to see a united ireland",
        "Could have guessed Ireland because Murphy is a Cork boi",
        "germany's trying to learn from past mistakes",
        "Effeminate southern places: Barbie\n\nMasculine northern places: Oppenheimer\n\nMasculine northern places which, due to local circumstances, prefer to avoid the topic of nuclear war at the moment: Barbie\n\nOther: Wales",
        "What’s the takeaway here?",
        "Portugal be like: fuck me, right?"
    ],
    "Albert Einstein Didn't charge any money for his role in Oppenheimer.": [
        "[removed]",
        "Who told you?\n\nHe's my grandfather and he charged 1million for a 5 minute Cameo. Nolan personally offered 5 million for 5 minutes of foot exposure but my grandfather declined.",
        "“Mr Blutarski 0.0”",
        "I heard he gave the caterer $100 for how nice they were and the entire production team clapped",
        "Alberto Einsteino",
        "\"Way to go Einstein\"",
        "What a loser. Dude could be swimming in cash.\n\nThis is the problem with being book smart over street smart.",
        "Getting strong Grandpa Joe vibes from this pic.",
        "Another fun fact is that this isn't him, it's his twin brother Bert Einstein.",
        "Sure, he's got all his quantum physics money.",
        "Is he stupid?",
        "He’s good people.",
        "Is this the actor from Friends? Emily's dad who tells Jack Gellar. \"I could kill you with my thumb!\"",
        "I hope his iconic scene with the tongue makes the cut",
        "That's not Einstein, that's Zweistein",
        "Is that Andrew Lloyd Weezer"
    ],
    "How ‘Oppenheimer’ Pulled Off an Atomic Bomb Explosion Without CGI: A Giant Aquarium, Balloons and More": [
        "they didn't pull a titanic and light off a small atomic bomb and film it?",
        "Spoiler:\n\n>How van Hoytema and the team actually pulled off the jaw-droppingly spectacular moment remains a mystery.",
        "I shit you not, the theatre lost power right before the explosion happened on screen.\n\nWorst blue balls ever.",
        "Yeah it didn’t look any different from a gasoline explosion. The sound effect was impressive and impactful but it did not look like an atomic bomb visually.",
        "[removed]",
        "They used very similar effects (a large aquarium, etc.) for many Japanese Godzilla films and similar Toho daikaiju films and their explosion effects.\n\nFitting, considering most Japanese kaiju are products of atomic bombs. I’m glad to see that Eiji Tsuburaya’s effects methods are still being used.",
        "To save you a click - they don’t tell you shit in this article.",
        "I don't understand this CGI allergy. Bad CGI is bad. Good is great for the story. Get it done with whatever tools help tell the story.",
        "*Blind men and an elephant*",
        "I can respect the decision, but the CGI blast in Twin Peaks: The Return sorta set the bar high there...it's ok to use computers and VFX for some things you can't actually do in real life, man.",
        "The explosion looks almost identical to the real Trinity test footage, what an achievement. People expecting something else are daft.",
        "Listen, I love Nolan and those 3 hours flew by, but after seeing the Trinity test, I think CGI was the way to go. The actual trinity test, and [far footage like this one](https://youtu.be/8PJEpeU00eU?t=12) looks way more impressive.",
        "Christopher Nolan is pretty damn smart in the physical props department. Gotta give credit where credit is due.",
        "I was like Bart after he bought that dinosaur sponge",
        "“Despite not using VFX, Nolan and van Hoytema worked closely with special effects supervisor Scott Fisher and visual effects supervisor Andrew Jackson…”\n\nDo they not know VFX is visual effects lol. They absolutely used VFX, maybe not CGI, but they used visual effects. Clowns.",
        "enjoyed the movie. Would give it a 8/10.\n\nBut man, I expected way more from the nuclear bomb test. Too small scale and not \"enough destruction\" (I do not mean casualties, I just mean they could have conveyed the sheer horror of such a weapon of mass destruction way better by showing the audience how easily man-made objects are obliterated when enough force is applied)."
    ],
    "Peter please explain so my girlfriend doesn’t think I’m stupid & break up with me": [
        "theres a series of memes like this where theres normal ass items and then one very silly and extravagantly expensive item, this is just that meme featuring oppenheimer in honor of the new movie",
        "The joke is that he's wearing women's lingerie under his normal clothes and it's ridiculously expensive as well in comparison to the rest of his outfit",
        "It would make more sense if it was J Edgar Hoover, who was rumored to be a cross-dresser, instead of Oppenheimer.",
        "Communist red underneath joke?\n\nJust a crossdressing joke?\n\n***I am also lost***",
        "https://imgur.com/a/xKcAZUH\nBing AI is nuts.",
        "there are some transmascs like this. The scoville rating is extreme, lemme tell ya",
        "Barbieheimer",
        "Sometimes I swear this sub is medically stupid",
        "If your gf would break up with you over you not getting a joke then I don't think she is worth your time",
        "It’s amusing to imagine that Oppenheimer wore $4,200 lingerie under his regular outfit.",
        "Where in the fuck is he finding a suit coat for $10 ans I’ll take 10",
        "https://preview.redd.it/4mvylabbofeb1.jpeg?width=750&format=pjpg&auto=webp&s=fcda20969b915f5d90505a739b78c574125bdaef\n\nI Am Fucking DONE WITH THIS SUBREDDIT",
        "Hi, Peter's dads ghost here. The joke is that the guy in the picture is wearing women's underwear you drunk fat idiot",
        "Peter’s recently drained cyst here: it’s a bad homophobic joke.",
        "Barbenheimer. I saw a similar meme but as the fit to see both of the movies but you don’t wanna change.",
        "Be more fitting for J Edgar Hoover"
    ],
    "Oppenheimer (2023)": [
        "“I am death, destroyer of worlds… huh that sounded kinda better in my head”",
        "The city of Hiroshima: Aaaaaaand it's right behind me, isn't it?",
        "*American planes appear over Japan*\n\n “We got company!”",
        "Atomi-what-i?",
        "*Little Boy plummeting down to Hiroshima*\n\n“They fly now”\n\n“They FLY NOW?”\n\n“… they fly now.”",
        "\"The truth is... I am Oppenheimer.\"",
        "\"Oof, that's gonna hurt!\"",
        "*Record scratch* yeah thats me",
        "\"*That's* gonna leave a mark!\"",
        "\"Uh, Awkward!\"",
        "The movie should end with CGI battle where Oppenheimer, Einstein and Fermi fight Harry Truman in a uranium-powered mech suit after it was revealed that he wants to take over the world using nukes (this would be a powerful message againts war)",
        "So that's it, huh? We're some kind of Oppenheimer?",
        "\"Did I leave the stove on?\"",
        "Gotta Light?",
        "Fatman: Eviscerates every man, woman and child in its path causing an excruciating amount of suffering \n\nCaptain Robert Lewis – co-pilot of the Enola Gay:\n“Yep, something’s definitely broken🤪”",
        "\"Oppenheimer-doo this crap\""
    ],
    "Sunny fan spotted in the wild, top comment nails it": [
        "69, cowgirl, reverse cowgirl. All the big ones.",
        "I think audiences are going to be very uncomfortable seeing Cillian Murphy's naked penis going into this young girl that you're talking about.",
        "And there is a TWIST. We show it . . .",
        "Shit, it’s me!",
        "Dude hangs dong.",
        "Does he hang dong? I only want to see it if he hangs dong. I have become dong, destroyer of death.",
        "A movie about the invention of the atomic bomb being mainly about hot people fucking is exactly what I want cinema to be.",
        "You have to have sex with Oppenheimer… because of the implication",
        "That is brilliant! That is the most brilliant movie I have ever heard of in my life.",
        "On the plus side, he basically just explained the whole movie so we don't have to watch it.",
        "Bomb. Penetration. Until the movie just sort of ends. In an explosion.",
        "So Oppenheimer can smell crime?",
        "What if he could smell… atoms?",
        "An incredibly hot but skeptical female lab partner in which he performs outrageous sexual experiments on her supple young body",
        "I like how Dennis’ “big idea” is jus a run of the mill porn.",
        "I spot Sunny fans in literally every sub I’m in lmao."
    ]
}